Repository: 12Gitcat/docs
Catalog: locale/*/LC_MESSAGES/wallets/dashcore/advanced.po
Languages: es

source: Advanced topics
es: Temas avanzados

source: Coin Control
es: Control de monedas

source: Coin Control allows users of the Dash Core Wallet to specify which addresses and Unspent Transaction Outputs (UTXOs) should be used as inputs in transactions. This allows you to keep a specific balance on certain addresses in your wallet, while spending others freely. In Dash Core Wallet, click **Settings > Options > Wallet > Enable coin control features**. Now, when you go to the Send tab in your wallet, a new button labelled **Inputs…** will appear. Click this button to select which UTXOs can be used as input for any transactions you create. The following window appears:
es: El control de monedas permite a los usuarios de la billtera Dash Core especificar qué direcciones y salidas de transacciones no utilizadas (UTXOs) deben usarse como entradas en las transacciones. Esto te permite mantener un saldo específico en ciertas direcciones en tu billetera, mientras que gastas otros libremente. En la billetera Dash Core, haz click en **Configuración > Opciones > Billetera > Habilitar funciones de control de monedas**. Ahora, cuando vayas a la pestaña Enviar en tu billetera, aparecerá un nuevo botón con la etiqueta **Entradas ...**. Haz click en este botón para seleccionar qué UTXOs se pueden usar como entrada para cualquier transacción que crees. La siguiente ventana aparecerá:

source: Coin Selection window in Dash Core wallet, showing two masternodes (testnet)
es: Ventana de selección de monedas en la billetera Dash Core, que muestra dos masternodes (red de prueba)

source: Right click on the transaction(s) you do not want to spend, then select **Lock unspent**. A small lock will appear next to the transaction. You can click the **Toggle lock state** button to invert the locked/unlocked state of all UTXOs. When you are ready to continue, click **OK**. You can now safely create transactions with your remaining funds without affecting the locked UTXOs.
es: Haz click derecho en la(s) transacción(es) que no deseas gastar, luego selecciona **Bloquear sin gastar**. Aparecerá un pequeño candado junto a la transacción. Puedes hacer click en el botón **Conmutar estado de bloqueo** para invertir el estado bloqueado/desbloqueado de todos los UTXOs. Cuando estés listo para continuar, haz click en **Aceptar**. Ahora puedes crear transacciones de forma segura con los fondos restantes sin afectar los UTXOs bloqueados.

source: Locking UTXOs in Dash Core wallet
es: Bloquear UTXOs en la billetera Dash Core

source: Multisignature
es: Multifirma

source: This section presents a worked example to demonstrate multisig functionality in Dash Core. While the transactions are no longer visible on the current testnet blockchain and some address formats or RPC responses may differ slightly from the version shown here, the principle and commands are the same. The example demonstrates how to set up a 2-of-3 multisig address and create a transaction. The example parties involved are a buyer, a seller and an arbiter. This example is based on:
es: Esta sección presenta un ejemplo trabajado para demostrar la funcionalidad multifirma en Dash Core. Si bien las transacciones ya no son visibles en la cadena de bloques de la red de prueba actual y algunos formatos de direcciones o respuestas de RPC pueden diferir ligeramente de la versión que se muestra aquí, el principio y los comandos son los mismos. El ejemplo muestra cómo configurar una dirección multifirma de 2-de-3 y crear una transacción. Las partes de ejemplo involucradas son un comprador, un vendedor y un árbitro. Este ejemplo se basa en:

source: Step 1: Create three addresses
es: Paso 1: Crear tres direcciones

source: Seller::
es: Vendedor::

source: Buyer::
es: Comprador::

source: Arbiter::
es: Árbitro::

source: This results in three keypairs (public/private)::
es: Esto resulta en tres pares de llaves (pública/privada)::

source: Step 2: Create multisig address
es: Paso 2: Crear una dirección multifirma

source: The ``createmultisig`` command takes as variables the number n signatures of m keys (supplied as json array) required. In this example, 2 of 3 keys are required to sign the transaction.
es: El comando ``createmultisig`` toma como variables el número n de firmas de m claves (suministradas como arreglo json) requeridas. En este ejemplo, se requieren 2 de 3 llaves para firmar la transacción.

source: Note: The address can be created by anyone, as long as the public keys and their sequence are known (resulting address and redeemScript are identical, see below).
es: Nota: Cualquier persona puede crear la dirección, siempre que se conozcan las llaves públicas y su secuencia (la dirección resultante y redeemScript son idénticos, ver abajo).

source: Step 3: Buyer funds the multisig address
es: Paso 3: el comprador financia la dirección multifirma

source: This works the same as a usual transaction.
es: Esto funciona igual que una transacción normal.

source: The seller/arbiter can trace the transaction by its txid in the block explorer. Or from the console as follows.
es: El vendedor/árbitro puede rastrear la transacción por su txid en el explorador de bloques. O desde la consola de la siguiente manera.

source: Step 4: Spending the multisig
es: Paso 4: Gastar la multifirma

source: Now we assume the deal is complete, the buyer got the goods and everyone is happy. Now the seller wants to get his Dash. As a 2-of-3 multisig was used, the transaction must be signed by 2 parties (seller + buyer or arbiter). The seller creates a transaction (we will reuse his public address from above).
es: Ahora suponemos que el trato está completo, el comprador obtuvo los productos y todos están contentos. Ahora el vendedor quiere obtener sus Dash. Como se utilizó una multifirma de 2-de-3, la transacción debe estar firmada por 2 partes (vendedor + comprador o árbitro). El vendedor crea una transacción (reutilizaremos su dirección pública de arriba).

source: And partially signs it, using the redeemScript, scriptPubKey and his private key
es: Y lo firma parcialmente, usando redeemScript, scriptPubKey y su llave privada

source: Note that the output hex is getting longer, but complete flag is "false" as the transaction needs another signature. So now either the buyer or the arbiter can complete the signature of the transaction, using the output from above and their private key. Let's assume the buyer is completing the signature.
es: Ten en cuenta que el hexágono de salida se hace más largo, pero el indicador completo es "falso" ya que la transacción necesita otra firma. Entonces, ahora el comprador o el árbitro pueden completar la firma de la transacción, utilizando el resultado de arriba y sus llaves privada. Supongamos que el comprador está completando la firma.

source: The signature is complete now, and either of the parties can transmit the transaction to the network.
es: La firma está completa ahora, y cualquiera de las partes puede transmitir la transacción a la red.

source: Again, this transaction can be traced in a block explorer. And the seller is happy to receive his coins at his public address as follows.
es: De nuevo, esta transacción se puede rastrear en un explorador de bloques. Y el vendedor está feliz de recibir sus monedas en su dirección pública de la siguiente manera.
