Repository: 12Gitcat/docs
Catalog: locale/*/LC_MESSAGES/wallets/dashcore/cmd-rpc.po
Languages: ar, fr, ru, zh_cn

source: Estimates the approximate fee per kilobyte needed for a transaction to begin confirmation within nblocks blocks.
ar: تقدير الرسوم التقريبية لكل كيلوبايت مطلوبة للمعاملة لبدء التأكيد داخل كتل nblocks.
fr: Estime les frais approximatifs par Ko nécessaires pour qu'une transaction commence à être confirmée dans les n blocs.
ru: Оценивает для транзакции приблизительную комиссию за килобайт, чтобы начать подтверждение блоков среди nblocks.
zh_cn: 估算交易中每千字节的费率，以便在nblocks区块中开始确认。

source: estimatepriority nblocks
ar: تقدير كتل الأولوية

source: estimatesmartfee nblocks
ar: يقدر martfee nblocks

source: WARNING: This interface is unstable and may disappear or change! Estimates the approximate fee per kilobyte needed for a transaction to begin confirmation within nblocks blocks if possible and return the number of blocks for which the estimate is valid.
ar: تحذير: هذه الواجهة غير مستقرة وقد تختفي أو تتغير! يقدِّر الرسم التقريبي لكل كيلوبايت اللازم للمعاملات لبدء التثبيت داخل كتل nblocks إن أمكن ، وإرجاع عدد الكتل التي يكون التقدير صحيحًا لها.
fr: AVERTISSEMENT : cette interface est instable et peut disparaître ou être modifiée ! Estime les frais approximatifs par Ko nécessaires pour qu'une transaction commence à être confirmée dans les n blocs, si possible, et renvoie le nombre de blocs pour lequel l'estimation est valable.
ru: ПРЕДУПРЕЖДЕНИЕ: этот интерфейс нестабилен и может измениться или исчезнуть! Оценивает примерный размер комиссии за килобайт, которая нужна, чтобы начать подтверждение блоков среди nblocks, если это возможно, и вывести количество блоков, для которых эти расчёты верны.
zh_cn: 警告：本页面不稳定，可能出现页面消失或改变的情况。如有可能，请计算交易中每千字节的费率，以便在nblocks区块中开始确认。此外，请返回计算有效的区块数量。

source: estimatesmartpriority nblocks
ar: تقدير كتل الأولوية الذكية

source: Return information about the given dash address.
ar: قم بإرجاع معلومات حول عنوان داش المحدد.
fr: Renvoie des informations sur l'adresse Dash donnée.
ru: Вывести информацию о данном адресе dash.
zh_cn: 返回既定达世币地址的相关信息。

source: Wallet
ar: محفظة
fr: Portefeuille
ru: Кошелёк
zh_cn: 钱包

source: abandontransaction "txid"
ar: التخلي عن المعاملة "txid"

source: Mark in-wallet transaction <txid> as abandoned. This will mark this transaction and all its in-wallet descendants as abandoned which will allow for their inputs to be respent.
ar: وضع علامة في المحفظة <txid> كما تخلى عنها. سيعمل هذا على وضع علامة على هذه المعاملة وكل أحفادها في المحفظة على أنها مهجورة والتي ستسمح لمدخلاتهم بالشفافية.
fr: Marque la transaction de portefeuille <txid> comme abandonnée. Cela marquera la transaction et tous ses descendants dans le portefeuille comme abandonnés, ce qui permettra à leurs entrées d'être dépensées à nouveau.
ru: Пометить транзакцию <txid> внутри кошелька как брошенную. Эта команда пометит эту транзакцию и все относящиеся к ней транзакции внутри кошелька как брошенные, что позволит ещё раз использовать их вводы.
zh_cn: 将钱包内的交易<txid>标记为已放弃。这意味着该交易和后续的钱包内部交易已经被放弃，它们的输入将被重新分配。

source: addmultisigaddress nrequired ["key",...] ( "account" )
ar: إضافة عنوان multisig nrequired ["مفتاح"، ...] ("حساب")

source: Add a nrequired-to-sign multisignature address to the wallet. Each key is a Dash address or hex-encoded public key. If 'account' is specified (DEPRECATED), assign address to that account.
ar: إضافة عنوان توقيع متعدد إلى التوقيع مطلوب إلى المحفظة. كل مفتاح هو عنوان داش أو المفتاح العمومي المشفر. إذا تم تحديد "الحساب" (اهمال) ، فعيّن عنوانًا لهذا الحساب.
fr: Ajoute une adresse multi-signature de type "n requis pour signer" au portefeuille. Chaque clé est une adresse Dash ou une clé publique codée en hexadécimal. Si "account" est indiqué (OBSOLÈTE), assigner l'adresse à ce compte.
ru: Добавить в кошелёк адрес с мульти-подписью и требованием n подписей. Каждый ключ - это адрес Dash или зашифрованный шестнадцатеричным кодированием публичный ключ. Если задан 'account' (НЕ РЕКОМЕНДУЕТСЯ), привязать адрес к этому аккаунту.
zh_cn: 向钱包添加一个无需签名的多重签名地址。每个私钥都是一个达世币地址或者十六进制编码的公钥。如果指定了“帐户”（DEPRECATED），则为该帐户分配地址。

source: backupwallet "destination"
ar: نسخة احتياطية المحفظة "الوجهة"

source: dumphdinfo
ar: معلومات تفريغ

source: Returns an object containing sensitive private info about this HD wallet.
ar: إرجاع كائن يحتوي على معلومات خاصة حساسة حول هذه المحفظة عالية الدقة.
fr: Renvoie un objet contenant des informations sensibles et confidentielles sur ce portefeuille HD.
ru: Выводит объект, содержащий деликатную приватную информацию об этом HD кошельке.
zh_cn: 返回包含有关本HD钱包的敏感隐私信息的对象。

source: dumpwallet "filename"
ar: تفريغ محفظة "اسم الملف"
fr: dumpwallet "nomdefichier"

source: Dumps all wallet keys in a human-readable format.
ar: تفريغ جميع مفاتيح المحفظة في تنسيق قابل للقراءة من قبل الإنسان
fr: Enregistre toutes les clés du portefeuille dans un format lisible par un humain.
ru: Выводит все ключи кошелька в удобный для чтения формат.
zh_cn: 以用户可读的格式转存所有的钱包私钥。

source: DEPRECATED. Returns the account associated with the given address.
ar: إهمال. إرجاع الحساب المرتبط بالعنوان المحدد.
fr: OBSOLÈTE. Renvoie le compte associé à l'adresse donnée.
ru: УСТАРЕЛО. Выводит аккаунт, связанный с данным адресом.
zh_cn: 超时。返回与既定地址关联的帐户。

source: getaccountaddress "account"
ar: الحصول على عنوان الحساب "الحساب"
fr: getaccountaddress "compte"

source: DEPRECATED. Returns the current Dash address for receiving payments to this account.
ar: إهمال. لعرض عنوان داش الحالي لتلقي الدفعات إلى هذا الحساب.
fr: OBSOLÈTE. Renvoie l'adresse Dash actuelle pour recevoir des paiements sur ce compte.
ru: УСТАРЕЛО. Выводит текущий адрес Dash для получения платежей на этот аккаунт.
zh_cn: 超时。返回当前用于本账户的支付接收的达世币地址。

source: getaddressesbyaccount "account"
ar: الحصول على عناوين حسب الحساب "الحساب"
fr: getaddressesbyaccount "compte"

source: DEPRECATED. Returns the list of addresses for the given account.
ar: إهمال. لعرض قائمة العناوين الخاصة بالحساب المحدد.
fr: OBSOLÈTE. Renvoie la liste d'adresses pour le compte donné.
ru: УСТАРЕЛО. Выводит список адресов данного аккаунта.
zh_cn: 超时。返回既定账户的地址列表。

source: If account is not specified, returns the server's total available balance. If account is specified (DEPRECATED), returns the balance in the account. Note that the account "" is not the same as leaving the parameter out. The server total may be different to the balance in the default "" account.
ar: إذا لم يتم تحديد الحساب ، فيُرجع إجمالي رصيد الخادم المتاح. إذا تم تحديد الحساب (اهمال) ، فسيتم إرجاع الرصيد في الحساب. لاحظ أن الحساب ليس هو نفسه الخروج من المعلمة. قد يختلف إجمالي الخادم عن الرصيد في الحساب الافتراضي.
fr: Si "compte" n'est pas indiqué, renvoie le solde total disponible sur le serveur. Si "compte" est indiqué (OBSOLÈTE), renvoie le solde du compte. À noter que le compte "" n'est pas identique à la non-mention du paramètre. Le total du serveur peut être différent au solde du compte par défaut "".
ru: Если аккаунт не задан, выводит весь доступный на сервере баланс. Если аккаунт задан (УСТАРЕЛО), выводит баланс аккаунта. Обратите внимание, что аккаунт "" это не то же самое, что оставлять этот параметр незаполненным. Баланс сервера может отличать от баланса заданного по умолчанию "" аккаунта.
zh_cn: 如果没有指定账户，返回服务器上的可用总余额。如果指定了帐户（DEPRECATED），则返回帐户中的余额。请注意，帐户""与参数留空不同。服务器上的可用总余额可能与默认帐户上的余额不同""。

source: getnewaddress ( "account" )
ar: الحصول على عنوان جديد ("حساب")
fr: getnewaddress ( "compte" )

source: getrawchangeaddress
ar: الحصول على عنوان التغيير الخام

source: Returns a new Dash address, for receiving change. This is for use with raw transactions, NOT normal use.
ar: لعرض عنوان جديد للشرطة ، لتلقي التغيير. هذا هو للاستخدام مع المعاملات الخام ، وليس الاستخدام العادي.
fr: Renvoie une nouvelle adresse Dash, pour la monnaie rendue. Cela s'utilise avec les transactions brutes, PAS pour une utilisation normale.
ru: Выводит новый адрес Dash для получения сдачи. Подходит исключительно для сырых транзакций, НЕ для обычного использования.
zh_cn: 返回新达世币地址，用于接收零钱。这项用于原始交易，非正常使用。

source: DEPRECATED. Returns the total amount received by addresses with <account> in transactions with specified minimum number of confirmations.
ar: إهمال. لعرض المبلغ الإجمالي المستلم بواسطة العناوين باستخدام <account> في المعاملات مع العدد الأدنى المحدد من التأكيدات.
fr: OBSOLÈTE. Renvoie le montant total reçu par les adresses dans <account> dans des transactions ayant le nombre minimal indiqué de confirmations.
ru: УСТАРЕЛО. Выводит полную сумму полученную адресом за <account> транзакций с определённым минимальным количеством подтверждений.
zh_cn: 超时。返回在地址上收到的总金额，这些<account>交易已经完成了最低限度的确认的交易。

source: Get detailed information about in-wallet transaction <txid>
ar: الحصول على معلومات مفصلة حول المعاملات في المحفظة <txid>
fr: Obtient des informations détaillées sur la transaction de portefeuille <txid>
ru: Получить детальную информацию о транзакции <txid> внутри кошелька
zh_cn: 获取有关钱包内部交易<txid>的相关信息。

source: getunconfirmedbalance
ar: الحصول على التوازن غير المؤكد

source: getwalletinfo
ar: الحصول على معلومات المحفظة

source: Returns an object containing various wallet state info.
ar: إرجاع كائن يحتوي على معلومات حالة المحفظة المختلفة.
fr: Renvoie un objet contenant diverses informations sur l'état de portefeuille.
ru: Выводит объект, содержащий различную информацию о состоянии кошелька.
zh_cn: 返回包含各种钱包状态信息的对象。

source: importaddress "address" ( "label" rescan p2sh )
ar: عنوان الاستيراد "عنوان" ("تسمية" إعادة فحص p2sh)
fr: importaddress "adresse" ( "étiquette" rescan p2sh )

source: Adds a script (in hex) or address that can be watched as if it were in your wallet but cannot be used to spend.
ar: يضيف برنامجًا نصيًا (سداسيًا) أو عنوانًا يمكن مشاهدته كما لو كان في محفظتك ولكن لا يمكن استخدامه في الإنفاق.
fr: Ajoute un script (en hexadécimal) ou une adresse qui peut être surveillée comme si elle était dans votre portefeuille, mais qui ne peut pas être utilisée en dépense.
ru: Добавляет скрипт (с шестнадцатеричным шифрованием) или адрес, за которым можно наблюдать так же, как если бы он был в вашем кошельке, но его нельзя использовать для траты средств.
zh_cn: 添加一个（十六进制的）脚本或可以浏览的地址，这个地址存在于钱包当中，但不能用于消费。

source: importelectrumwallet "filename" index
ar: استيراد الكتروم المحفظة "اسم الملف"
fr: importelectrumwallet "nomdefichier" index

source: Imports keys from an Electrum wallet export file (.csv or .json)
ar: مفاتيح الاستيراد من ملف تصدير محفظة الكتروم (.csv أو .json)
fr: Importe des clés depuis un fichier d'exportation du portefeuille logiciel Electrum (.csv ou .json)
ru: Импортирует ключи из экспортированного файла кошелька Electrum (.csv or .json)
zh_cn: 从轻钱包输出文件中导入地址（.csv或.json）。

source: Adds a private key (as returned by dumpprivkey) to your wallet.
ar: يضيف مفتاح خاص (كما تم إرجاعه بواسطة مفتاح خاص تفريغ) إلى محفظتك.
fr: Ajoute une clé privée (telle que renvoyée par dumpprivkey) à votre portefeuille.
ru: Добавляет в ваш кошелёк приватный ключ (в том виде, в котором был выведен dumpprivkey)
zh_cn: 把（由dumpprivkey返回的）一个私钥添加钱包。

source: importpubkey "pubkey" ( "label" rescan )
ar: استيراد المفتاح العام "المفتاح العام" ("إعادة تسمية")
fr: importpubkey "clépublique" ( "étiquette" rescan )

source: Adds a public key (in hex) that can be watched as if it were in your wallet but cannot be used to spend.
ar: يضيف مفتاحًا عامًا (سداسيًا) يمكن مشاهدته كما لو كان في محفظتك ولكن لا يمكن استخدامه في الإنفاق.
fr: Ajoute une clé publique (en hexadécimal) qui peut être surveillée comme si elle était dans votre portefeuille, mais qui ne peut pas être utilisée en dépense.
ru: Добавляет публичный ключ (в шестнадцатеричном виде), за которым можно наблюдать так же, как если бы он был в вашем кошельке, но его нельзя использовать для траты средств.
zh_cn: 添加一个（十六进制的）可以浏览的公钥，这个地址存在于钱包当中，但不能用于消费。

source: importwallet "filename"
ar: استيراد محفظة "اسم الملف"
fr: importwallet "nomdefichier"

source: Imports keys from a wallet dump file (see dumpwallet).
ar: استيراد مفاتيح من ملف تفريغ محفظة (انظر محفظة تفريغ).
fr: Importe des clés depuis un fichier d'exportation de portefeuille (voir dumpwallet)
ru: Импортирует ключи из дамп-файла кошелька (см. dumpwallet).
zh_cn: 从钱包转存文件导入私钥（更多信息请参阅dumpwallet）。

source: Send an amount to a given address. The amount is a real and is rounded to the nearest 0.00000001
ar: أرسل مبلغًا إلى عنوان معين. المبلغ حقيقي ويتم تقريبه إلى أقرب 0.00000001
fr: Envoie un montant à une adresse donnée. Le montant est un nombre réel et il est arrondi au 0,00000001 dash le plus proche.
ru: Отправить сумму на заданный адрес. Сумма является реальной и округляется до ближайшего 0.00000001
zh_cn: 将金额发送到既定地址。金额应为实数，并四舍五入到0.00000001。

source: Keepass settings.
ar: مفتاح الإعدادات
fr: Réglages KeePass.
ru: Настройки keepass.
zh_cn: Keepass 设置。

source: keypoolrefill ( newsize )
ar: إعادة تعبئة مفتاح المفتاح (إخباري)

source: DEPRECATED. Returns Object that has account names as keys, account balances as values.
ar: إهمال. إرجاع الكائن الذي يحتوي على أسماء الحسابات كمفاتيح ، يتوازن الحساب كقيم.
fr: OBSOLÈTE. Renvoie un objet avec les noms de compte comme clés, et les soldes de compte comme valeurs.
ru: УСТАРЕЛО. Выводит объект, который содержит имя аккаунта в качестве ключа, а баланс аккаунта в качестве значения.
zh_cn: 超时。返回以账户名称为私钥、以账户余额为价值的对象。

source: listaddressgroupings
ar: تجميعات قائمة العناوين

source: listlockunspent
ar: قائمة القفل غير المنفق

source: Returns list of temporarily unspendable outputs. See the lockunspent call to lock and unlock transactions for spending.
ar: إرجاع قائمة النواتج غير القابلة للتحديد مؤقتًا. انظر قفل القفل دعوة لإغلاق وفتح المعاملات لإنفاقها.
fr: Renvoie une liste de sorties temporairement non dépensables. Voir l'appel lockunspent pour verrouiller et déverrouiller des transactions pour la dépense.
ru: Выводит список временно недоступных к использованию выводов. См. вызов lockunspent, чтобы заблокировать или разблокировать транзакции от трат.
zh_cn: 返回暂时不能支出的输出的列表。请参考lockunspent调用来锁定和解锁支出交易。

source: Get all transactions in blocks since block [blockhash], or all transactions if omitted
ar: الحصول على جميع المعاملات في كتل منذ كتلة [blockhash] ، أو جميع المعاملات إذا تم حذفها
fr: Récupère toutes les transactions dans les blocs depuis le bloc [blockhash], ou, si omis, toutes les transactions
ru: Получить все транзакции в блоках, начиная с блока [blockhash], или все транзакции, если параметр опущен
zh_cn: 从[blockhash]区块中获取所有交易或省略所有交易。

source: Returns up to 'count' most recent transactions skipping the first 'from' transactions for account 'account'.
ar: إرجاع ما يصل إلى "حساب" أحدث المعاملات تخطي أول "من" المعاملات لحساب "حساب".
fr: Renvoie les "count" transactions les plus récentes à partir des "from" premières transactions, pour le compte "compte".
ru: Выводит последние транзакции до 'count', пропуская первые транзакции 'from' для аккаунта 'account'.

source: Returns array of unspent transaction outputs with between minconf and maxconf (inclusive) confirmations. Optionally filter to only include txouts paid to specified addresses.
ar: إرجاع مصفوفة معاملات المعاملة غير المنفقة التي تتراوح ما بين دقيقة واحدة إلى الحد الأدنى وتأكيدات بحد أقصى (شامل). اختياريا لتصفية تشمل فقط txouts المدفوعة لعناوين محددة.
fr: Renvoie un tableau de sorties de transaction non dépensées comprenant entre "minconf" et "maxconf" confirmations (incluses). Filtre facultatif possible pour afficher seulement les sorties de transaction payées aux adresses indiquées.
ru: Выводит массив неизрасходованных выводов транзакций, с количеством подтверждений между minconf и maxconf (включительно). При необходимости, фильтрует информацию и выводит только txouts, выплаченные определённым адресам.
zh_cn: 返回在minconf和maxconf之间（包含）没有支出的交易输出数组。可过滤除向指定地址的支付之外的其它交易。

source: Updates list of temporarily unspendable outputs. Temporarily lock (unlock=false) or unlock (unlock=true) specified transaction outputs.
ar: قائمة تحديثات النواتج غير القابلة للإنقاص مؤقتًا. قفل مؤقت (unlock = خطأ) أو إلغاء تأمين (unlock = صحيح) تحديد معاملات المعاملة
fr: Met à jour la liste de sorties temporairement non dépensables. Verrouillez (unlock=false) ou déverrouillez (unlock=true) temporairement les sorties de transaction indiquées.
ru: Обновляет список временно недоступных для использования выводов. Временно блокирует (unlock=false) или снимает блокировку (unlock=true) с заданных выводов транзакции.
zh_cn: 更新暂时不能输出的列表。暂时锁定（unlock = false）或解锁（unlock = true）指定的交易输出。

source: move "fromaccount" "toaccount" amount ( minconf "comment" )
ar: نقل "من الحساب" "إلى حساب" المبلغ (دقيقة ورقية "تعليق")

source: DEPRECATED. Move a specified amount from one account in your wallet to another.
ar: إهمال. نقل مبلغ معين من حساب واحد في محفظتك إلى حساب آخر.
fr: OBSOLÈTE. Déplace un montant indiqué d'un compte de votre portefeuille à un autre.
ru: УСТАРЕЛО. Перенести заданную сумму с одного аккаунта вашего кошелька на другой.
zh_cn: 超时。将指定金额从钱包中的一个帐户移动到另一个帐户。

source: Send an amount to a given address.
ar: أرسل مبلغًا إلى عنوان معين.
fr: Envoi d'un montant à une adresse donnée.
ru: Отправить сумму на заданный адрес.
zh_cn: 将金额发送到指定地址。

source: DEPRECATED. Sets the account associated with the given address.
ar: إهمال. يضبط الحساب المرتبط بالعنوان المحدد
fr: OBSOLÈTE. Définit le compte associé à l'adresse donnée.
ru: УСТАРЕЛО. Задаёт аккаунт, связанный с данным адресом.
zh_cn: 超时。设置与既定地址关联的账户。

source: settxfee amount
ar: مجموعة رسوم رسوم

source: Set the transaction fee per kB. Overwrites the paytxfee parameter.
ar: حدد رسوم المعاملة لكل كيلو بايت. الكتابة فوق معلمة رسوم الدفع tx
fr: Définit les frais de transaction par Ko. Annule le paramètre paytxfee.
ru: Задать комиссию транзакции за kB. Перезаписывает параметр paytxfee.
zh_cn: 设置每千字节的交易费用。覆盖paytxfee参数。

source: walletlock
ar: قفل المحفظة

source: Removes the wallet encryption key from memory, locking the wallet. After calling this method, you will need to call walletpassphrase again before being able to call any methods which require the wallet to be unlocked.
ar: يزيل مفتاح تشفير الحافظة من الذاكرة ، ويغلق محفظتك. بعد استدعاء هذه الطريقة ، ستحتاج إلى استدعاء عبارة مرور المحفظة مرة أخرى قبل أن تتمكن من الاتصال بأي طرق تتطلب فتح المحفظة.
fr: Efface de la mémoire la clé de chiffrage du portefeuille, ce qui verrouille le portefeuille. Après avoir appelé cette méthode, vous devrez appeler walletpassphrase une nouvelle fois pour pouvoir appeler n'importe quelle autre méthode nécessitant un déverrouillage du portefeuille.
ru: Удаляет из памяти шифровальный ключ кошелька, блокируя кошелёк. После вызова этого метода, вам нужно будет снова вызвать walletpassphrase, прежде чем вызывать какие-либо другие методы, потому что для этого требуется разблокировать кошелёк.
zh_cn: 从内存中删除钱包的加密私钥并锁定钱包。调用这一方法后，用户需要再次调用walletpassphrase才能调用任何需要解锁钱包的方法。

source: walletpassphrase "passphrase" timeout ( mixingonly )
ar: عبارة مرور المحفظة ("عبارة المرور")
fr: walletpassphrase "phrasedepasse" timeout ( mixingonly )

source: Stores the wallet decryption key in memory for 'timeout' seconds. This is needed prior to performing transactions related to private keys such as sending dashs
ar: يخزن مفتاح فك تشفير الحافظة في الذاكرة لثواني "المهلة". هذا مطلوب قبل تنفيذ المعاملات المتعلقة بالمفاتيح الخاصة مثل إرسال البيانات
fr: Stocke en mémoire la clé de déchiffrage du portefeuille, pour une durée de "timeout" secondes. Cela est nécessaire avant d'exécuter des transactions impliquant les clés privées, telles que l'envoi de dashs.
ru: Хранит в памяти шифровальный ключ кошелька в течение 'timeout' секунд. Это необходимо делать, прежде чем выполнять транзакции, связанные с приватными ключами, например отправление dashs.
zh_cn: 在内存中存储钱包解密私钥。在执行与私钥相关的交易，例如发送达世币之前，用户需要完成这项操作。

source: walletpassphrasechange "oldpassphrase" "newpassphrase"
ar: تغيير عبارة "تمريرة المحفظة" "عبارة المرور القديمة" "تمريرة جديدة العبارة"
fr: walletpassphrasechange "vieillephrasedepasse" "nouvellephrasedepasse"

source: Changes the wallet passphrase from 'oldpassphrase' to 'newpassphrase'.
ar: تغيير عبارة المرور من "عبارة المرور القديم" إلى "عبارة مرور جديدة".
fr: Modifie la phrase de passe du portefeuille, de "vieillephrasedepasse" à "nouvellephrasedepasse".
ru: Изменяет кодовую фразу кошелька со 'oldpassphrase' на 'newpassphrase'.
zh_cn: 将钱包密码从'oldpassphrase'更改为'newpassphrase'。

source: These commands are accurate as of Dash Core version 0.12.2.1.
fr: Ces commandes sont exactes pour la version 0.12.2.1 de Dash Core.
zh_cn: 达世币核心版本0.12.2.1.开始这些命令是准确的

source: Reduce storage requirements by pruning (deleting) old blocks. This mode is incompatible with -txindex and -rescan. Warning: Reverting this setting requires re-downloading the entire blockchain. (default: 0 = disable pruning blocks, >945 = target size in MiB to use for block files)
fr: Réduire les exigences de stockage en élaguant (effaçant) les vieux blocs. Ce mode est incompatible avec -txindex et -rescan. Attention : annuler ce réglage implique de retélécharger la blockchain entière. (par défaut : 0 = désactiver l'élagage de blocs, >945 = taille cible en Mo à utiliser pour les fichiers de blocs)
zh_cn: 通过（删除）减少陈旧的区块来降低存储要求。这一设置与-txindex和-rescan不兼容。警告：恢复这一设置需要重新下载整个区块链。 （默认：0 意为精简区块，> 945 用于设置区块文件的大小）

source: Connect only to the specified node(s)
fr: Se connecter seulement au(x) nœud(s) indiqué(s)
zh_cn: 只连接到指定的节点（多个）

source: Query for peer addresses via DNS lookup, if low on addresses (default: 1 unless -connect)
fr: Demander les adresses de pairs par consultation DNS, si le nombre d'adresses devient faible (défaut : 1, sauf si -connect)
zh_cn: 如果地址不足，则通过DNS查询其他用户的地址（默认值：1 除非 -connect）

source: Whitelist peers connecting from the given netmask or IP address. Can be specified multiple times. Whitelisted peers cannot be DoS banned and their transactions are always relayed, even if they are already in the mempool, useful e.g. for a gateway
fr: Pairs en liste blanche se connectant depuis un masque de réseau ou une adresse IP donné(e). Peut être indiqué plusieurs fois. Les pairs en liste blanche ne peuvent pas être bannis pour DoS et leurs transactions sont toujours retransmises, même si elles sont déjà dans le tampon mémoire, ce qui est utile par ex. pour une passerelle
zh_cn: 被列入白名单的用户从既定的网络掩码或IP地址上建立连接。用户可以进行多次指定。用户无法对列入白名单的用户使用禁用服务的功能。即使白名单用户的交易已经存在内存池当中，它们也总是会被中继

source: Force relay of transactions from whitelisted peers even they violate local relay policy (default: 1)
fr: Obliger la retransmission des transactions depuis les pairs en liste blanche, même si elles violent les règles locales de retransmission (défaut : 1)
zh_cn: 即使被列入白名单的用户违反了本地中继政策，也强制执行交易中继（默认值：1）

source: A fee rate (in DASH/kB) that will be used when fee estimation has insufficient data (default: 0.0002)
fr: Un taux de frais de transaction (en dashs/Ko) qui sera utilisé quand l'estimation des frais ne dispose pas d'assez de données (défaut : 0,0002)
zh_cn: 当费用计算缺乏必要的数据时所使用的费率，该费率以 (DASH/kB) 为单位（默认值：0.0002）

source: Fees (in DASH/kB) smaller than this are considered zero fee for transaction creation (default: 0.0001)
fr: Seuil de frais de transaction (en dashs/Ko) en-deçà duquel les frais sont considérés nuls pour la création de transaction (défaut : 0,0001)
zh_cn: 比上述费率(DASH/kB)更低的收费被定义为零费率的交易创建（默认值：0.0001）

source: Attempt to recover private keys from a corrupt wallet.dat on startup
fr: Essayer au démarrage de récupérer les clés privées d'un fichier wallet.dat corrompu
zh_cn: 在启动时尝试从损坏的wallet.dat中恢复私钥

source: Send transactions as zero-fee transactions if possible (default: 0)
fr: Envoyer des transactions sans frais si possible (défaut : 0)
zh_cn: 如有可能，使用零费率交易进行交易（默认值：0）

source: If paytxfee is not set, include enough fee so transactions begin confirmation on average within n blocks (default: 2)
fr: Si paytxfee n'est pas défini, inclure suffisamment de frais pour que les transactions commencent à être confirmées en moyenne dans les n blocs (défaut : 2)
zh_cn: 如果没有设置支付交易手续费，用户须在交易中包含足够的费用，方便交易在n个区块上开始确认（默认值：2）
