Repository: 12Gitcat/docs
Catalog: locale/*/LC_MESSAGES/wallets/dashcore/cmd-rpc.po
Languages: ar, fr, ru, zh_cn

source: Bind to given address and whitelist peers connecting to it. Use [host]:port notation for IPv6
ar: ربط العنوان المعطى وأقرانه في القائمة البيضاء بالاتصال به. استخدم [host]: تدوين المنفذ لـ IPv6
fr: Se lier à l'adresse donnée et aux pairs en liste blanche qui s'y connectent. Utiliser la notation [hôte]:port pour IPv6
ru: Привязать к заданному адресу и подключённому к этому адресу белому списку пиров. Использовать запись [host]:port для IPv6
zh_cn: 绑定到既定地址并将连接到该地址的用户列入白名单。使用IPv6的[host]:端口

source: Accept relayed transactions received from whitelisted peers even when not relaying transactions (default: 1)
ar: قبول المعاملات المرحَّلة المتلقاة من أقران القائمة البيضاء حتى عند عدم ترحيل المعاملات (الافتراضي: 1)
fr: Accepter les transactions retransmises reçues des pairs en liste blanche, même si on ne retransmet pas les transactions (défaut : 1)
ru: Принимать транслируемые транзакции, полученные от пиров из белого списка, даже когда транзакции не передаются (по умолчанию: 1)
zh_cn: 即使没有出现交易中继，也总是接受来自白名单用户的中继交易（默认值：1）

source: Tries to keep outbound traffic under the given target (in MiB per 24h), 0 = no limit (default: 0)
ar: يحاول الحفاظ على حركة المرور الصادرة تحت الهدف المحدد (في MiB لكل 24 ساعة) ، 0 = لا يوجد حد (الافتراضي: 0)
fr: Essayer de garder le trafic sortant sous la valeur cible donnée (en Mo par 24 heures), 0 = pas de limite (défaut : 0)
ru: Стараться держать количество исходящего трафика в заданных рамках (в кол-ве Мб за 24 часа), 0 = безлимитный, (по умолчанию: 0)
zh_cn: 使出站流量维持在既定目标以下（单位为MiB/24小时），0 表示无限制（默认值：0）

source: Wallet options
ar: خيارات المحفظة
fr: Options de portefeuille
ru: Настройки кошелька
zh_cn: 钱包选项

source: Do not load the wallet and disable wallet RPC calls
ar: لا تقم بتحميل المحفظة وتعطيل مكالمات استدعاءات RPC
fr: Ne pas charger le portefeuille et désactiver les appels RPC de portefeuille
ru: Не загружать кошелёк и отключить RPC вызовы кошелька
zh_cn: 不要加载钱包，并禁用钱包的远程过程调用功能

source: Set key pool size to <n> (default: 1000)
ar: تعيين حجم تجمع مفتاح ل <n> (افتراضي: 1000)
fr: Fixer la taille de la réserve des clés à <n> (défaut : 1000)
ru: Установить размер пула для ключей <n>(по умолчанию: 1000)
zh_cn: 将密钥池的大小设置为<n>（默认值：1000）

source: Fee (in DASH/kB) to add to transactions you send (default: 0.00)
ar: الرسوم (في داش / kB) للإضافة إلى المعاملات التي ترسلها (القيمة الافتراضية: 0.00)
fr: Frais de transaction (en dashs/Ko) à ajouter aux transactions que vous envoyez (défaut : 0,00)
ru: Комиссия (в DASH/kB), которая добавляется к транзакциями, которые вы отправляете (по умолчанию: 0.00)
zh_cn: 添加到发送的交易所需的费用(DASH/kB)（默认值：0.00）

source: Rescan the block chain for missing wallet transactions on startup
ar: إعادة فحص سلسلة كتلة معاملات المحفظة المفقودة عند بدء التشغيل
fr: Balayer à nouveau la blockchain au démarrage pour repérer les transactions de portefeuille manquantes
ru: При запуске повторно сканировать блокчейн на предмет потерянных транзакций кошелька
zh_cn: 在启动时重新扫描区块链，以便查找丢失的交易

source: Spend unconfirmed change when sending transactions (default: 1)
ar: اقضي على تغيير غير مؤكد عند إرسال المعاملات (الافتراضي: 1)
fr: Dépenser le rendu de monnaie non confirmé à l'envoi de transactions (défaut : 1)
ru: Тратить неподтверждённую сдачу при отправке транзакций (по умолчанию: 1)
zh_cn: 在发送交易时使用未经确认的零钱（默认值：1）

source: User defined seed for HD wallet (should be in hex). Only has effect during wallet creation/first start (default: randomly generated)
ar: تعريف المستخدم البذور لمحفظ HD (يجب أن يكون في ست عشري). يكون تأثيره فقط أثناء إنشاء المحفظة / البدء الأول (افتراضي: يتم إنشاؤه عشوائيًا)
fr: Graine définie par l'utilisateur pour un portefeuille HD (doit être en hexadécimal). N'a d'effet qu'à la création du portefeuille ou à son premier démarrage (défaut : générée aléatoirement)
ru: Заданная пользователем мнемоническая последовательность для HD кошелька (должна быть в hex). Работает только при создании или первом запуске кошелька (по умолчанию: создаётся случайным образом)
zh_cn: 用户定义的HD钱包的种子（应为十六进制）。这项功能只在钱包创建/首次启动时有效（默认值：随机生成）

source: Upgrade wallet to latest format on startup
ar: ترقية المحفظة إلى التنسيق الأحدث عند بدء التشغيل
fr: Mettre à jour le portefeuille au format le plus récent durant le démarrage
ru: При запуске обновлять кошелёк до последней версии
zh_cn: 在启动时将钱包升级到最新格式

source: Specify wallet file (within data directory) (default: wallet.dat)
ar: تحديد ملف محفظة (داخل دليل البيانات) (افتراضي: wallet.dat)
fr: Indiquer le fichier de portefeuille (dans le répertoire de données) (défaut : wallet.dat)
ru: Задать файл кошелька (внутри папки с данными) (по умолчанию: wallet.dat)
zh_cn: （在数据目录中）指定钱包文件（默认值：wallet.dat）

source: Make the wallet broadcast transactions (default: 1)
ar: جعل معاملات بث المحفظة (الافتراضي: 1)
fr: Faire diffuser les transactions par le portefeuille (défaut : 1)
ru: Транслировать транзакции кошелька (по умолчанию: 1)
zh_cn: 确保钱包广播交易（默认值：1）

source: Execute command when a wallet transaction changes (%s in cmd is replaced by TxID)
ar: تنفيذ الأمر عند تغيير معاملة المحفظة ( %s في cmd يتم استبداله بـ TxID)
fr: Exécuter la commande quand une transaction de portefeuille est modifiée (%s dans la commande est remplacé par l'identifiant de transaction)
ru: Выполнить команду, когда транзакция в кошельке изменяется (%sв cmd заменяется TxID)
zh_cn: 钱包交易发生变化时执行命令（cmd中的%s被交易ID所替代）

source: Delete all wallet transactions and only recover those parts of the blockchain through -rescan on startup (1 = keep tx meta data e.g. account owner and payment request information, 2 = drop tx meta data)
ar: احذف جميع معاملات المحفظة واسترجع فقط تلك الأجزاء من بلوكشين خلال -اعادة الفحص عند بدء التشغيل (1 = keep tx meta data على سبيل المثال مالك الحساب ومعلومات طلب الدفع ، 2 = بيانات تعريف tx drop)
fr: Effacer toutes les transactions de portefeuille et ne récupérer que celles faisant partie de la blockchain avec -rescan au démarrage (1 = conserver les métadonnées de transactions, par ex. propriétaire du compte et information de requête de paiement, 2 = effacer les métadonnées de transaction)
ru: Удалить все транзакции кошелька и восстанавливать те части блокчейна только с помощью -rescan при запуске кошелька (1 = хранить метаданные tx, например, данные о владельце аккаунта и информацию о запросе платежа, 2 = сбросить метаданные tx)
zh_cn: 删除所有钱包交易，并且仅在启动时通过-rescan恢复区块链的部分（1表示保留交易元数据，例如账户所有人和请求支付的信息，2 表示删除交易元数据）

source: Number of automatic wallet backups (default: 10)
ar: عدد النسخ الاحتياطية للمحفظة التلقائية (الافتراضي: 10)
fr: Nombre de sauvegardes automatiques du portefeuille (défaut : 10)
ru: Количество автоматических бэкапов кошелька (по умолчанию: 10)
zh_cn: 自动钱包备份的数量（默认值：10）

source: Specify full path to directory for automatic wallet backups (must exist)
ar: تحديد المسار الكامل للدليل للنسخ الاحتياطية للمحفظة التلقائية (يجب أن تكون موجودة)
fr: Indiquer le chemin complet du répertoire des sauvegardes automatiques du portefeuille (doit exister)
ru: Задать полный путь к папке для автоматических бэкапов кошелька (должна быть создана заранее)
zh_cn: 指定自动钱包备份的目录的完整路径（前提是自动钱包备份必须存在）

source: Use KeePass 2 integration using KeePassHttp plugin (default: 0)
ar: استخدام تكامل KeePass 2 باستخدام المكون الإضافي KeePassHttp (الإعداد الافتراضي: 0)
fr: Utilise l'intégration KeePass 2 avec le plug-in KeePassHttp (par défaut : 0)
ru: Использование интеграции KeePass 2 при помощи плагина KeePassHttp (по умолчанию: 0)
zh_cn: 借助KeePassHttp插件来使用KeePass 2集成功能（默认值：0）

source: Connect to KeePassHttp on port <port> (default: 19455)
ar: الاتصال KeePassHttp على المنفذ <port> (افتراضي: 19455)
fr: Connexion à KeePassHttp par le port <port> (par défaut : 19455)
ru: Соединение с KeePassHttp через порт <port> (по умолчанию: 19455)
zh_cn: 通过端口<port>上连接到KeePassHttp（默认值：19455）

source: KeePassHttp key for AES encrypted communication with KeePass
ar: مفتاح KeePassHttp للتواصل المشفر مع AES KeePass
fr: Clé KeePassHttp pour la communication chiffrée AES avec KeePass
ru: Ключ KeePassHttp для AES encrypted communication с помощью KeePass
zh_cn: 借助KeePassHttp密钥使用KeePass 加密通信功能

source: KeePassHttp id for the established association
ar: معرف KeePassHttp للرابطة المنشأة
fr: Identifiant KeePassHttp pour la connexion déjà établie
ru: KeePassHttp id для созданной ассоциации
zh_cn: 已建立关联的KeePassHttp身份

source: Name to construct url for KeePass entry that stores the wallet passphrase
ar: اسم لإنشاء عنوان الرابط لإدخال KeePass الذي يخزن عبارة مرور المحفظة
fr: Nom pour former l'URL pour l'entrée KeePass qui stocke la phrase de passe du portefeuille
ru: Name to construct url for KeePass entry, в которой хранится фраза-пароль кошелька
zh_cn: 用于为KeePass条目构建网址的名称。该条目存储了钱包的密码

source: ZeroMQ notification options
ar: خيارات إعلام ZeroMQ
fr: Options de notification ZeroMQ
ru: Настройки уведомлений ZeroMQ
zh_cn: ZeroMQ通知选项

source: Enable publish hash block in <address>
ar: تمكين حظر التجزئة في <address>
fr: Activer la publication du hachage de bloc dans <address>
ru: Разрешить публикацию хэша блока в <address>
zh_cn: 在<address>中启用发布哈希区块的功能

source: Enable publish hash transaction in <address>
ar: تمكين معالجة التجزئة في <address>
fr: Activer la publication du hachage de transaction dans <address>
ru: Разрешить публикацию хэша транзакции в <address>
zh_cn: 在<address>中启用发布哈希交易的功能

source: Enable publish hash transaction (locked via InstantSend) in <address>
ar: تمكين عملية التجزئة المنشورة (مؤمنة عبر الإرسال الفوري) في <address>
fr: Activer la publication du hachage de transaction (verrouillée par InstantSend) dans <address>
ru: Разрешить публикацию хэша транзакции (заблокирована InstantSend) в <address>
zh_cn: 在<address>中启用发布哈希交易的功能（通过即时发送功能锁定资金）

source: Enable publish hash of governance votes in <address>
ar: تمكين نشر التجزئة من أصوات الحكم في <address>
fr: Activer la publication du hachage des votes de gouvernance dans <address>
ru: Разрешить публикацию хэша голосований управления в <address>

source: Enable publish hash of governance objects (like proposals) in <address>
ar: تمكين نشر التجزئة من كائنات الحوكمة (مثل المقترحات) في <address>
fr: Activer la publication du hachage des objets de gouvernance (comme les propositions budgétaires) dans <address>
ru: Разрешить публикацию хэша объектов управления (например, предложений) в <address>

source: Enable publish transaction hashes of attempted InstantSend double spend in <address>
ar: تمكين تجزئة معاملات النشر لمحاولة الإرسال الفوري <address>
fr: Activer la publication des hachages de transaction pour les tentatives de double dépense InstantSend dans <address>
ru: Разрешить публикацию хэшей транзакций для попытки двойного списания InstantSend в <address>

source: Enable publish raw block in <address>
ar: تمكين نشر كتلة الخام في <address>
fr: Activer la publication du bloc brut dans<address>
ru: Разрешить публикацию сырых блоков в <address>
zh_cn: 在<address>中启用发布原始区块的功能

source: Enable publish raw transaction in <address>
ar: تمكين نشر المعاملة الأولية في <address>
fr: Activer la publication de la transaction brute dans <address>
ru: Разрешить публикацию сырых транзакций в <address>
zh_cn: 在<address>中启用发布原始交易的功能

source: Enable publish raw transaction (locked via InstantSend) in <address>
ar: تمكين نشر المعاملة الأولية (مؤمّنة عبر الإرسال الفوري) في <address>
fr: Activer la publication de la transaction brute (verrouillée par InstantSend) dans <address>
ru: Разрешить публикацию сырых транзакций (заблокированных InstantSend) в <address>
zh_cn: 在<address>中启用发布原始交易的功能（通过即时发送功能锁定资金）

source: Enable publish raw transactions of attempted InstantSend double spend in <address>
ar: تمكين نشر المعاملات الأولية لمحاولات البدء الفوري للإنفاق الفوري في <address>
fr: Activer la publication des transactions brutes pour les tentatives de double dépense InstantSend dans <address>
ru: Разрешить публикацию сырых транзакций для попыток двойного списания InstantSend в <address>

source: Debugging/Testing options
ar: خيارات التصحيح / الاختبار
fr: Options de débogage et de test
ru: Настройки отладки / тестирования
zh_cn: 调试/测试选项

source: Append comment to the user agent string
ar: إلحاق تعليق إلى سلسلة وكيل المستخدم
fr: Ajouter le commentaire à la chaîne d'agent utilisateur
ru: Добавить комментарий к строке агента пользователя
zh_cn: 将注释添加到用户代理字符串

source: Show all debugging options (usage: --help -help-debug)
ar: عرض جميع خيارات التصحيح (الاستخدام: - مساعدة - تصحيح الأخطاء - تصحيح الأخطاء)
fr: Afficher toutes les options de débitage (utilisation : --help -help-debug)
ru: Показать все настройки отладки (использование: --help -help-debug)
zh_cn: 显示所有的调试选项（用法：--help -help-debug）

source: Include IP addresses in debug output (default: 0)
ar: تضمين عناوين IP في إخراج التصحيح (الافتراضي: 0)
fr: Inclure les adresses IP dans la sortie de débogage (défaut : 0)
ru: Включить IP адрес в вывод отладки (по умолчанию: 0)
zh_cn: 在调试输出中包含IP地址（默认值：0）

source: Prepend debug output with timestamp (default: 1)
ar: إعداد إخراج debug مع الطابع الزمني (الافتراضي: 1)
fr: Ajouter l'horodatage au début de la sortie de débogage (défaut : 1)
ru: Поставить временную метку перед выводом отладки (по умолчанию: 1)
zh_cn: 使用时间戳预先调试输出（默认值：1）

source: Send trace/debug info to console instead of debug.log file
ar: إرسال معلومات التتبع / التصحيح إلى وحدة التحكم بدلاً من ملف debug.log
fr: Envoyer les informations de pistage/débogage à la console plutôt qu'au fichier debug.log
ru: Отправить информацию по отслеживанию/отладке на консоль вместо файла debug.log
zh_cn: 将追踪和调试信息发送到控制台而不是debug.log文件

source: Send trace/debug info to debug.log file (default: 1)
ar: إرسال معلومات التتبع / التصحيح إلى ملف debug.log (الإعداد الافتراضي: 1)
fr: Envoyer les informations de pistage/débogage au fichier debug.log (défaut : 1)
ru: Отправить информацию по отслеживанию/отладке в файл debug.log (по умолчанию: 1)
zh_cn: 将追踪和调试信息发送到debug.log文件（默认值：1）

source: Shrink debug.log file on client startup (default: 1 when no -debug)
ar: تقليص ملف debug.log على بدء تشغيل العميل (الافتراضي: 1 عند عدم - debug)
fr: Réduire le fichier debug.log au démarrage du client (défaut : 1 si pas de -debug)
ru: Анализировать файл debug.log при запуске клиента (по умолчанию: 1, когда нет отладки)
zh_cn: 在启动客户端时缩小debug.log文件（默认值：在没有-debug的前提下，默认值是1）

source: Chain selection options
ar: خيارات اختيار سلسلة
fr: Options de sélection de chaîne
ru: Настройки выбора цепочки
zh_cn: 区块链选择的选项

source: Use the test chain
ar: استخدم سلسلة الاختبار
fr: Utiliser la chaîne de test
ru: Использовать тестовую цепочку
zh_cn: 使用测试区块链

source: Disable all Dash specific functionality (Masternodes, PrivateSend, InstantSend, Governance) (0-1, default: 0)
ar: تعطيل كل وظائف داش المحددة (ماسترنود ، الإرسال المخفي ، الإرسال الفوري ، الحوكمة) (0-1 ، القيمة الافتراضية: 0)
fr: Désactiver toutes les fonctions spécifiques à Dash (masternodes, PrivateSend, InstantSend, gouvernance) (0-1, défaut : 0)
ru: Отключить все присущие Dash функции (мастерноды, PrivateSend, InstantSend, Governance) (0-1, по умолчанию: 0)
zh_cn: 禁用所有达世币的特定功能（主节点、匿名发送、即时发送和管理机制等）（范围：0-1，默认值：0）

source: Masternode options
ar: خصائص ماسترنود
fr: Options de masternode
ru: Настройки мастерноды
zh_cn: 主节点选项

source: Enable the client to act as a masternode (0-1, default: 0)
ar: تمكين العميل ليكون بمثابة ماسترنود (0-1 ، الافتراضي: 0)
fr: Activer le client pour qu'il agisse comme un masternode (0-1, défaut : 0)
ru: Разрешить клиенту работать в качестве матерноды (0-1, по умолчанию: 0)
zh_cn: 以客户端充当主节点（范围：0-1，默认值：0）

source: Specify masternode configuration file (default: masternode.conf)
ar: تحديد ملف تكوين ماسترنود (الإعداد الافتراضي: masternode.conf)
fr: Indiquer le fichier de configuration de masternode (défaut : masternode.conf)
ru: Задать файл конфигурации мастерноды (по умолчанию: masternode.conf)
zh_cn: 指定主节点配置文件（默认值：masternode.conf）

source: Lock masternodes from masternode configuration file (default: 1)
ar: قفل ماسترنود من ملف تكوين ماسترنود (الافتراضي: 1)
fr: Verrouiller les masternodes du fichier de configuration de masternode (défaut : 1)
ru: Оградить мастерноды от файла конфигурации мастернод (по умолчанию: 1)
zh_cn: 通过主节点配置文件锁定主节点（默认值：1）

source: Set the masternode private key
ar: تعيين مفتاح خاص للماسترنود
fr: Définir la clé privée de masternode
ru: Установить приватный ключ мастерноды
zh_cn: 设置主节点私钥

source: PrivateSend options
ar: خصائص الإرسال المخفي
fr: Options PrivateSend
ru: Настройки PrivateSend
zh_cn: 匿名发送选项

source: Enable use of automated PrivateSend for funds stored in this wallet (0-1, default: 0)
ar: تمكين استخدام الإرسال المخفي التلقائي للأموال المخزنة في هذه المحفظة (0-1 ، القيمة الافتراضية: 0)
fr: Activer l'utilisation automatique de PrivateSend pour les fonds stockés dans ce portefeuille (0-1, défaut : 0)
ru: Разрешить автоматическое использование PrivateSend для средств в этом кошельке (0-1, по умолчанию: 0)
zh_cn: 批准对本钱包中的资金自动使用匿名发送功能（0-1，默认值：0）

source: Enable multiple PrivateSend mixing sessions per block, experimental (0-1, default: 0)
ar: تمكين جلسات خلط الإرسال المخفي متعددة لكل كتلة ، تجريبية (0-1 ، القيمة الافتراضية: 0)
fr: Activer les sessions multiples de mélange PrivateSend par bloc, expérimental (0-1, défaut : 0)
ru: Разрешить множественные сессии перемешивания PrivateSend для блока, экспериментальная функция (0-1, по умолчанию: 0)
zh_cn: 对每个区块使用多重匿名发送混币流程，这是一个实验性的操作（0-1，默认值：0）

source: Provide liquidity to PrivateSend by infrequently mixing coins on a continual basis (0-100, default: 0, 1=very frequent, high fees, 100=very infrequent, low fees)
ar: توفير السيولة إلى الإرسال المخفي عن طريق خلط العملات المعدنية بشكل متكرر على أساس مستمر (0-100 ، التخلف عن السداد: 0 ، 1 = متكرر للغاية ، رسوم عالية ، 100 = نادر جدًا ، رسوم منخفضة)
fr: Fournir de la liquidité à PrivateSend en mélangeant les fonds de temps à autre mais sans limite de temps (0-100, défaut : 0, 1=très fréquemment, frais élevés, 100=très peu fréquemment, frais bas)
ru: Сохранять ликвидность PrivateSend, изредка перемешивая монеты на постоянной основе (0-100, по умолчанию: 0, 1= очень часто, высокие комиссии, 100 = редко, низкие комиссии)
zh_cn: 通过不频繁的混币操作为匿名发送功能提供流动性（范围：0-100，默认值：0，1表示非常频繁和高额费用，100 表示频率和费用极低）

source: InstantSend options
ar: خصائص الإرسال الفوري
fr: Options InstantSend
ru: Настройки InstantSend
zh_cn: 即时发送选项

source: Enable InstantSend, show confirmations for locked transactions (0-1, default: 1)
ar: تمكين الإرسال الفوري ، عرض التأكيدات للمعاملات المقفلة (0-1 ، القيمة الافتراضية: 1)
fr: Activer InstantSend, afficher les confirmations pour les transactions verrouillées (0-1, défaut : 1)
ru: Разрешить InstantSend, показывать подтверждения для заблокированных транзакций (0-1, по умолчанию: 1)
zh_cn: 启用即时发送功能，显示有关交易锁定的确认信息（范围：0-1，默认值：1）

source: Execute command when a wallet InstantSend transaction is successfully locked (%s in cmd is replaced by TxID)
ar: تنفيذ الأمر عند تأمين معاملة الإرسال الفوري محفظة بنجاح ( %s في cmd يتم استبداله بـ TxID)
fr: Exécuter la commande quand une transaction de portefeuille InstantSend est verrouillée avec succès (%s dans la commande est remplacé par l'identifiant de transaction)
ru: Выполнить команду, когда транзакция InstantSend из кошелька будет успешно заблокирована (1% в cmd заменяется на TxID)
zh_cn: 当成功锁定即时发送功能时执行命令（cmd中的%s被替换为交易ID）

source: Node relay options
ar: خيارات ترحيل العقد
fr: Options de relais de nœud
ru: Настройки ретрансляции для ноды
zh_cn: 节点中继选项

source: Minimum bytes per sigop in transactions we relay and mine (default: 20)
ar: الحد الأدنى من البايت لكل sigop في المعاملات التي نقوم بترحيلها وبياناتي (الافتراضي: 20)
fr: Nombre minimal d'octets par sigop dans les transactions que nous relayons et minons (défaut : 20)
ru: Минимальное количество байт на операции с подписями в транзакциях, которые мы ретранслируем и майним (по умолчанию: 20)
zh_cn: 在中继和挖矿活动中，每个sigop的最小字节数（默认值：20）

source: Relay and mine data carrier transactions (default: 1)
ar: معاملات ترحيل البيانات والبيانات المتعلقة بالألغام (الافتراضي: 1)
fr: Retransmettre et miner les transactions porteuses de données (défaut : 1)
ru: Ретранслировать и майнить транзакции с данными (по умолчанию: 1)
zh_cn: 在中继和挖矿活动中的数据载体交易（默认值：1）

source: Maximum size of data in data carrier transactions we relay and mine (default: 83)
ar: الحد الأقصى لحجم البيانات في معاملات شركات نقل البيانات التي نقوم بترحيلها وبياناتي (الافتراضي: 83)
fr: Taille maximale des données dans les transactions porteuses de données que nous relayons et minons (défaut : 83)
ru: Максимальный размер данных в транзакциях с данными, которые мы ретранслируем и майним (по умолчанию: 83)
zh_cn: 在中继和挖矿活动中，数据载体交易的数据最大值（默认值：83）

source: Block creation options
ar: حظر خيارات الإنشاء
fr: Options de création de bloc
ru: Настройки создания блока
zh_cn: 区块创建选项

source: Set maximum size of high-priority/low-fee transactions in bytes (default: 10000)
ar: تعيين الحد الأقصى لحجم المعاملات عالية الأولوية / منخفضة الرسوم بالبايت (الافتراضي: 10000)
fr: Définir la taille maximale en octets des transactions de haute priorité/frais bas (défaut : 10000)
ru: Задать максимальный размер транзакции с высоким приоритетом / низкой комиссией, в байтах (по умолчанию: 10000)
zh_cn: 以字节为单位设置高优先级和最低交易成本的交易（默认值：10000）

source: RPC server options
ar: خيارات خادم RPC
fr: Options de serveur RPC
ru: Настройки RPC сервера
zh_cn: 远程过程调用服务器选项

source: Accept command line and JSON-RPC commands
ar: قبول سطر الأوامر وأوامر JSON-RPC
fr: Accepter les commandes en ligne de commande et JSON-RPC
ru: Принимать команды командной строки и JSON-RPC
zh_cn: 接受命令行和JSON-RPC命令

source: Accept public REST requests (default: 0)
ar: قبول طلبات REST العامة (الافتراضي: 0)
fr: Accepter les requêtes publiques REST (défaut : 0)
ru: Принимать публичные запросы REST (по умолчанию: 0)
zh_cn: 接受公共REST请求（默认值：0）

source: Bind to given address to listen for JSON-RPC connections. Use [host]:port notation for IPv6. This option can be specified multiple times (default: bind to all interfaces)
ar: ربط عنوان معين للاستماع إلى اتصالات JSON-RPC. استخدم [host]: تدوين المنفذ لـ IPv6. يمكن تحديد هذا الخيار عدة مرات (افتراضي: ربط لجميع الواجهات)
fr: Se lier à l'adresse donnée pour écouter les connexions JSON-RPC. Utiliser la notation [hôte]:port pour IPv6. Cette option peut être choisie plusieurs fois (défaut : lien avec toutes les interfaces)
ru: Прослушивать заданный адрес на предмет JSON-RPC подключений. Использовать запись вида [host]:port для IPv6. Эту опцию можно настраивать множество раз (по умолчанию: прослушивать все интерфейсы)
zh_cn: 绑定到既定地址以等待JSON-RPC连接。使用IPv6的 [host]:端口。用户可以多次设定这个选项（默认值：绑定到所有接口）

source: Location of the auth cookie (default: data dir)
ar: موقع ملف تعريف الارتباط auth (الإعداد الافتراضي: البيانات dir)
fr: Emplacement du cookie d'authentification (défaut : répertoire de données)
ru: Местонахождение auth cookie (по умолчанию: директория с данными)
zh_cn: 身份验证cookie的位置（默认值：数据目录）

source: Username for JSON-RPC connections
ar: اسم المستخدم لاتصالات JSON-RPC
fr: Nom d'utilisateur pour les connexions JSON-RPC
ru: Имя пользователя для JSON-RPC подключений
zh_cn: JSON-RPC连接的用户名

source: Password for JSON-RPC connections
ar: كلمة المرور لاتصالات JSON-RPC
fr: Mot de passe pour les connexions JSON-RPC
ru: Пароль для JSON-RPC подключений
zh_cn: JSON-RPC连接的密码

source: Listen for JSON-RPC connections on <port> (default: 9998 or testnet: 19998)
ar: استمع لاتصالات JSON-RPC <port> (افتراضي: 9998 أو testnet: 19998)
fr: Écouter les connexions JSON-RPC sur <port> (défaut : 9998 ou réseau de test : 19998)
ru: Прослушивать JSON-RPC подключения на <port> (по умолчанию: 9998 или тестнет: 19998)
zh_cn: 在<port>上等待JSON-RPC连接（默认值：9998或测试网：19998）
