Repository: 12Gitcat/docs
Catalog: locale/*/LC_MESSAGES/wallets/dashcore/cmd-rpc.po
Languages: ar, fr, ru, zh_cn

source: Allow JSON-RPC connections from specified source. Valid for <ip> are a single IP (e.g. 1.2.3.4), a network/netmask (e.g. 1.2.3.4/255.255.255.0) or a network/CIDR (e.g. 1.2.3.4/24). This option can be specified multiple times
ar: السماح لاتصالات JSON-RPC من المصدر المحدد. صالحة ل <ip> عبارة عن عنوان IP فردي (على سبيل المثال ، 1.2.3.4) ، وشبكة / قناع شبكة (على سبيل المثال 1.2.3.4/255.255.255.0) أو شبكة / CIDR (على سبيل المثال 1.2.3.4/24). يمكن تحديد هذا الخيار عدة مرات
fr: Autoriser les connexions JSON-RPC depuis une source précisée. Valide quand <ip> sont une seule adresse IP (par ex. 1.2.3.4), un réseau ou masque de réseau (par ex. 1.2.3.4/255.255.255.0) ou un réseau/CIDR (par ex. 1.2.3.4/24). Cette option peut être indiquée plusieurs fois
ru: Разрешить JSON-RPC подключения от заданного источника. Действительно для <ip> единичных IP (например, вида 1.2.3.4), сети/маски сети (например, 1.2.3.4/255.255.255.0) или сети/CIDR (например, 1.2.3.4/24). Эту опцию можно настраивать множество раз.
zh_cn: 批准来自指定来源的JSON-RPC连接。对<ip>有效的是单个IP​​（例如1.2.3.4）、网络/网络掩码（例如1.2.3.4/255.255.255.0）或网络/ CIDR（例如1.2.3.4/24）。用户可以多次设定这个选项。

source: Set the number of threads to service RPC calls (default: 4)
ar: تعيين عدد مؤشرات الترابط لخدمة المكالمات RPC (الافتراضي: 4)
fr: Définir le nombre de files pour les appels RPC (défaut : 4)
ru: Задать количество потоков, которые обслуживают RPC вызовы (по умолчанию: 4)
zh_cn: 设置远程过程调用的线程数（默认值：4）

source: Dash Core QT GUI, use same command line options as dashd with additional options for UI as described below.
ar: داش كور ، استخدم نفس خيارات سطر الأوامر مثل dashd مع خيارات إضافية لواجهة المستخدم كما هو موضح أدناه.
fr: Interface graphique Dash Core QT, utiliser les mêmes options de ligne de commande que dashd avec des options supplémentaires pour l'interface graphiques telles que décrites ci-dessous.
ru: Dash Core QT GUI, использовать те же настройки командной строки, что и для dashd, с дополнительными настройками для UI, описанными ниже.
zh_cn: Dash Core QT GUI，使用与dashd相同的命令行选项，并添加以下的用户界面设置。

source: dash-qt [command-line options]
ar: dash-qt [خيارات سطر الأوامر]
fr: dash-qt [options de ligne de commande]
zh_cn: dash-qt [命令行选项]

source: Start Dash Core QT GUI
ar: بدأ داش كور
fr: Démarrer l'interface graphique Dash Core QT
ru: Запустить Dash Core QT GUI
zh_cn: 启动Dash Core QT GUI

source: Wallet window title
ar: عنوان واجهة المحفظة
fr: Titre de la fenêtre de portefeuille
ru: Название окна кошелька
zh_cn: 钱包窗口标题

source: UI options
ar: خصائص UI
fr: Options d'interface graphique
ru: Настройки UI
zh_cn: 用户界面选项

source: Choose data directory on startup (default: 0)
ar: اختيار دليل البيانات عند بدء التشغيل (الافتراضي: 0)
fr: Choisir au démarrage le répertoire de données (défaut : 0)
ru: Выбрать папку с данными при запуске (по умолчанию: 0)
zh_cn: 在启动时选择数据目录（默认值：0）

source: Set language, for example "de_DE" (default: system locale)
ar: ضبط اللغة ، على سبيل المثال "de_DE" (افتراضي: locale)
fr: Choisir la langue, par exemple "de_DE" (défaut : langue du système)
ru: Установить язык, например "de_DE" (по умолчанию: язык системы)
zh_cn: 设置语言，例如"de_DE"（默认值：系统定位）

source: Start minimized
ar: بداية الحد الادنى
fr: Démarrer en mode minimisé
ru: Запускать свёрнутым в системный лоток
zh_cn: 开始最小化

source: Set SSL root certificates for payment request (default: -system-)
ar: تعيين شهادات جذر SSL لطلب الدفع (الافتراضي: -system-)
fr: Définir les certificats racine SSL pour les requêtes de paiement (défaut : -system-)
ru: Установить корневые сертификаты SSL для платёжных запросов (по умолчанию -system-)
zh_cn: 为支付申请设置SSL root 认证（默认值：-system-）

source: Show splash screen on startup (default: 1)
ar: إظهار شاشة البداية عند بدء التشغيل (الافتراضي: 1)
fr: Afficher l'écran d'accueil au démarrage (défaut : 1)
ru: Показывать заставку при запуске (по умолчанию: 1)
zh_cn: 启动时显示启动画面（默认值：1）

source: Reset all settings changed in the GUI
ar: إعادة ضبط جميع الإعدادات التي تم تغييرها في واجهة المستخدم الرسومية
fr: Réinitialiser tous les réglages modifiés dans l'interface graphique
ru: Сбросить все настройки, которые изменялись в GUI
zh_cn: 重置GUI变更的所有设置

source: Dash Core RPC client
ar: مستخدمين داش كور
fr: Client RPC Dash Core
ru: RPC клиент Dash Core
zh_cn: Dash Core RPC客户端

source: dash-cli [options] <command> [params]
ar: dash-cli [خصائص] <command> [params]
fr: dash-cli [options] <command> [paramètres]

source: Send command to Dash Core
ar: ارسال الأوامر الى داش كور
fr: Envoyer une commande à Dash Core
ru: Отправить команду Dash Core
zh_cn: 向达世币核心发送命令

source: dash-cli [options] help
ar: dash-cli [خصائص] مساعدة

source: List commands
ar: لائحة الأوامر
fr: Afficher la liste des commandes
ru: Список команд
zh_cn: 命令列表

source: dash-cli [options] help <command>
ar: dash-cli [خصائص] مساعدة <command>

source: Get help for a command
ar: الحصول على مساعدة لأمر
fr: Obtenir de l'aide sur une commande
ru: Получить помощь по команде
zh_cn: 获得帮助命令

source: This help message
ar: رسالة المساعدة
fr: Ce message d'aide
ru: Справочное сообщение
zh_cn: 这则帮助信息

source: Enter regression test mode, which uses a special chain in which blocks can be solved instantly. This is intended for regression testing tools and app development.
ar: ادخل إلى وضع اختبار الانحدار ، والذي يستخدم سلسلة خاصة يمكن من خلالها حل الكتل على الفور. هذا مخصص الأدوات اختبار الانحدار وتطوير التطبيق.
fr: Basculer en mode de test de régression, qui utilise une chaîne spéciale dans laquelle les blocs peuvent être résolus instantanément. Cela sert aux outils de test de régression et au développement d'applications.
ru: Войти в регрессивный тестовый режим, использующий специальную цепочку, в которой блоки можно решать мгновенно. Он предназначен для инструментов регрессивного тестирования и разработки приложений.
zh_cn: 进入回归测试模式，该模式使用一个特殊的链，可以立即处理区块。这项操作适用于回归测试工具和应用程序开发。

source: Send commands to node running on <ip> (default: 127.0.0.1)
ar: إرسال أوامر إلى عقدة قيد التشغيل <ip> (الإعداد الافتراضي: 127.0.0.1)
fr: Envoyer des commandes au nœud tournant sur <ip> (défaut : 127.0.0.1)
ru: Отправить команду ноде, работающей на <ip>(по умолчанию: 127.0.0.1)
zh_cn: 向在<ip>运行的节点发送命令(默认: 127.0.0.1)

source: Connect to JSON-RPC on <port> (default: 9998 or testnet: 19998)
ar: اتصل بـ JSON-RPC <port> (افتراضي: 9998 أو testnet: 19998)
fr: Se connecter à JSON-RPC sur <port> (défaut : 9998 ou réseau de test : 19998)
ru: Подключиться к JSON-RPC на <port> (по умолчанию: 9998 или тестнет: 19998)
zh_cn: 在<port>连接JSON-RPC(默认：9998或测试网：19998）

source: Wait for RPC server to start
ar: انتظر حتى يبدأ خادم RPC
fr: Attendre que le serveur RPC ait démarré
ru: Ожидать, пока запустится RPC сервер
zh_cn: 等待RPC服务启动

source: Timeout during HTTP requests (default: 900)
ar: المهلة خلال طلبات HTTP (افتراضي: 900)
fr: Durée d'expiration des requêtes HTTP (défaut : 900)
ru: Время ожидания между HTTP запросами (по умолчанию: 900)
zh_cn: HTTP请求超时（默认：900）

source: Dash Core dash-tx utility
ar: داش كور dash-tx
fr: Utilitaire dash-tx de Dash Core
ru: Утилита dash-tx в Dash Core
zh_cn: Dash Core dash-tx 功能

source: dash-tx [options] <hex-tx> [commands]
ar: dash-tx [خصائص] <hex-tx> [الأوامر]
fr: dash-tx [options] <hex-tx> [commandes]

source: Update hex-encoded dash transaction
ar: تحديث المعاملة داش ترميز عرافة
fr: Mettre à jour les transactions Dash codées en hexadécimal
ru: Обновить зашифрованную шестрандцатеричным кодированием транзакцию dash
zh_cn: 升级十六进制达世币交易

source: dash-tx [options] -create [commands]
ar: dash-tx [خصائص] -انشاء [الأوامر]
fr: dash-tx [options] -create [commandes]

source: Create hex-encoded dash transaction
ar: إنشاء المعاملة داش ترميز عرافة
fr: Créer une transaction Dash codée en hexadécimal
ru: Создать зашифрованную шестрандцатеричным кодированием транзакцию dash
zh_cn: 创建十六进制达世币交易

source: Create new, empty TX.
ar: إنشاء TX جديد وفارغ.
fr: Créer une transaction neuve, vide.
ru: Создать новую, пустую TX
zh_cn: 创建新的，空白交易。

source: Select JSON output
ar: حدد إخراج JSON
fr: Choisir la sortie JSON
ru: Выбрать вывод JSON
zh_cn: 选择JSON输出

source: Output only the hex-encoded transaction id of the resultant transaction.
ar: إخراج معرف المعاملة المشفرة سداسيًا فقط من المعاملة الناتجة.
fr: Passer en sortie uniquement l'identifiant de transaction codé en hexadécimal de la transaction résultante.
ru: Выводить только ID зашифрованной шестнадцатеричным кодированием транзакции.
zh_cn: 仅输出交易结果的十六进制编码的交易ID

source: Commands
ar: الأوامر
fr: Commandes
ru: Команды
zh_cn: 命令

source: Delete input N from TX
ar: حذف الإدخال N من TX
fr: Effacer l'entrée N de la transaction
ru: Удалять ввод N из TX
zh_cn: 从交易中删除输入N

source: Delete output N from TX
ar: حذف الإخراج N من TX
fr: Effacer la sortie N de la transaction
ru: Удалять вывод N из TX
zh_cn: 从交易中删除输出N

source: Add input to TX
ar: إضافة مدخلات إلى TX
fr: Ajouter l'entrée à la transaction
ru: Добавлять ввод к TX
zh_cn: 向交易增加输入

source: Set TX lock time to N
ar: ضبط TX قفل الوقت N
fr: Définir le temps de verrouillage de la transaction sur N
ru: Установить время блокирования TX на N
zh_cn: 设置交易锁定时间为N

source: Set TX version to N
ar: تعيين إصدار TX إلى N
fr: Définir la version de transaction sur N
ru: Установить версию TX на N
zh_cn: 设置交易版本为N

source: outaddr=VALUE:ADDRESS
ar: outaddr = القيمة: العنوان
fr: outaddr=VALEUR:ADRESSE

source: Add address-based output to TX
ar: أضف الإخراج المستند إلى العناوين إلى TX
fr: Ajouter à la transaction une sortie basée sur l'adresse
ru: Добавить к TX основанный на адресе вывод
zh_cn: 向交易增加基于地址的输出

source: Add data-based output to TX
ar: إضافة الإخراج المستند إلى البيانات إلى TX
fr: Ajouter à la transaction une sortie basée sur les données
ru: Добавить к TX основанный на данных вывод
zh_cn: 向交易增加基于数据的输出

source: Add zero or more signatures to transaction. This command requires JSON registers:prevtxs=JSON object, privatekeys=JSON object. See signrawtransaction docs for format of sighash flags, JSON objects.
ar: إضافة صفر أو أكثر من التوقيعات إلى المعاملة. يتطلب هذا الأمر تسجيلات JSON: prevtxs = JSON object، المفتاح الخاص = JSON object. راجع مستندات تسجيل المعاملة الأولية لتنسيق علامات sighash ، كائنات JSON.
fr: Ajouter zéro signature ou plus à la transaction. Cette commande demande un objet JSON registers:prevtxs=JSON, et un objet privatekeys=JSON. Voir la documentation sur signrawtransaction pour le format des drapeaux sighash, des objets JSON.
ru: Добавить к транзакции ноль или более подписей. Для этой команды требуются регистры JSON: prevtxs = объект JSON, privatekeys=объект JSON. См. документы по подписи сырой транзакции, что узнать больше о форматах и sighash флажках, а также JSON объектах.
zh_cn: 为交易添加零个或多个签名。这一命令要求JSON registers:prevtxs=JSON object且privatekeys=JSON object。有关sighash标志和JSON对象的格式的更多信息请参考signrawtransaction文件。

source: Register Commands
ar: تسجيل الأوامر
fr: Enregistrer des commandes
ru: Команды регистра
zh_cn: 注册命令

source: Load JSON file FILENAME into register NAME
ar: قم بتحميل الملف JSON NAME إلى اسم السجل
fr: Charger le fichier JSON NOMDEFICHIER dans le registre NOM
ru: Загрузить JSON файл ИМЯФАЙЛА в регистр ИМЯ

source: Set register NAME to given JSON-STRING
ar: عيِّن السجل الإسم لإعطائه JSON-STRING
fr: Définir le NOM de registre sur la CHAÎNE-JSON fournie
ru: Установить регистр ИМЯ на заданную JSON-СТРОКУ

source: RPC commands
ar: أوامر RCP
fr: Commandes RPC
ru: Команды RPC
zh_cn: RPC 命令

source: Addressindex
ar: فهرس العناوين
zh_cn: 地址索引

source: getaddressbalance
ar: الحصول على توازن العنوان

source: Returns the balance for an address(es) (requires addressindex to be enabled).
ar: إرجاع الرصيد الخاص بعنوان (عناوين) (يتطلب تمكين فهرس العناوين).
fr: Renvoie le solde d'une ou plusieurs adresses (addressindex doit être activé).
ru: Выводит баланс адреса (адресов) (работает, если включена опция addressindex).
zh_cn: 返回（多）地址的余额（需启用addressindex功能）。

source: getaddressdeltas
ar: الحصول على عنوان deltas

source: Returns all changes for an address (requires addressindex to be enabled).
ar: تقوم بإرجاع كافة التغييرات لعنوان (يتطلب أن يتم تمكين فهرس العناوين).
fr: Renvoie tous les changements d'une adresse (addressindex doit être activé).
ru: Выводит все изменения адреса (работает, если включена опция addressindex).
zh_cn: 返回地址的所有零钱（需启用addressindex功能）。

source: getaddressmempool
ar: الحصول على عنوان mempool

source: Returns all mempool deltas for an address (requires addressindex to be enabled).
ar: إرجاع كافة deltas mempool للحصول على عنوان (يتطلب أن يتم تمكين فهرس العناوين).
fr: Renvoie tous les deltas de tampon mémoire pour une adresse (addressindex doit être activé).
ru: Выводит все дельты мемпула адреса (работает, если включена опция addressindex).
zh_cn: 返回地址的所有内存池（需启用addressindex功能）。

source: getaddresstxids
ar: الحصول على عنوان txids

source: Returns the txids for an address(es) (requires addressindex to be enabled).
ar: لعرض txids لعنوان (عناوين) (يتطلب تمكين فهرس العناوين).
fr: Renvoie les identifiants de transaction d'une ou plusieurs adresses (addressindex doit être activé).
ru: Выводит txid адреса (адресов) (работает, если включена опция addressindex).
zh_cn: 返回（多）地址的所有交易ID（需启用addressindex功能）。

source: getaddressutxos
ar: الحصول على عنوان utxos

source: Returns all unspent outputs for an address (requires addressindex to be enabled).
ar: لعرض جميع النواتج غير المنفقة لعنوان (يتطلب تمكين فهرس العناوين).
fr: Renvoie toutes les sorties non dépensées d'une adresse (addressindex doit être activé).
ru: Выводит все непотраченные выводы адреса (работает, если включена опция addressindex).
zh_cn: 返回地址的所有未发送的输出（需启用addressindex功能）。

source: Blockchain
ar: بلوكشين
ru: Блокчейн
zh_cn: 区块链

source: getbestblockhash
ar: الحصول على أفضل تجزئة كتلة

source: getblockchaininfo
ar: الحصول على معلومات سلسلة كتلة

source: getblockcount
ar: الحصول على عدد البلوكات

source: getblockhashes timestamp
ar: احصل على طابع التجزئة

source: Returns array of hashes of blocks within the timestamp range provided.
ar: إرجاع مصفوفة من تجزئة القطع داخل نطاق الطابع الزمني المتوفر.
fr: Renvoie un tableau de hachages de blocs inclus dans l'intervalle d'horodatages fourni.
ru: Выводит массив хэшей блоков внутри заданного временного промежутка.
zh_cn: 返回在既定的时间戳范围内的区块哈希数组。

source: getblockheader "hash" ( verbose )
ar: الحصول على رأس كتلة "التجزئة" (مطول)
fr: getblockheader "hash" ( bavard )

source: If verbose is false, returns a string that is serialized, hex-encoded data for blockheader 'hash'. If verbose is true, returns an Object with information about blockheader <hash>.
ar: إذا كان verbose غير صحيح ، فسوف ترجع سلسلة متسلسلة ، بيانات مشفرة عرافة لرأس كتلة 'hash'. إذا كان verbose صحيحًا ، فأرجع كائن يتضمن معلومات حول رأس الحظر <hash>.
fr: Si "bavard" est "false", renvoie une chaîne de données sérialisées et codées en hexadécimal sur l'en-tête de bloc "hash". Si "bavard" est "true", renvoie un objet avec des informations sur l'en-tête de bloc <hash>.
ru: Если подробный режим является ложным, выводит строку, в которой содержатся сериализованные, закодированные шестнадцатеричным шифрованием данные хэша заголовка блока. Если подробный режим является верным, выводит Объект с информацией о заголовке блока <hash>.
zh_cn: 如果verbose错误，则为blockheader哈希返回序列化'的十六进制字符串数据。如果verbose正确，则返回包含blockheader<hash>的相关信息的对象。

source: getblockheaders "hash" ( count verbose )
ar: الحصول على رؤوس كتلة "التجزئة" (العدد المطول)
fr: getblockheaders "hash" ( count bavard )

source: Returns an array of items with information about <count> blockheaders starting from <hash>. If verbose is false, each item is a string that is serialized, hex-encoded data for a single blockheader. If verbose is true, each item is an Object with information about a single blockheader.
ar: إرجاع مصفوفة من العناصر بمعلومات حول <count> رؤوس كتلة تبدأ من <hash> إذا كان verbose خاطئًا ، فكل عنصر عبارة عن سلسلة تسلسلية ، بيانات مشفرة عرافة لرأس كتلة واحد. إذا كان verbose صحيحًا ، فسيكون كل عنصر عبارة عن كائن به معلومات حول كتلة واحدة.
fr: Renvoie un tableau d'éléments avec des informations sur les <count> en-têtes de bloc à partir de <hash>. Si "bavard" est "false", chaque élément est une chaîne de données sérialisées et codées en hexadécimal pour un seul en-tête de bloc "hash". Si "bavard" est "true", chaque élément est un objet avec des informations sur un seul en-tête de bloc.
ru: Выводит массив элементов с информацией о <count> заголовках блока, начиная с <hash>.Если подробный режим является ложным, то каждый элемент является строкой, в которой содержатся сериализованные, закодированные шестнадцатеричным шифрованием данные заголовка блока. Если подробный режим является верным, то каждый элемент - это Объект с информацией о заголовке блока .
zh_cn: 返回一个项目数组，数组中包含从<hash>开始的blockheader<count>的信息。如果verbose错误，则每个项目都应是单个区块头的序列化'的十六进制字符串。如果verbose正确，则每个项目都应是包含单个blockheader相关信息的对象。

source: getchaintips ( count branchlen )
ar: الحصول على نصائح السلسلة (عد branchlen)

source: Return information about all known tips in the block tree, including the main chain as well as orphaned branches.
ar: قم بإرجاع معلومات حول جميع النصائح المعروفة في شجرة الكتلة ، بما في ذلك السلسلة الرئيسية وكذلك الفروع اليتيمة.
fr: Renvoie des informations sur tous les bouts connus dans l'arbre des blocs, dont la chaîne principale aussi bien que les branches orphelines.
ru: Выводит информацию обо всех известных верхушках на древе блоков, включая главную цепочку и брошенные ветви.
zh_cn: 返回有关区块树中所有已知末梢的信息，包括主链和独立分支。

source: getdifficulty
ar: احصل على صعوبة

source: Returns the proof-of-work difficulty as a multiple of the minimum difficulty.
ar: إرجاع صعوبة إثبات العمل كمضاعف لأدنى صعوبة.
fr: Renvoie la difficulté de la preuve de travail en tant que multiple de la difficulté minimale.
ru: Выводит сложность доказательства-работы в форме минимальной сложности.
zh_cn: 将工作量证明难度作为最小难度的倍数返回。

source: getmempoolinfo
ar: الحصول على معلومات mempool

source: Returns details on the active state of the TX memory pool.
ar: لعرض تفاصيل حول الحالة النشطة لمخزن الذاكرة TX.
fr: Renvoie des détails sur l'état actif du tampon mémoire de transactions.
ru: Выводит подробности активного состояния пула памяти TX.
zh_cn: 返回有关交易内存值的活跃状态的细节信息。

source: getrawmempool ( verbose )
ar: الحصول على mempool الخام (مطول)
fr: getrawmempool ( bavard )

source: Returns all transaction ids in memory pool as a json array of string transaction ids.
ar: لعرض جميع معرفات المعاملة في تجمّع الذاكرة كصفيف json لمعرفات معاملات السلسلة.
fr: Renvoie tous les identifiants de transaction dans le tampon mémoire sous forme de tableau JSON des chaînes d'identifiants de transaction.
ru: Выводит ID всех транзакций в пуле памяти в виде массива JSON, состоящего из строк с ID транзакции.
zh_cn: 将交易ID的JSON数组作为内存池中的所有交易ID予以返回。

source: getspentinfo
ar: الحصول على المعلومات المستنفدة

source: Returns the txid and index where an output is spent.
ar: إرجاع txid و الواجهة حيث يتم إنفاق الإخراج.
fr: Renvoie l'identifiant de transaction et l'index correspondant à une sortie dépensée.
ru: Выводит txid и индекс, где потрачен вывод.
zh_cn: 返回输出所用的交易ID和索引。

source: Returns details about an unspent transaction output.
ar: إرجاع تفاصيل حول إخراج المعاملة غير المنفقة.
fr: Renvoie des détails sur une sortie de transaction non dépensée.
ru: Выводит детали непотраченного вывода транзакции.
zh_cn: 返回有关未使用的交易输出的详细信息。

source: gettxoutproof ["txid",...] ( blockhash )
ar: الحصول على دليل tx ["txid"، ...] (كتلة تجزئة)

source: Returns a hex-encoded proof that "txid" was included in a block.
ar: إرجاع دليل مرمز عرافة أن "txid" تم تضمينه في كتلة
fr: Renvoie une preuve codée en hexadécimal que la transaction "txid" a été incluse dans un bloc.
ru: Выводит зашифрованное шестнадцатеричным кодированием доказательства, что "txid" включена в блок.
zh_cn: 返回一个十六进制编码的证明，其中"交易ID"包含在一个区块当中。

source: gettxoutsetinfo
ar: احصل على معلومات مجموعة

source: Returns statistics about the unspent transaction output set. Note this call may take some time.
ar: إرجاع إحصائيات حول مجموعة مخرجات المعاملة غير المنفقة. لاحظ أن هذه المكالمة قد تستغرق بعض الوقت.
fr: Renvoie des statistiques sur le jeu de sorties de transactions non dépensées. Veuillez noter que ça peut prendre un certain temps.
ru: Выводит статистику по непотраченному набору выводов транзакции. Обратите внимание, что это может занять некоторое время.
zh_cn: 返回有关未使用的交易输出的统计信息。需要注意的是这个步骤需要花费一些时间。

source: Verifies blockchain database.
ar: يتحقق قاعدة بيانات بلوكشين.
fr: Vérifie la base de données de la blockchain.
ru: Верифицирует базу данных блокчейна.
zh_cn: 验证区块链数据库。

source: verifytxoutproof "proof"
ar: تحقق من دليل "إثبات"

source: Control
ar: تحكم
fr: Contrôle
ru: Контроль

source: debug ( 0 | 1 | addrman | alert | bench | coindb | db | lock | rand | rpc | selectcoins | mempool | mempoolrej | net | proxy | prune | http | libevent | tor | zmq | dash | privatesend | instantsend | masternode | spork | keepass | mnpayments | gobject )
ar: debug ( 0 | 1 | addrman | alert | bench | coindb | db | lock | rand | rpc | selectcoins | mempool | mempoolrej | net | proxy | prune | http | libevent | tor | zmq | داش | الإرسال المخفي | الإرسال الفوري | ماسترنود | spork | keepass | mnpayments | gobject )

source: getinfo
ar: حصول على المعلومات

source: stop
ar: توقف

source: Stop Dash Core server.
ar: ايقاف خادم داش كور
fr: Arrêter le serveur Dash Core.
ru: Остановить сервер Dash Core.
zh_cn: 停止达世币核心服务器。

source: Dash
ar: داش
zh_cn: 达世币

source: getgovernanceinfo
ar: الحصول على معلومات الحكم

source: Returns an object containing governance parameters.
ar: إرجاع كائن يحتوي على معلمات إدارة.
fr: Renvoie un objet contenant les paramètres de gouvernance.
ru: Выводит объект, содержащий параметры управления.
zh_cn: 返回包含管理参数的对象。

source: getpoolinfo
ar: الحصول على معلومات بركة

source: Returns an object containing mixing pool related information.
ar: إرجاع كائن يحتوي على معلومات متعلقة بمزج تجمع المعلومات.
fr: Renvoie un objet contenant des informations relatives au pool de mélange.
ru: Выводит объект, содержащий информацию о пуле перемешивания.
zh_cn: 返回包含混币池的相关信息的对象。

source: getsuperblockbudget index
ar: الحصول على مؤشر الميزانية كتلة عظمى

source: Returns the absolute maximum sum of superblock payments allowed.
ar: لعرض الحد الأقصى المطلق لمدفوعات superblock المسموح بها
fr: Renvoie la somme maximale absolument autorisée des paiements de superbloc.
ru: Выводит максимально возможную сумму платежей суперблоков.
zh_cn: 返回允许的超级块支付的最大绝对值。

source: gobject "command"...
ar: كائن "الأوامر" ...
fr: gobject "commande"...

source: Manage governance objects. Available commands:
ar: إدارة كائنات الحوكمة. الأوامر المتاحة:
fr: Gérer les objets de gouvernance. Commandes disponibles :
ru: Настроить объекты управления. Доступные команды:
zh_cn: 管理管理对象。可用命令：

source: check
ar: تحقق

source: Validate governance object data (proposal only)
ar: التحقق من صحة بيانات كائن الإدارة (الاقتراح فقط)
fr: Valider les données d'objet de gouvernance (propositions budgétaires seulement)
ru: Подтвердить данные объекта управления (только для предложений)
zh_cn: 验证管理对象数据（仅限提案）

source: prepare
ar: إعداد

source: Prepare governance object by signing and creating tx
ar: إعداد كائن الحوكمة من خلال التوقيع وإنشاء tx
fr: Préparer un objet de gouvernance en le signant et en créant la transaction
ru: Подготовить объект управления, подписав его и создав tx
zh_cn: 通过签名和创建交易来准备管理对象

source: submit
ar: تقديم

source: Submit governance object to network
ar: إرسال كائن الحوكمة إلى الشبكة
fr: Soumettre l'objet de gouvernance au réseau
ru: Отправить объект управления в сеть
zh_cn: 将管理对象提交到网络

source: deserialize
ar: إلغاء تسلسل

source: Deserialize governance object from hex string to JSON
ar: إلغاء تسلسل كائن الإدارة من السلسلة السداسي إلى JSON
fr: Désérialiser l'objet de gouvernance, d'une chaîne hexadécimale en JSON
ru: Десериализовать объект управления из шестнадцатеричной строки в JSON
zh_cn: 将管理对象从十六进制字符串反序列化为JSON

source: count
ar: العداد

source: get
ar: الحصول
