Repository: 12Gitcat/docs
Catalog: locale/*/LC_MESSAGES/wallets/dashcore/cmd-rpc.po
Languages: ar, fr, ru, zh_cn

source: Force relay of transactions from whitelisted peers even if they violate local relay policy (default: 1)
ru: Принудительная трансляция транзакций от пиров из белого списка, даже если они нарушают локальные правила трансляций (по умолчанию: 1)

source: A fee rate (in DASH/kB) that will be used when fee estimation has insufficient data (default: 0.00001)
ru: Размер комиссии (в DASH/kB), который будет использоваться в случае, если для расчёта размера комиссии недостаточно данных (по умолчанию: 0.00001)

source: Fees (in DASH/kB) smaller than this are considered zero fee for transaction creation (default: 0.00001)
ru: Комиссии (в DASH/kB) размером менее заданного при создании транзакции будут считаться нулевыми комиссиями (по умолчанию: 0.00001)

source: Attempt to recover private keys from a corrupt wallet on startup
ru: При запуске пытаться восстановить приватные ключи из неисправного кошелька

source: If paytxfee is not set, include enough fee so transactions begin confirmation on average within n blocks (default: 6)
ru: Если paytxfee не задан, включить достаточную комиссию, чтобы транзакции начали подтверждаться в среднем через n блоков (по умолчанию: 6)

source: Use hierarchical deterministic key generation (HD) after BIP39/BIP44. Only has effect during wallet creation/first start (default: 0)
ru: Использовать иерархически детерминированную генерацию ключа (HD) после BIP39/BIP44. Работает только при создании или первом запуске кошелька (по умолчанию: 0)

source: User defined mnemonic for HD wallet (BIP39). Only has effect during wallet creation/first start (default: randomly generated)
ru: Заданная пользователем мнемоническая фраза для HD кошелька (BIP39). Работает только при создании или первом запуске кошелька (по умолчанию: создаётся случайным образом)

source: User defined mnemonic passphrase for HD wallet (BIP39). Only has effect during wallet creation/first start (default: empty string)
ru: Заданная пользователем мнемоническая фраза-пароль для HD кошелька (BIP39). Работает только при создании или первом запуске кошелька (по умолчанию: пустая строка)

source: Output debugging information (default: 0, supplying <category> is optional). If <category> is not supplied or if <category> = 1, output all debugging information.<category> can be: addrman, alert, bench, cmpctblock, coindb, db, http, leveldb, libevent, lock, mempool, mempoolrej, net, proxy, prune, rand, reindex, rpc, selectcoins, tor, zmq, dash (or specifically: gobject, instantsend, keepass, masternode, mnpayments, mnsync, privatesend, spork).
ru: Вывести информацию по отладке (по умолчанию: 0, поставка <category>опциональна). Если <category>не поставляется, или если <category>=1, вывести всю информацию по отладке. <category>может быть: addrman, alert, bench, cmpctblock, coindb, db, http, leveldb, libevent, lock, mempool, mempoolrej, net, proxy, prune, rand, reindex, rpc, selectcoins, tor, zmq, dash (or specifically: gobject, instantsend, keepass, masternode, mnpayments, mnsync, privatesend, spork).

source: Fees (in DASH/kB) smaller than this are considered zero fee for relaying, mining and transaction creation (default: 0.00001)
ru: Комиссии (в DASH/kB) менее этого значения считаются нулевыми комиссиями, работает для трансляции, майнинга и создания транзакций (по умолчанию: 0.00001)

source: Maximum total fees (in DASH) to use in a single wallet transaction or raw transaction; setting this too low may abort large transactions (default: 0.10)
ru: Максимальный общий размер комиссий (в DASH), установленный для транзакций из одного кошелька или исходной транзакции; слишком низкие значения могут вызвать отмену крупных транзакций (по умолчанию: 0.10)

source: Use devnet chain with provided name
ru: Использовать цепь devnet с заданным именем

source: Override spork address. Only useful for regtest and devnet. Using this on mainnet or testnet will ban you.
ru: Игнорировать адреса спорка. Используется только для regtest и devnet. Использование этой команды в основной сети или тестовой сети повлечёт за собой бан.

source: Overrides minimum spork signers to change spork value. Only useful for regtest and devnet. Using this on mainnet or testnet will ban you.
ru: Игнорировать минимальное количество подписей спорка, чтобы изменить значение спорка. Используется только для regtest и devnet. Использование этой команды в основной сети или тестовой сети повлечёт за собой бан.

source: Set the masternode BLS private key
ru: Задать приватный BLS ключ мастерноды

source: Use N separate masternodes in parallel to mix funds (1-10, default: 4)
ru: Использовать N различных одновременно работающих мастернод, чтобы смешать средства (1-10, по умолчанию: 4)

source: Use N separate masternodes for each denominated input to mix funds (2-16, default: 4)
ru: Использовать N отдельных мастернод для каждого деноминированного входа, чтобы смешать средства (2-16, по умолчанию: 4)

source: Set maximum block size in bytes (default: 2000000)
ru: Задать максимальный размер блока в байтах (по умолчанию: 2000000)

source: Set lowest fee rate (in DASH/kB) for transactions to be included in block creation. (default: 0.00001)
ru: Задать минимальный размер комиссии (in DASH/kB) для транзакции, которая будет включена в создание блока. (по умолчанию: 0.00001)

source: Username and hashed password for JSON-RPC connections. The field <userpw> comes in the format: <USERNAME>:<SALT>$<HASH>. A canonical python script is included in share/rpcuser. The client then connects normally using the rpcuser=<USERNAME>/rpcpassword=<PASSWORD> pair of arguments. This option can be specified multiple times
ru: Имя пользователя и хешированный пароль для JSON-RPC подключений. Поле <userpw> идёт в формате: <USERNAME>:<SALT>$<HASH>. Традиционный скрипт на питоне включён в share/rpcuser. Затем клиент подключается в обычном режиме, используя пару аргументов the rpcuser=<USERNAME>/rpcpassword=<PASSWORD>. Эту опцию можно настраивать множество раз.

source: Output debugging information (default: 0, supplying <category> is optional). If <category> is not supplied or if <category> = 1, output all debugging information.<category> can be: addrman, alert, bench, cmpctblock, coindb, db, http, leveldb, libevent, lock, mempool, mempoolrej, net, proxy, prune, rand, reindex, rpc, selectcoins, tor, zmq, dash (or specifically: gobject, instantsend, keepass, masternode, mnpayments, mnsync, privatesend, spork), qt.
ru: Вывести информацию по отладке (по умолчанию: 0, поставка <category>опциональна). Если <category>не поставляется, или если <category>=1, вывести всю информацию по отладке. <category>может быть: addrman, alert, bench, cmpctblock, coindb, db, http, leveldb, libevent, lock, mempool, mempoolrej, net, proxy, prune, rand, reindex, rpc, selectcoins, tor, zmq, dash (or specifically: gobject, instantsend, keepass, masternode, mnpayments, mnsync, privatesend, spork), qt.

source: Pass named instead of positional arguments (default: false)
ru: Передать имя вместо позиционных аргументов (по умолчанию: false)

source: Read extra arguments from standard input, one per line until EOF/Ctrl-D (recommended for sensitive information such as passphrases)
ru: Считывает дополнительные аргументы со стандартного входа по одному на строку, до EOF/Ctrl-D (рекомендуется использовать для чувствительных данных, пример, кодовых фраз)

source: Add pay-to-pubkey output to TX. Optionally add the "S" flag to wrap the output in a pay-to-script-hash.
ru: Добавляет к TX выход pay-to-pubkey. При необходимости, добавляет флаг "S", чтобы перенести выход в pay-to-script-hash.

source: Add raw script output to TX. Optionally add the "S" flag to wrap the output in a pay-to-script-hash.
ru: Добавляет к TX выход с изначальным скриптом. При необходимости, добавляет флаг "S", чтобы перенести выход в pay-to-script-hash.

source: Add Pay To n-of-m Multi-sig output to TX. n = REQUIRED, m = PUBKEYS. Optionally add the "S" flag to wrap the output in a pay-to-script-hash.
ru: Добавляет к TX выход Pay To n-of-m Multi-sig. n = REQUIRED, m = PUBKEYS. При необходимости, добавляет флаг "S", чтобы перенести выход в pay-to-script-hash.

source: This documentation lists all available RPC commands as of Dash version 0.13.0.0, and limited documentation on what each command does. For full documentation of arguments, results and examples, type help ( "command" ) to view full details at the console. You can enter commands either from **Tools > Debug** console in the QT wallet, or using *dash-cli* for headless wallets and *dashd*.
ru: В этом документе приводится список всех доступных RPC команд для версии Dash 0.13.0.0, а также краткая справка о том, что делает каждая из этих команд. Чтобы посмотреть полную документацию по аргументам, с результатами и примерами, введите в консоли help ("название команды"). Также вы можете ввести команды в консоль, доступную из меню **Инструменты>Отладка** в QT кошельке, или с помощью *dash-cli* в "безголовых" кошельках и *dashd*.

source: Returns the hash of the best (tip) block in the longest blockchain.
ru: Выводит хеш лучшего (верхнего) блока в самой длинной цепи блоков.

source: If verbosity is 0, returns a string that is serialized, hex-encoded data for block 'hash'. If verbosity is 1, returns an Object with information about block <hash>. If verbosity is 2, returns an Object with information about block <hash> and information about each transaction.
ru: Если verbosity = 0, выводит строку, в которой содержатся сериализованные, закодированные шестнадцатеричным шифрованием данные хеша блока. Если verbosity = 1, выводит Объект с информацией о блоке <hash>. Если verbosity = 2, выводит Объект с информацией о блоке<hash> и информацию о каждой транзакции.

source: Returns an object containing various state info regarding blockchain processing.
ru: Выводит объект, содержащий различную информацию о статусе обработки блокчейна.

source: Returns the number of blocks in the longest blockchain.
ru: Выводит количество блоков в самой длинной цепи блоков.

source: Returns hash of block in best-block-chain at height provided.
ru: Выводит хеш блоков в лучшей цепи блоков по предоставленной высоте.

source: If txid is in the mempool, returns all in-mempool ancestors.
ru: Если txid находится в мемпуле, выводит всех находящихся в мемпуле предшественников.

source: If txid is in the mempool, returns all in-mempool descendants.
ru: Если txid находится в мемпуле, выводит всех находящихся в мемпуле потомков.

source: Returns mempool data for given transaction.
ru: Выводит данные мемпула по заданной транзакции.

source: Treats a block as if it were received before others with the same work. A later preciousblock call can override the effect of an earlier one. The effects of preciousblock are not retained across restarts.
ru: Обрабатывает блок так, как если бы он был получен раньше других. Более поздний вызов команды preciousblock может отменить эффект более раннего вызова. Эффект preciousblock не сохраняется после перезагрузки.

source: Prune blockchain up to specified height or unix timestamp.
ru: Сокращает блокчейн до определённой высоты или временной отметки unix.

source: Verifies that a proof points to a transaction in a block, returning the transaction it commits to and throwing an RPC error if the block is not in our best chain.
ru: Верифицирует, что доказательство указывает на транзакцию в блоке, а также возвращает транзакцию, которую совершает, в nd, и выдаёт ошибку RPC, если блок не находится в лучшей цепи.

source: Change debug category on the fly. Specify single category or use '+' to specify many.
ru: Изменить отладочную категорию на лету. Задайте единственную категорию или используйте '+', чтобы задать несколько.

source: DEPRECATED. Returns an object containing various state info.
ru: УСТАРЕЛО. Выводит объект, содержащий различные данные о состоянии.

source: Returns an object containing information about memory usage
ru: Выводит объект, содержащий данные об использовании памяти.

source: List all commands, or get help for a specified comm
ru: Вывести список всех команд, или получить помощь по определённой команде.

source: Count governance objects and votes (additional param: 'json' or 'all', default: 'json')
ru: Считает объекты управления и голоса (дополнительные параметры: 'json' или 'all', по умолчанию: 'json')

source: Force check all masternodes and remove invalid ones
ru: Принудительная проверка всех мастернод и удаление всех неработающих мастернод

source: Get information about number of masternodes (DEPRECATED options: 'total', 'ps', 'enabled', 'qualify', 'all')
ru: Получить информацию о количестве мастернод (УСТАРЕВШИЕ опции: 'total', 'ps', 'enabled', 'qualify', 'all')

source: Generate new masternodeprivkey, optional param: 'compressed' (boolean, optional, default=false) generate compressed privkey
ru: Создать новый masternodeprivkey, дополнительный параметр: 'compressed' (логический, опциональный, по умолчанию=false) генерирует сжатый privkey

source: Get a list of masternodes in different modes. This call is identical to masternodelist call.
ru: Получить список мастернод в различных режимах. Этот вызов идентичен вызову masternodelist.

source: Shows information about current state of sporks. Available commands:
ru: Показывает информацию о текущем состоянии спорков. Доступные команды:

source: Show all current spork values
ru: Показывает все значения текущего спорка

source: Show which sporks are active
ru: Показывает, какие спорки активны

source: voteraw <masternode-tx-hash> <masternode-tx-index> <governance-hash> <vote-signal> [yes | no | abstain] <time> <vote-sig>
ru: voteraw <masternode-tx-hash> <masternode-tx-index> <governance-hash> <vote-signal> [да | нет | воздержаться] <time> <vote-sig>

source: Compile and relay a governance vote with provided external signature instead of signing vote internally
ru: Скомпилировать и передать управленческий голос с предоставленной внешней подписью, вместо самостоятельного подписывания голоса.

source: Set of commands to execute BLS related actions. Available commands:
ru: Список команд для связанных с BLS действий. Доступные команды:

source: Create a BLS secret/public key pair
ru: Создать BLS пару секретный/приватный ключ

source: Set of commands to execute ProTx related actions. Available commands:
ru: Набор команд для выполнения относящихся к ProTx действий. Доступны следующие команды:

source: Create and send ProTx to network
ru: Создать и отправить ProTx в сеть

source: Fund, create and send ProTx to network
ru: Обеспечить, создать и отправить ProTx в сеть

source: Create an unsigned ProTx
ru: Создать неподписанную ProTx

source: Sign and submit a ProTx
ru: Подписать и передать ProTx

source: List ProTxs
ru: Вывести список ProTx

source: Return information about a ProTx
ru: Выводит информацию о ProTx

source: Create and send ProUpServTx to network
ru: Создать и отправить ProUpServTx в сеть

source: Create and send ProUpRegTx to network
ru: Создать и отправить ProUpRegTx в сеть

source: Create and send ProUpRevTx to network
ru: Создать и отправить ProUpRevTx в сеть

source: Calculate a diff and a proof between two masternode lists
ru: Рассчитать доказательство и разницу между двумя списками мастернод

source: Mine up to nblocks blocks immediately (before the RPC call returns)
ru: Майнить блоки до nblocks немедленно (до возврата запроса RPC)

source: Mine blocks immediately to a specified address (before the RPC call returns)
ru: Майнить блоки до определённого адреса немедленно (до возврата запроса RPC)

source: Accepts the transaction into mined blocks at a higher (or lower) priority
ru: Принимает транзакции в добытые блоки с высоким (или низким) приоритетом.

source: Returns information about the given added node, or all added nodes (note that onetry addnodes are not listed here)
ru: Выводит информацию о заданной добавленной ноде, или всем добавленным нодами (обратите внимание, что в этом списке нет onetry addnodes).

source: Add inputs to a transaction until it has enough in value to meet its out value. This will not modify existing inputs, and will add at most one change output to the outputs.
ru: Добавлять входы транзакции до тех пор, пока этих значений не будет достаточно, чтобы соответствовать значениям выхода. Это действие никак не повлияет на существующие входы, а также добавит один выход для сдачи к другим выходам.

source: Return the raw transaction data. If verbose is 'true', returns an Object with information about 'txid'. If verbose is 'false' or omitted, returns a string that is serialized, hex-encoded data for 'txid'.
ru: Вывести данные о сырой транзакции. Если verbose равен 'true', выводит Объект с информацией о 'txid'. Если verbose равен 'false', выводит строку в виде сериализованных, зашифрованных шестнадцатеричным кодированием данных, относящихся к 'txid'.

source: DEPRECATED. Estimates the approximate priority a zero-fee transaction needs to begin confirmation within nblocks blocks.
ru: УСТАРЕЛО. Оценивает приблизительный приоритет транзакций с нулевой комиссией, чтобы начать подтверждение блоков среди nblocks.

source: DEPRECATED. WARNING: This interface is unstable and may disappear or change! Estimates the approximate priority a zero-fee transaction needs to begin confirmation within nblocks blocks if possible and return the number of blocks for which the estimate is valid.
ru: УСТАРЕЛО. ПРЕДУПРЕЖДЕНИЕ: этот интерфейс нестабилен и может измениться или исчезнуть! Оценивает примерный приоритет транзакций с нулевой комиссией, чтобы начать подтверждение блоков среди nblocks, если это возможно, и вывести количество блоков, для которых эти расчёты верны.

source: Sign a message with the private key of an address
ru: Подписать сообщение приватным ключом адреса.

source: Verify a signed message
ru: Верифицировать подписанное сообщение

source: Safely copies current wallet file to destination, which can be a directory or a path with filename.
ru: Безопасно копирует файл кошелька в место назначения, которое может быть папкой или путём с именем файла.

source: Reveals the private key corresponding to 'address'. Then the importprivkey can be used with this output
ru: Открывает приватный ключ, соответствующий 'address'. Далее importprivkey можно использовать с этим выходом.

source: Returns a new Dash address for receiving payments. If 'account' is specified (DEPRECATED), it is added to the address book so payments received with the address will be credited to 'account'.
ru: Выводит новый адрес Dash для получения платежей. Если задан 'account' (УСТАРЕЛО), он добавляется в адресную книгу, и получаемые на этот адрес платежи будут иметь отношение к этому 'account'.

source: Returns the total amount received by the given address in transactions with at least minconf confirmations.
ru: Выводит общую сумму, полученную на данный адрес через транзакции с минимальным количеством подтверждений.

source: Returns an array of special transactions found in the specified block
ru: Возвращает массив специальных транзакций, найденных в указанном блоке

source: Returns the server's total unconfirmed balance
ru: Выводит общий неподтверждённый баланс сервера.

source: Import addresses/scripts (with private or public keys, redeem script (P2SH)), rescanning all addresses in one-shot-only (rescan can be disabled via options).
ru: Импортировать адреса/скрипты (с приватными или публичными ключами, исправить скрипт (P2SH)), с повторным сканированием всех адресов (повторное сканирование может быть отключено с помощью опций)

source: Imports funds without rescan. Corresponding address or script must previously be included in wallet. Aimed towards pruned wallets. The end-user is responsible to import additional transactions that subsequently spend the imported outputs or rescan after the point in the blockchain the transaction is included.
ru: Импортирует средства без повторного сканирования. Соответствующий адрес или скрипт должны быть включены в кошелёк заранее. Предназначено для использования в сокращённых кошельках. Конечный пользователь сам несёт ответственность за импорт дополнительных транзакций, что может привести к тратам импортированных выходов или повторному сканированию после того, как транзакция будет включена в блокчейн.

source: Fills the keypool. Requires wallet passphrase to be set with walletpassphrase call.
ru: Заполняет пул ключей. Требует, чтобы кодовая фраза кошелька была задана через walletpassphrase.

source: Lists addresses of this wallet and their balances
ru: Выводит список адресов этого кошелька и их балансов

source: Lists groups of addresses which have had their common ownership made public by common use as inputs or as the resulting change in past transactions
ru: Выводит список групп адресов, общее владение которыми стало публичным из-за общего использования их входов или для сдачи в прошлых транзакциях.

source: DEPRECATED. List incoming payments grouped by account.
ru: УСТАРЕЛО. Вывести список входящих платежей, сгруппированных по аккаунту.

source: List incoming payments grouped by receiving address.
ru: Вывести список входящих платежей, сгруппированных по получающему адресу.

source: Deletes the specified transaction from the wallet. Meant for use with pruned wallets and as a companion to importprunedfunds. This will effect wallet balances.
ru: Удаляет заданную транзакцию из кошелька. Предназначена для использования с сокращёнными кошельками вместе с importprunedfunds. Использование этой команды повлияет на балансы кошелька.

source: DEPRECATED (use sendtoaddress). Sent an amount from an account to a dash address. Requires wallet passphrase to be set with walletpassphrase call.
ru: УСТАРЕЛО (используйте sendtoaddress). Отправляет сумму с аккаунта на адреса dash. Требует, чтобы кодовая фраза кошелька была установлена с помощью вызова walletpassphrase.

source: Send multiple times. Amounts are double-precision floating point numbers. Requires wallet passphrase to be set with walletpassphrase call.
ru: Отправить несколько раз. Суммы - это числа с двумя знаками после запятой. Требует, чтобы кодовая фраза кошелька была установлена с помощью вызова walletpassphrase.

source: Set the goal amount in DASH for PrivateSend mixing.
ru: Задать целевую сумму в DASH для перемешивания через PrivateSend.

source: Set the number of rounds for PrivateSend mixing.
ru: Задать количество раундов смешивания для PrivateSend.

source: Sign a message with the private key of an address Requires wallet passphrase to be set with walletpassphrase call.
ru: Подписать сообщение приватным ключом адреса. Требует, чтобы кодовая фраза кошелька была задана через walletpassphrase.
