Repository: 12Gitcat/docs
Catalog: locale/*/LC_MESSAGES/wallets/dashcore/cmd-rpc.po
Languages: ar, fr, ru, zh_cn

source: Maximum total fees (in DASH) to use in a single wallet transaction; setting this too low may abort large transactions (default: 0.20)
fr: Maximum de frais de transaction totaux (en dashs) à utiliser en une seule transaction de portefeuille ; définir une valeur trop basse peut empêcher les transactions larges (défaut : 0,20)
zh_cn: 单笔钱包交易所需的费用的最高值,这一数值以达世币（DASH）为单位。如果用户对这个数值的设置过低,那么用户的大额交易就可能会被中止（默认值：0.20）

source: Use hierarchical deterministic key generation (HD) after bip39/bip44. Only has effect during wallet creation/first start (default: 0)
fr: Utiliser la génération hiérarchique déterministe (HD) de clés (BIP39/BIP44). N'a d'effet qu'à la création du portefeuille ou à son premier démarrage (défaut : 0)
zh_cn: 在bip39/bip44之后使用分层确定性私钥生成（HD）功能。这项功能只在钱包创建或首次启动时有效（默认值：0）

source: User defined mnemonic for HD wallet (bip39). Only has effect during wallet creation/first start (default: randomly generated)
fr: Graine mnémonique définie par l'utilisateur pour un portefeuille HD (BIP39). N'a d'effet qu'à la création du portefeuille ou à son premier démarrage (défaut : générée aléatoirement)
zh_cn: 用户定义的HD钱包（bip39）。这项功能只在钱包创建/首次启动时有效（默认值：随机生成）

source: User defined mnemonic passphrase for HD wallet (bip39). Only has effect during wallet creation/first start (default: empty string)
fr: Phrase de passe mnémonique définie par l'utilisateur pour un portefeuille HD (BIP39). N'a d'effet qu'à la création du portefeuille ou à son premier démarrage (défaut : chaîne vide)
zh_cn: 用户定义的HD钱包的密码（bip39）。这项功能只在钱包创建/首次启动时有效（默认值：空字符串）

source: Output debugging information (default: 0, supplying <category> is optional). If <category> is not supplied or if <category> = 1, output all debugging information.<category> can be: addrman, alert, bench, coindb, db, http, libevent, lock, mempool, mempoolrej, net, proxy, prune, rand, reindex, rpc, selectcoins, tor, zmq, dash (or specifically: gobject, instantsend, keepass, masternode, mnpayments, mnsync, privatesend, spork).
fr: Afficher les informations de débogage (défaut : 0, indiquer <category> est facultatif). Si <category> n'est pas indiqué ou si <category> = 1, afficher toutes les informations de débogage.<category> peut être : addrman, alert, bench, coindb, db, http, libevent, lock, mempool, mempoolrej, net, proxy, prune, rand, reindex, rpc, selectcoins, tor, zmq, dash (ou plus spécifiquement : gobject, instantsend, keepass, masternode, mnpayments, mnsync, privatesend, spork).
zh_cn: 输出调试信息（默认值：0，用户也可以选择<category>）。如果<category>不可选或<category> = 1，则输出所有调试信息。<category>可以是以下选项：addrman、alert、bench、coindb、db、http、libevent、lock、mempool、mempoolrej、net、proxy、prune、rand、reindex、 rpc、selectcoins、tor、zmq或者dash（具体来说，它可以是gobject、instantsend、keepass、masternode、mnpayments、mnsync、privatesend和spork）。

source: Generate coins (default: 0)
fr: Générer des pièces (défaut : 0)
zh_cn: 生成币（默认值：0）

source: Set the number of threads for coin generation if enabled (-1 = all cores, default: 1)
fr: Définir le nombre de files pour la génération de pièces si activée (-1 = tous les cœurs, défaut : 1)
zh_cn: 如果启用这一功能，用户就会设置达世币生成的线程数（-1 表示所有核心，默认值：1）

source: Fees (in DASH/kB) smaller than this are considered zero fee for relaying, mining and transaction creation (default: 0.0001)
fr: Seuil de frais de transaction (en dashs/Ko) en-deçà duquel les frais sont considérés nuls pour la création de transaction, la retransmission ou le minage (défaut : 0,0001)
zh_cn: 比上述费率(DASH/kB)更低的收费被定义为零费率的中继、挖矿和交易创建（默认值：0.0001）

source: Use N separate masternodes for each denominated input to mix funds (2-16, default: 2)
fr: Utiliser N masternodes distincts pour chaque entrée de coupure pour le mélange des fonds (2-16, défaut : 2)
zh_cn: 借助N个主节点为既定的交易完成混币（N的范围：2-16，默认值：2）

source: Keep N DASH anonymized (default: 1000)
fr: Conserver N dashs anonymisés (défaut : 1000)
zh_cn: 保持N个DASH匿名（默认值：1000）

source: Show N confirmations for a successfully locked transaction (0-9999, default: 5)
fr: Afficher N confirmations pour une transaction verrouillée avec succès (0-9999, défaut : 5)
zh_cn: 显示成功锁定交易的N个确认信息（范围：0-9999，默认值：5）

source: Enable transaction replacement in the memory pool (default: 0)
fr: Activer le remplacement de transaction dans le tampon mémoire (défaut : 0)
zh_cn: 在内存池中启用交易替换功能（默认值：0）

source: Set minimum block size in bytes (default: 0)
fr: Définir la taille minimale de bloc en octets (défaut : 0)
zh_cn: 以字节为单位设置区块大小的最小值（默认值：0）

source: Set maximum block size in bytes (default: 750000)
fr: Définir la taille maximale de bloc en octets (défaut : 750000)
zh_cn: 以字节为单位设置区块大小的最大值（默认值：750000）

source: Username and hashed password for JSON-RPC connections. The field <userpw> comes in the format: <USERNAME>:<SALT>$<HASH>. A canonical python script is included in share/rpcuser. This option can be specified multiple times
fr: Nom d'utilisateur et mot de passe haché pour les connexions JSON-RPC. Le champ <userpw> a pour format : <USERNAME>:<SALT>$<HASH>. Un script canonique Python est inclus dans share/rpcuser. Cette option peut être indiquée plusieurs fois
zh_cn: JSON-RPC连接的用户名和哈希密码。字段<userpw>的格式为<USERNAME>:<SALT>$<HASH>。share/rpcuser中包含规范的python脚本。用户可以多次设定这个选项。

source: Output debugging information (default: 0, supplying <category> is optional). If <category> is not supplied or if <category> = 1, output all debugging information.<category> can be: addrman, alert, bench, coindb, db, http, libevent, lock, mempool, mempoolrej, net, proxy, prune, rand, reindex, rpc, selectcoins, tor, zmq, dash (or specifically: gobject, instantsend, keepass, masternode, mnpayments, mnsync, privatesend, spork), qt.
fr: Sortie des informations de débogage (défaut : 0, indiquer <category> est facultatif). Si <category> n'est pas indiqué ou si <category> = 1, afficher toutes les informations de débogage.<category> peut être : addrman, alert, bench, coindb, db, http, libevent, lock, mempool, mempoolrej, net, proxy, prune, rand, reindex, rpc, selectcoins, tor, zmq, dash (ou plus spécifiquement : gobject, instantsend, keepass, masternode, mnpayments, mnsync, privatesend, spork), qt.
zh_cn: 输出调试信息（默认值：0，用户也可以选择<category>）。如果<category>不可选或<category> = 1，则输出所有调试信息。<category>可以是以下选项：addrman、alert、bench、coindb、db、http、libevent、lock、mempool、mempoolrej、net、proxy、prune、rand、reindex、 rpc、selectcoins、tor、zmq、qt或者dash（具体来说，它可以是gobject、instantsend、keepass、masternode、mnpayments、mnsync、privatesend和spork）

source: outdata=[VALUE:]DATA
fr: outdata=[VALEUR:]DONNÉES

source: outscript=VALUE:SCRIPT
fr: outscript=VALEUR:SCRIPT

source: Add raw script output to TX
fr: Ajouter à la transaction une sortie de script brut
zh_cn: 向交易增加原始脚本

source: load=NAME:FILENAME
fr: load=NOM:NOMDEFICHIER

source: set=NAME:JSON-STRING
fr: set=NOM:CHAÎNE-JSON

source: This documentation lists all available RPC commands as of Dash version 0.12.2.1, and limited documentation on what each command does. For full documentation of arguments, results and examples, type help ( "command" ) to view full details at the console. You can enter commands either from **Tools > Debug** console in the QT wallet, or using *dash-cli* for headless wallets and *dashd*.
fr: Cette documentation répertorie toutes les commandes RPC disponibles dans Dash version 0.12.2.1, et fournit une explication brève de ce que fait chaque commande. Pour une documentation complète des arguments, résultats et exemples, tapez help("commande") pour voir tous les détails dans la console. Vous pouvez saisir les commandes soit depuis **Outils > Console de débogage** dans le portefeuille QT, soit en utilisant *dash-cli* pour les portefeuilles sans interface graphique et pour *dashd*.
zh_cn: 本文档列出了达世币0.12.2.1版本中所有的可用的远程过程调用命令及各项命令的功能。如需阅读有关参数、结果和示例的完整文档，用户需要输入help（ "command" ），从而在控制台中查看完整的介绍信息。用户也可以从钱包中的 **工具 > 调试** 控制台中输入命令，或使用 *“dash-cli * ”和 * dashd*来完成这项操作。

source: Returns the hash of the best (tip) block in the longest block chain.
fr: Renvoie la signature de hachage du meilleur bloc (de tête) de la blockchain la plus longue.
zh_cn: 返回最长区块链中的最佳（tip）区块的哈希值。

source: getblock "hash" ( verbose )
fr: getblock "hash" ( bavard )

source: If verbose is false, returns a string that is serialized, hex-encoded data for block 'hash'. If verbose is true, returns an Object with information about block <hash>.
fr: Si "bavard" est "false", renvoie une chaîne de données sérialisées et codées en hexadécimal pour le bloc "hash". Si "bavard" est "true", renvoie un objet avec des informations sur le bloc <hash>.
zh_cn: 如果verbose错误，则为区块哈希返回序列化'的十六进制字符串数据。如果verbose正确，则返回包含区块<hash>的相关信息的对象。

source: Returns an object containing various state info regarding block chain processing.
fr: Renvoie un objet contenant diverses informations d'état sur le traitement de la blockchain.
zh_cn: 返回包含有关区块链处理的各类状态信息的对象。

source: Returns the number of blocks in the longest block chain.
fr: Renvoie le nombre de blocs de la blockchain la plus longue.
zh_cn: 返回最长区块链中的区块的数量。

source: Returns hash of block in best-block-chain at index provided.
fr: Renvoie la signature de hachage du block de la meilleure blockchain, à l'index fourni.
zh_cn: 返回提供索引时最佳区块链的区块哈希值。

source: Verifies that a proof points to a transaction in a block, returning the transaction it commits to nd throwing an RPC error if the block is not in our best chain.
fr: Vérifie qu'une preuve pointe vers une transaction dans un bloc, en renvoyant la transaction associée et une erreur RPC si le bloc n'est pas dans la meilleure chaîne.
zh_cn: 验证证明是否指向区块中的交易。如果该区块不是最佳区块，则返回它所指向的交易并提示远程过程调用错误。

source: Change debug category on the fly. Specify single category or use comma to specify many.
fr: Modifie la catégorie de débogage en temps réel. Indiquez une catégorie unique ou utilisez des virgules pour en séparer plusieurs.
zh_cn: 更改动态调试类别。指定单个类别或使用逗号指定多个类别。

source: Deprecated. Returns an object containing various state info.
fr: Obsolète. Renvoie un objet contenant diverses informations d'état.
zh_cn: 超时。返回包含各种状态信息的对象。

source: help ( "command" )
fr: help ( "commande" )

source: List all commands, or get help for a specified command.
fr: Afficher la liste de toutes les commandes, ou obtenir de l'aide sur une commande spécifiée.
zh_cn: 列出所有命令，或借助于指定的命令。

source: Count governance objects and votes
fr: Compter les objets de gouvernance et les votes
zh_cn: 统计管理对象的数量并投票

source: Print number of all known masternodes (optional: 'ps', 'enabled', 'all', 'qualify')
fr: Afficher le nombre de tous les masternodes connus (facultatif : 'ps', 'enabled', 'all', 'qualify')
zh_cn: 打印所有已知主节点的数量（可选：'ps', 'enabled', 'all', 'qualify'）

source: Generate new masternodeprivkey
fr: Générer une nouvelle clé privée de masternode
zh_cn: 生成新的主节点私钥

source: masternodelist ( "mode" "filter" )
fr: masternodelist ( "mode" "filtre" )

source: Get a list of masternodes in different modes
fr: Obtenir une liste des masternodes en différents modes
zh_cn: 获取不同模式下的主节点的列表

source: <name> is the corresponding spork name, or 'show' to show all current spork settings, active to show which sporks are active<value> is a epoch datetime to enable or disable spork. Requires wallet passphrase to be set with walletpassphrase call.
fr: <name> est le nom du spork correspondant, ou "show" pour afficher tous les réglages de spork actuels, "active" pour afficher les sporks actifs<value> est un horodatage "datetime" pour activer ou désactiver le spork. Nécessite que la phrase de passe du portefeuille soit définie avec l'appel walletpassphrase.
zh_cn: 表示对应的叉勺名称或所'显示'的当前的叉勺设置。如果显示为<name>，则表示叉勺处于活跃状态。<value>表示启用或禁用叉勺的日期和时间。用户需要使用钱包密码和walletpassphrase call来完成设置。

source: Compile and relay a governance vote with provided external signature instead of signing vote internally.
fr: Compiler et retransmettre un vote de gouvernance avec la signature externe fournie plutôt que de signer le vote en interne.
zh_cn: 使用提供的外部签名来编译和转发管理投票，而不是在内部签署投票。

source: Mine blocks immediately (before the RPC call returns).
fr: Minage immédiat de blocs (avant le renvoi de l'appel RPC).
zh_cn: （在远程过程调用返回之前）立即挖取区块。

source: Return if the server is set to generate coins or not. The default is false. It is set with the command line argument -gen (or dash.conf setting gen). It can also be set with the setgenerate call.
fr: Renvoie si le serveur est configuré ou non pour générer des pièces. Le défaut est "false". Cela est configuré par l'argument de ligne de commande -gen (ou le réglage gen dans le fichier dash.conf). Cela peut aussi être défini avec l'appel setgenerate.
zh_cn: 无论服务器设置是否是生成货币，都返回。默认设置是错误。它使用命令行参数-gen（或dash.conf setting gen）进行设置。用户也可以使用setgenerate调用来完成设置。

source: Set 'generate' true or false to turn generation on or off. Generation is limited to 'genproclimit' processors, -1 is unlimited. See the getgenerate call for the current setting.
fr: Définir "generate" sur "true" ou "false" pour activer ou désactiver la génération. La génération est limitée à "genproclimit" processeurs, -1 est illimité. Voir l'appel getgenerate pour le réglage actuel.
zh_cn: 将生成功能设置为打开或关闭。这项功能仅限于genproclimit处理器，-1表示没有设限。请参阅getgenerate调用来获取当前设置。

source: Accepts the transaction into mined blocks at a higher (or lower) priority.
fr: Accepte la transaction dans les blocs minés avec une priorité supérieure (ou inférieure).
zh_cn: 将在已挖区块中的交易设置为更高（或更低）的优先级。

source: disconnectnode "node"
fr: disconnectnode "nœud"

source: getaddednodeinfo dummy ( "node" )
fr: getaddednodeinfo dummy ( "nœud" )

source: Returns information about the given added node, or all added nodes (note that onetry addnodes are not listed here).
fr: Renvoie des informations sur le nœud ajouté donné, ou sur tous les nœuds ajoutés (veuillez noter que les nœuds ajoutés onetry ne sont pas répertoriés ici).
zh_cn: 返回有关既定的添加节点或所有的添加节点的信息（请注意，此处并未列出onetry addnodes）。

source: Add inputs to a transaction until it has enough in value to meet its out value. This will not modify existing inputs, and will add one change output to the outputs.
fr: Ajoute des entrées à une transaction jusqu'à ce que sa valeur soit suffisante pour correspondre à sa valeur de sortie. Cela ne modifiera pas les entrées existantes, et ajoutera aux sorties une sortie de monnaie rendue.
zh_cn: 为交易添加输入，直到它具备足够的数值来满足输出的需求。这项操作不会修改现有的输入，但会向输出添加一个更改输出。

source: Return the raw transaction data. If verbose=0, returns a string that is serialized, hex-encoded data for 'txid'. If verbose is non-zero, returns an Object with information about 'txid'.
fr: Renvoie les données de transaction brute. Si "bavard" est 0, renvoie une chaîne sérialisée, codée en hexadécimal pour "txid". Si "bavard" n'est pas 0, renvoie un objet avec des informations sur "txid".
zh_cn: 返回原始交易数据。如果verbose 设置为0，则为交易ID返回序列化的十六进制字符串数据。如果verbose设置不为零，则返回一个包含交易ID信息的对象。

source: Util
fr: Outils
ru: Утилита

source: Estimates the approximate priority a zero-fee transaction needs to begin confirmation within nblocks blocks.
fr: Estime la priorité approximative pour qu'une transaction sans frais commence à être confirmée dans les n blocs.
zh_cn: 估算零费用交易所需的优先级，以便在nblocks区块中开始确认。

source: WARNING: This interface is unstable and may disappear or change! Estimates the approximate priority a zero-fee transaction needs to begin confirmation within nblocks blocks if possible and return the number of blocks for which the estimate is valid.
fr: AVERTISSEMENT : cette interface est instable et peut disparaître ou être modifiée ! Estime la priorité approximative pour qu'une transaction sans frais commence à être confirmée dans les n blocs, si possible, et renvoie le nombre de blocs pour lequel l'estimation est valable.
zh_cn: 警告：本页面不稳定，可能出现页面消失或改变的情况。如有可能，请计算零交易手续费交易的优先级，以便在nblocks区块中开始确认。此外，请返回计算有效的区块数量。

source: Verify a signed message.
fr: Vérifie un message signé.
zh_cn: 验证已签名的信息。

source: Safely copies wallet.dat to destination, which can be a directory or a path with filename.
fr: Sauvegarde de manière sécurisée le fichier wallet.dat vers la destination, qui peut être un répertoire ou un chemin vers un nom de fichier.
zh_cn: 将wallet.dat安全地复制到目标地址，这个目标地址可以是目录或具备文件名的路径。

source: dumpprivkey "dashaddress"
fr: dumpprivkey "adresseDash"

source: Reveals the private key corresponding to 'dashaddress'. Then the importprivkey can be used with this output
fr: Révèle la clé privée correspondant à "adresseDash". Ensuite, importprivkey peut être utilisé avec cette valeur
zh_cn: 显示与'达世币地址'对应的私钥。importprivkey可用于这项输出。

source: encryptwallet "passphrase"
fr: encryptwallet "phrasedepasse"

source: Encrypts the wallet with 'passphrase'. This is for first time encryption. After this, any calls that interact with private keys such as sending or signing will require the passphrase to be set prior the making these calls. Use the walletpassphrase call for this, and then walletlock call. If the wallet is already encrypted, use the walletpassphrasechange call. Note that this will shutdown the server.
fr: Chiffre le portefeuille avec "phrasedepasse". Il s'agit du tout premier chiffrage. Après cela, tous les appels pour interagir avec les clés privées, tels que l'envoi ou la signature, demanderont la phrase de passe avant que l'appel ne soit exécuté. Utilisez pour cela l'appel walletpassphrase, puis walletlock. Si le portefeuille est déjà chiffré, utilisez l'appel walletpassphrasechange. Veuillez noter que cela forcera la fermeture du serveur.
zh_cn: 使用密码加密钱包。这是钱包的首次加密。之后，任何与私钥进行交互的调用，例如发送和签名等，都要求事先输入密码。借助walletpassphrase调用和walletlock调用进行这项操作。如果钱包已经被加密了，请使用walletpassphrasechange调用。注意：这个操作会关停服务器。

source: getaccount "dashaddress"
fr: getaccount "adresseDash"

source: getbalance ( "account" minconf addlockconf includeWatchonly )
fr: getbalance ( "compte" minconf addlockconf includeWatchonly )

source: Returns a new Dash address for receiving payments. If 'account' is specified (DEPRECATED), it is added to the address book so payments received with the address will be credited to 'account'.
fr: Renvoie une nouvelle adresse Dash pour recevoir des paiements. Si "compte" est indiqué (OBSOLÈTE), il est ajouté au carnet d'adresses pour que les paiements reçus à cette adresse soient crédités dans "compte".
zh_cn: 返回用于接收付款的新达世币地址。如果指定了帐户（DEPRECATED），则账户会被添加到地址簿中，以便将该地址收到的付款记入帐户总额。

source: getreceivedbyaccount "account" ( minconf addlockconf )
fr: getreceivedbyaccount "compte" ( minconf addlockconf )

source: getreceivedbyaddress "dashaddress" ( minconf addlockconf )
fr: getreceivedbyaddress "adresseDash" ( minconf addlockconf )

source: Returns the total amount received by the given dashaddress in transactions with specified minimum number of confirmations.
fr: Renvoie le montant total reçu par l'adresse Dash donnée dans des transactions ayant le nombre minimal indiqué de confirmations.
zh_cn: 返回在既定达世币地址上收到的总金额，这些交易已经完成了最低限度的确认。

source: Returns the server's total unconfirmed balance.
fr: Renvoie le solde total non confirmé du serveur.
zh_cn: 返回服务器上的未确认的总余额。

source: importprivkey "dashprivkey" ( "label" rescan )
fr: importprivkey "cléprivéeDash" ( "étiquette" rescan )

source: instantsendtoaddress "dashaddress" amount ( "comment" "comment-to" subtractfeefromamount )
fr: instantsendtoaddress "adresseDash" amount ( "commentaire" "commentaire-à" subtractfeefromamount )

source: Fills the keypool.
fr: Réalimente le jeu de clés.
zh_cn: 填充私钥池。

source: Lists groups of addresses which have had their common ownership made public by common use as inputs or as the resulting change in past transactions.
fr: Affiche des groupes d'adresses ayant révélé leur propriétaire commun par l'utilisation commune d'entrées, ou par la monnaie rendue dans des transactions antérieures.
zh_cn: 列出因共同使用输入或因此前交易的变更而公开了所有权的一系列地址。

source: DEPRECATED. List balances by account.
fr: OBSOLÈTE. Répertorie les soldes par compte.
zh_cn: 超时。列出各个账户的余额。

source: List balances by receiving address.
fr: Répertorie les soldes par adresse de réception.
zh_cn: 通过接收地址列出余额。

source: listtransactions ( "account" count from includeWatchonly)
fr: listtransactions ( "compte" count from includeWatchonly)

source: listunspent ( minconf maxconf ["address",...] )
fr: listunspent ( minconf maxconf ["adresse",...] )

source: DEPRECATED (use sendtoaddress). Sent an amount from an account to a dash address.
fr: OBSOLÈTE (utilisez sendtoaddress à la place). Envoie un montant d'un compte vers une adresse Dash.
zh_cn: 超时。（通过sendtoaddress）将账户中的一定金额发送到一个达世币地址。

source: Send multiple times. Amounts are double-precision floating point numbers.
fr: Envoi multiple. Les montants sont des nombres à virgule flottante à précision double.
zh_cn: 多次发送。数量是双倍精度浮点数。

source: sendtoaddress "dashaddress" amount ( "comment" "comment-to" subtractfeefromamount use_is use_ps )
fr: sendtoaddress "adresseDash" amount ( "comment" "comment-to" subtractfeefromamount use_is use_ps )

source: setaccount "dashaddress" "account"
fr: setaccount "adresseDash" "compte"

source: signmessage "dashaddress" "message"
fr: signmessage "adresseDash" "message"

source: Sign a message with the private key of an address.
fr: Signe un message avec la clé privée d'une adresse.
zh_cn: 使用地址私钥对消息进行签名。

source: These commands are accurate as of Dash Core version 0.13.0.0.
ru: Эти команды действительны для Dash Core версии 0.13.0.0.

source: Print this help message and exit
ru: Распечатать это сообщение и выйти

source: Extra transactions to keep in memory for compact block reconstructions (default: 100)
ru: Количество дополнительных транзакций, которые сохраняются в памяти для компактной реконструкции блока (по умолчанию: 100)

source: Reduce storage requirements by enabling pruning (deleting) of old blocks. This allows the pruneblockchain RPC to be called to delete specific blocks, and enables automatic pruning of old blocks if a target size in MiB is provided. This mode is incompatible with -txindex and -rescan. Warning: Reverting this setting requires re-downloading the entire blockchain. (default: 0 = disable pruning blocks, 1 = allow manual pruning via RPC, >945 = automatically prune block files to stay under the specified target size in MiB)
ru: Снизить требования к хранению путём сокращения (удаления) старых блоков. Таким образом можно вызывать функцию pruneblockchain RPC, чтобы удалить определённые блоки, а также можно автоматически сократить старые блоки, если задан размер цели в MiB. Этот режим несовместим с -txindex и -rescan. Предупреждение: при отмене этих установок потребуется скачать заново весь блокчейн. (по умолчанию: 0 = отключить сокращение блоков, 1 = разрешить сокращение в ручном режиме с помощью RPC, >945 = автоматически сократить файлы блока, чтобы остаться в рамках заданного в MiB размера)

source: Allow RFC1918 addresses to be relayed and connected to (default: 0)
ru: Разрешить подключение и трансляцию через RFC1918 адреса (по умолчанию: 0)

source: Connect only to the specified node(s); -noconnect or -connect=0 alone to disable automatic connections
ru: Подключаться только к заданной ноде (нодам); -noconnect или -connect=0 используются, чтобы запретить автоматические подключения

source: Query for peer addresses via DNS lookup, if low on addresses (default: 1 unless -connect/-noconnect)
ru: Запросить адреса пиров через поиск по DNS, если адресов недостаточно (по умолчанию: 1, если не используется -connect/-noconnect)

source: Maximum allowed median peer time offset adjustment. Local perspective of time may be influenced by peers forward or backward by this amount. (default: 4200 seconds)
ru: Максимально допустимое медианное значение времени пира, которое подвергается корректировкам. На локальном уровне на это время могут влиять пиры, сдвигая его в большую или меньшую сторону на это значение. (по умолчанию: 4200 секунды)

source: Whitelist peers connecting from the given IP address (e.g. 1.2.3.4) or CIDR notated network (e.g. 1.2.3.0/24). Can be specified multiple times.
ru: Белый список пиров, которые подключаются через заданный IP адрес (например, 1.2.3.4) или обозначенную CIDR сеть (например, 1.2.3.0/24). Может быть задан множество раз.
