Repository: 12Gitcat/docs
Catalog: locale/*/LC_MESSAGES/wallets/dashcore/cmd-rpc.po
Languages: ar, fr, ru, zh_cn

source: Get governance object by hash
ar: الحصول على كائن الحكم عن طريق التجزئة
fr: Récupérer un objet de gouvernance par sa signature de hachage
ru: Получить объект управления из хэша
zh_cn: 通过哈希值获取管理对象

source: getvotes
ar: الحصول على الأصوات

source: Get all votes for a governance object hash (including old votes)
ar: الحصول على جميع الأصوات لتجزئة كائن الحوكمة (بما في ذلك الأصوات القديمة)
fr: Récupérer tous les votes correspondant au hachage d'un objet de gouvernance (dont les vieux votes)
ru: Получить все голоса за хэш объекта управления (включая старые голоса)
zh_cn: 获取为管理对象哈希值所进行的投票（包括之前的投票）

source: getcurrentvotes
ar: الحصول على الأصوات الحالية

source: Get only current (tallying) votes for a governance object hash (does not include old votes)
ar: الحصول على الأصوات الحالية فقط (لمقارنة) لتمييز كائن الحوكمة (لا يتضمن الأصوات القديمة)
fr: Récupérer selon les votes actuels (décomptés) correspondant au hachage d'un objet de gouvernance (n'inclut pas les vieux votes)
ru: Получить только текущие (подсчитываемые) голоса за хэш объекта управления (старые голоса не учитываются)
zh_cn: 获取管理对象哈希值的（当前）投票（不包括之前的投票）。

source: list
ar: القائمة

source: List governance objects (can be filtered by signal and/or object type)
ar: قائمة كائنات الحوكمة (يمكن تصفيتها بواسطة الإشارة و / أو نوع الكائن)
fr: Afficher la liste des objets de gouvernance (peut être filtrée par signal et/ou type d'objet)
ru: Вывести список объектов управления (можно фильтровать по сигналу и/или типу объекта)
zh_cn: 列出管理对象（可以通过信号和/或对象类型进行过滤）

source: diff
ar: فرق

source: List differences since last diff
ar: قائمة الاختلافات منذ فرق الماضي
fr: Afficher la liste des différences depuis la dernière modification
ru: Вывести список различий с последнего поиска различий
zh_cn: 列出自上次diff后出现的差异

source: vote-alias
ar: صوت مستعار

source: Vote on a governance object by masternode alias (using masternode.conf setup)
ar: التصويت على كائن إدارة من قبل الاسم المستعار ماسترنود (باستخدام masternode.conf الإعداد)
fr: Voter sur un objet de gouvernance par un alias de masternode (en utilisant la configuration du fichier masternode.conf)
ru: Голосовать за объект управления с помощью псевдонима мастерноды (используя настройки masternode.conf)
zh_cn: 通过主节点别名对管理对象进行投票（通过masternode.conf完成设置）

source: vote-conf
ar: الأصوات أسيوط

source: Vote on a governance object by masternode configured in dash.conf
ar: التصويت على كائن إدارة بواسطة ماسترنود تكوينها في dash.conf
fr: Voter sur un objet de gouvernance pas masternode configuré dans le fichier dash.conf
ru: Голосовать за объект управления мастернодой, которая указана в dash.conf
zh_cn: 通过dash.conf中配置的主节点对管理对象进行投票

source: vote-many
ar: صوت-بكترة

source: Vote on a governance object by all masternodes (using masternode.conf setup)
ar: التصويت على كائن إدارة من قبل جميع ماسترنود (باستخدام masternode.conf الإعداد)
fr: Voter sur un objet de gouvernance avec tous les masternodes (en utilisant la configuration du fichier masternode.conf)
ru: Голосовать за объект управления всеми мастернодами (используя настройки masternode.conf)
zh_cn: 通过所有主节点对管理对象进行投票（通过masternode.conf完成设置）

source: masternode "command"...
ar: ماسترنود "الأوامر"...
fr: masternode "commande"...

source: Set of commands to execute masternode related actions. Available commands:
ar: مجموعة من الأوامر لتنفيذ الإجراءات المتعلقة ماسترنود. الأوامر المتاحة:
fr: Jeu de commandes pour exécuter des actions relatives aux masternodes. Commandes disponibles :
ru: Список команд для связанных с мастернодами действий. Доступные команды:
zh_cn: 用于执行与主节点相关的操作的命令集。可用命令：

source: current
ar: تيار

source: Print info on current masternode winner to be paid the next block (calculated locally)
ar: معلومات الطباعة عن الفائز الحالي في ماسترنود الذي سيتم دفعه في الفهرس التالي (محسوب محليًا)
fr: Afficher des informations sur le gagnant actuel des masternodes qui sera payé dans le prochain bloc (calculé localement)
ru: Напечатать информацию по текущей мастерноде-победителю, выплата которому будет в следующем блоке (рассчитывается локально)
zh_cn: 打印当前主节点获奖者的信息，以便在下一个区块中予以支付（本地计算）

source: outputs
ar: المخرجات

source: Print masternode compatible outputs
ar: طباعة مخرجات متوافق مع ماسترنود
fr: Afficher les sorties compatibles de masternode
ru: Напечатать совместимые с мастернодой выводы
zh_cn: 打印主节点兼容性输出

source: start-alias
ar: بدء اسم مستعار

source: Start single remote masternode by assigned alias configured in masternode.conf
ar: بدء ماسترنود عن بعد واحد عن طريق الاسم المستعار المعين تكوينها في masternode.conf
fr: Démarrer un seul masternode distant par son alias tel que configuré dans le fichier masternode.conf
ru: Запустить одну удалённую мастерноду через связанный с ней псевдоним, прописанный в masternode.conf
zh_cn: 通过masternode.conf中配置的已分配别名启动单个的远程主节点

source: start-<mode>
ar: بدأ- <mode>

source: Start remote masternodes configured in masternode.conf (<mode>: 'all', 'missing', 'disabled')
ar: بدء ماسترنود البعيد تكوين في masternode.conf ( <mode> : 'كل' ، 'مفقود' ، 'معطل')
fr: Démarrer les masternodes distants tels que configurés dans le fichier masternode.conf (<mode>: 'all', 'missing', 'disabled')
ru: Запустить удалённую мастерноду, указанную в masternode.conf (<mode>: 'all', 'missing', 'disabled')
zh_cn: 启动masternode.conf中配置的远程主节点（<mode>可代表all、missing或disabled）

source: status
ar: الحالة

source: Print masternode status information
ar: اطبع معلومات حالة ماسترنود
fr: Afficher les informations sur l'état des masternodes
ru: Напечатать информацию о статусе мастерноды
zh_cn: 打印主节点状态信息

source: Print list of all known masternodes (see masternodelist for more info)
ar: طباعة قائمة بجميع الأعداد المعروفة (راجع قائمة ماسترنود لمزيد من المعلومات)
fr: Afficher la liste de tous les masternodes connus (voir masternodelist pour en savoir plus)
ru: Напечатать список всех известных мастернод (чтобы узнать больше, см. masternodelist)
zh_cn: 打印所有已知主节点的名单（查阅主节点名单来了解更多信息）

source: list-conf
ar: قائمة أسيوط

source: Print masternode.conf in JSON format
ar: اطبع masternode.conf بتنسيق JSON
fr: Afficher le fichier "masternode.conf" au format JSON
ru: Напечатать masternode.conf в JSON формате
zh_cn: 以JSON的格式打印masternode.conf

source: winner
ar: الفائز

source: Print info on next masternode winner to vote for
ar: اطبع معلومات عن الفائز المقبل على ماسترنود للتصويت لصالحه
fr: Afficher les informations sur le prochain masternode gagnant pour lequel voter
ru: Распечатать информацию о следующей мастерноде-победителе, за которую будут голосовать
zh_cn: 打印下一位主节点获奖者的信息，以便投票

source: winners
ar: الفائزين

source: Print list of masternode winners
ar: طباعة قائمة الفائزين ماسترنود
fr: Afficher la liste des masternodes gagnants
ru: Распечатать список всех мастернод-победителей
zh_cn: 打印主节点获奖者名单

source: masternodebroadcast "command"...
ar: بث ماسترنود "الأوامر" ...
fr: masternodebroadcast "commande"...

source: Set of commands to create and relay masternode broadcast messages. Available commands:
ar: مجموعة من الأوامر لإنشاء ونقل رسائل البث ماسترنود. الأوامر المتاحة:
fr: Jeu de commandes pour créer et retransmettre des messages diffusés de masternodes. Commandes disponibles :
ru: Набор команд, чтобы создавать и передавать транслируемые сообщения мастерноды. Доступные команды:
zh_cn: 用于创建和中继主节点广播消息的命令集。可用命令：

source: create-alias
ar: إنشاء اسم مستعار

source: Create single remote masternode broadcast message by assigned alias configured in masternode.conf
ar: إنشاء رسالة إذاعة ماسترنود واحدة عن بعد عن طريق الاسم المستعار المعين الذي تم تكوينه في masternode.conf
fr: Créer un seul message diffusé pour un masternode distant, en utilisant son alias tel que configuré dans le fichier masternode.conf
ru: Создать одно транслируемое удалённой мастернодой сообщение с помощью назначенного псевдонима, заданного в masternode.conf
zh_cn: 通过masternode.conf中配置的已分配别名创建单个的远程主节点广播消息

source: create-all
ar: إنشاء كافة

source: Create remote masternode broadcast messages for all masternodes configured in masternode.conf
ar: إنشاء رسائل البث ماسترنود عن بعد لجميع ماسترنود تكوينها في masternode.conf
fr: Créer des messages diffusés pour tous les masternodes distants tels que configurés dans le fichier masternode.conf
ru: Создать транслируемые удалённой мастернодой сообщения для всех мастернод, заданных в masternode.conf
zh_cn: 为masternode.conf中配置的所有主节点创建远程主节点广播消息

source: decode
ar: فك تشفير

source: Decode masternode broadcast message
ar: فك ترميز رسالة ماسترنود البث
fr: Décoder le message diffusé de masternode
ru: Расшифровать транслируемое мастернодой сообщение
zh_cn: 解码主节点广播消息

source: relay
ar: تناوب

source: Relay masternode broadcast message to the network
ar: ترحيل رسالة البث ماسترنود إلى الشبكة
fr: Retransmettre le message diffusé de masternode au réseau
ru: Передать транслируемое мастернодой сообщение в сеть
zh_cn: 在网络上中继主节点广播消息

source: Returns the sync status, updates to the next step or resets it entirely.
ar: لعرض حالة المزامنة أو تحديثات الخطوة التالية أو إعادة تعيينها بالكامل
fr: Renvoie l'état de synchronisation, met à jour vers l'étape suivante, ou le réinitialise entièrement.
ru: Выводит статус синхронизации, обновляет до следующего шага или полностью её перезапускает
zh_cn: 返回同步状态，更新到下一步或完全重置。

source: privatesend "command"
ar: الإرسال المخفي "الأوامر"
fr: privatesend "commande"

source: Available commands:
ar: الأوامى المتاحة:
fr: Commandes disponibles :
ru: Доступные команды:
zh_cn: 可用命令：

source: start
ar: بدأ

source: Start mixing
ar: بدأ الخلط
fr: Commencer le mélange
ru: Начать перемешивание

source: Stop mixing
ar: أيقاف الخلط
fr: Arrêter le mélange
ru: Остановить перемешивание

source: reset
ar: إعادة تعيين

source: Reset mixing
ar: إعادة تعيين الخلط
fr: Réinitialise le mélange
ru: Перезапустить перемешивание

source: sentinelping version
ar: نسخة الحماية

source: Sentinel ping.
ar: حماية ping.
fr: Ping sur Sentinel.
ru: Дежурный сигнал.

source: Generating
ar: توليد
fr: Génération
ru: Генерирование

source: Mining
ar: تعدين
fr: Minage
ru: Майнинг
zh_cn: 挖矿

source: If the request parameters include a 'mode' key, that is used to explicitly select between the default 'template' request or a 'proposal'. It returns data needed to construct a block to work on.
ar: إذا كانت معلمات الطلب تشتمل على مفتاح "وضع" ، فسيتم استخدام ذلك بشكل صريح بين طلب "القالب" الافتراضي أو "الاقتراح". تقوم بإرجاع البيانات المطلوبة لإنشاء كتلة للعمل عليها.
fr: Si les paramètres de requête incluent une clé "mode", elle est utilisée pour choisir explicitement entre la requête "modèle" par défaut ou une "proposition". Renvoie les données nécessaires pour former un bloc sur lequel travailler.
ru: Если параметры запроса включают в себя ключ 'mode', он используется чтобы чётко выбирать между стандартным запросом 'template' или 'proposal'. Он выводит данные, необходимые для создания работающего блока.
zh_cn: 如果请求参数包含'模式'键，则请求参数用于在默认'模板'请求或'提议'之间做出选择。它返回构建区块所需的数据。

source: getmininginfo
ar: الحصول على معلومات التعدين

source: Returns a json object containing mining-related information.
ar: إرجاع كائن json يحتوي على معلومات متعلقة بالتعدين.
fr: Renvoie un objet JSON contenant des informations relatives au minage.
ru: Вывод json-объект, который содержит относящуюся к майнингу информацию.
zh_cn: 返回包含与挖矿相关的信息的JSON对象。

source: Returns the estimated network hashes per second based on the last n blocks. Pass in [blocks] to override # of blocks, -1 specifies since last difficulty change. Pass in [height] to estimate the network speed at the time when a certain block was found.
ar: لعرض تجزئات الشبكة المقدّرة في الثانية استنادًا إلى النطاقات الأخيرة. مرر في [كتل] لتجاوز # من الكتل ، -1 يحدد منذ تغيير آخر الصعوبة. مرر في [مرتفع] لتقدير سرعة الشبكة في الوقت الذي تم فيه العثور على كتلة معينة.
fr: Renvoie le nombre estimé de hachages par seconde du réseau, en se basant sur les n derniers blocs. Indiquez [blocks] pour outrepasser le nombre de blocs, -1 indiquant la période depuis la dernière modification de la difficulté. Indiquez [height] pour estimer la vitesse du réseau au moment où un certain bloc a été découvert.
ru: Выводит приблизительные хэши в секунду для сети, на основании последних n блоков. Введите [blocks], чтобы обойти # блоков, -1 определяет изменения с последних данных о сложности. Введите [height], чтобы определить среднюю скорость сети во время открытия определённого блока.
zh_cn: 基于最后的n个块返回每秒钟的网络哈希值。输入[blocks]来覆盖# of blocks，-1用于指定最后一次的难度变化。输入[height]来计算找到某个区块时的网络速度。

source: prioritisetransaction <txid> <priority delta> <fee delta>
ar: تحديد أولويات المعاملة <txid> <priority delta> <fee delta>

source: submitblock "hexdata" ( "jsonparametersobject" )
ar: إرسال كتلة "hex data" ("كائن معلمات json")

source: Attempts to submit new block to network. The 'jsonparametersobject' parameter is currently ignored. See https://en.bitcoin.it/wiki/BIP_0022 for full specification.
ar: محاولات لتقديم حظر جديد للشبكة. يتم تجاهل المعلمة 'jsonparametersobject' حاليًا. نرى https://en.bitcoin.it/wiki/BIP_0022 for full specification.
fr: Essaie de soumettre un nouveau bloc au réseau. Le paramètre 'jsonparametersobject' est actuellement ignoré. Pour voir la spécification complète, voir https://en.bitcoin.it/wiki/BIP_0022 .
ru: Стремится вывести новые блоки в сеть. Параметр 'jsonparametersobject' в данном случае игнорируется. Полную спецификацию см. на https://en.bitcoin.it/wiki/BIP_0022.
zh_cn: 尝试向网络提交新的区块。目前，jsonparametersobject参数已被忽略。如需阅读规范全文，请访问网址 https://en.bitcoin.it/wiki/BIP_0022 。

source: Network
ar: الشبكة
fr: Réseau
ru: Сетевой траффик

source: Attempts add or remove a node from the addnode list. Or try a connection to a node once.
ar: محاولات إضافة أو إزالة عقدة من قائمة إضافة عقدة. أو جرب الاتصال بعقدة مرة واحدة.
fr: Essaie d'ajouter ou d'enlever un nœud depuis la liste d'ajout de nœuds. Ou essaie une connexion à un nœud une seule fois.
ru: Стремится добавить или удалить ноду из списка addnode. Или пытается единожды подключиться к ноде.
zh_cn: 尝试在addnode列表中添加或删除节点，或尝试连接一个节点一次。

source: clearbanned
ar: واضح المحظورة

source: Clear all banned IPs.
ar: مسح جميع عناوين IP المحظورة.
fr: Effacer toutes les adresses IP bannies.
ru: Очистить все забаненные IP.
zh_cn: 清除所有被禁用的IP。

source: Immediately disconnects from the specified node.
ar: قطع على الفور من العقدة المحددة.
fr: Se déconnecte immédiatement du nœud indiqué.
ru: Немедленно отключается от заданной ноды.
zh_cn: 立即断开与某个节点的连接。

source: getconnectioncount
ar: الحصول على اتصال العد

source: Returns the number of connections to other nodes.
ar: إرجاع عدد الاتصالات إلى العقد الأخرى
fr: Renvoie le nombre de connexions à d'autres nœuds.
ru: Выводит количество подключений к другим нодам.
zh_cn: 返回与其他节点的连接数量。

source: getnettotals
ar: الحصول على المجاميع الصافية

source: Returns information about network traffic, including bytes in, bytes out, and current time.
ar: لعرض معلومات حول حركة مرور الشبكة ، بما في ذلك وحدات البايت في ، و outtes out ، والوقت الحالي.
fr: Renvoie des informations sur le trafic réseau, dont les octets entrants, les octets sortants et l'heure actuelle.
ru: Выводит информацию о трафике сети, включая количество входящих и исходящих байтов, а также текущее время.
zh_cn: 返回有关网络流量的信息，其中包括字节数、字节输出和当前时间。

source: getnetworkinfo
ar: الحصول على معلومات الشبكة

source: Returns an object containing various state info regarding P2P networking.
ar: إرجاع كائن يحتوي على معلومات حالة متنوعة بخصوص شبكة P2P.
fr: Renvoie un objet contenant diverses informations d'état relatives au réseau pair à pair.
ru: Выводит объект, содержащий различные данные о P2P сети.
zh_cn: 返回包含有关P2P网络的各种状态信息的对象。

source: getpeerinfo
ar: الحصول على معلومات الأقران

source: Returns data about each connected network node as a json array of objects.
ar: لعرض البيانات عن كل عقدة شبكة متصلة كصفيف json من الكائنات.
fr: Renvoie des données sur chaque nœud connecté du réseau, sous forme de tableau JSON d'objets.
ru: Выводит данные о каждой подключённой к сети ноде в виде json массива объектов.
zh_cn: 以JSON对象数组的形式返回有关每个连接的网络节点的数据。

source: listbanned
ar: قائمة محظورة

source: List all banned IPs/Subnets.
ar: قائمة جميع IPs / الشبكات الفرعية المحظورة.
fr: Afficher la liste de toutes les adresses IP ou tous les sous-réseaux bannis.
ru: Список всех забаненных IP / подсетей
zh_cn: 列出所有禁用的IP/子网。

source: Requests that a ping be sent to all other nodes, to measure ping time. Results provided in getpeerinfo, pingtime and pingwait fields are decimal seconds. Ping command is handled in queue with all other commands, so it measures processing backlog, not just network ping.
ar: يطلب إرسال ping إلى جميع العقد الأخرى ، لقياس وقت ping. النتائج الواردة في الحصول على معلومات النظير ، ping وقت وحقول الانتظار ping هي الثواني العشرية. يتم التعامل مع أمر Ping في طابور مع جميع الأوامر الأخرى ، لذلك يقيس تراكم العمل ، وليس فقط ping على الشبكة.
fr: Demande l'envoi d'un ping à tous les autres nœuds, pour évaluer le temps de ping. Les résultats fournis par les champs getpeerinfo, pingtime et pingwait sont exprimés en secondes décimales. La commande ping est traitée en file d'attente avec les autres commandes, donc elle mesure l'arriéré de traitement, pas uniquement le ping de réseau.
ru: Делает запрос, чтобы всем остальным нодам был отправлен пинг для изменения времени пинга. Результаты в полях getpeerinfo, pingtime и pingwait выводятся в десятых долях секунды. Команда ping идёт вместе с другими командами, поэтому она измеряет не только время пинга сети, но ещё и обработку задержки.
zh_cn: 请求将ping发送到所有其它节点，以测量ping时间。 以getpeerinfo、pingtime和pingwait字段的形式显示结果。 Ping命令和所有其它命令一起在队列中等待处理，因此它将测量积压的待办事项，而不仅仅是网络ping。

source: Attempts add or remove a IP/Subnet from the banned list.
ar: محاولات إضافة أو إزالة IP / Subnet من القائمة المحظورة.
fr: Essaie d'ajouter ou d'enlever une adresse IP ou un sous-réseau de la liste des bannis.
ru: Стремится добавить или удалить IP/подсеть из списка забаненных.
zh_cn: 尝试在被禁列表中添加或删除IP或子网。

source: Disable/enable all p2p network activity.
ar: تعطيل / تمكين كل نشاط شبكة p2p.
fr: Désactive/active toute l'activité réseau pair à pair.
ru: Выключить / включить всю активность p2p сети.
zh_cn: 禁用/启用所有的P2P活动。

source: Rawtransactions
ar: المعاملات الخام
ru: Сырые транзакции

source: createrawtransaction [{"txid":"id","vout":n},...] {"address":amount,"data":"hex",...} ( locktime )
ar: إنشاء معاملة خام [{"txid": "id"، "vout": n}، ...] {"العناوين": المبلغ، "data": "hex"، ...} (الوقت)

source: Create a transaction spending the given inputs and creating new outputs. Outputs can be addresses or data. Returns hex-encoded raw transaction. Note that the transaction's inputs are not signed, and it is not stored in the wallet or transmitted to the network.
ar: إنشاء معاملة لإنفاق المدخلات المعينة وإنشاء مخرجات جديدة. يمكن أن تكون المخرجات عناوين أو بيانات. إرجاع المعاملة الخام المشفرة بأكسيد عشري. لاحظ أن مدخلات المعاملة لم يتم توقيعها ، ولا يتم تخزينها في المحفظة أو نقلها إلى الشبكة.
fr: Créer une transaction qui dépense toutes les entrées données et crée de nouvelles sorties. Les sorties peuvent être des adresses ou des données. Renvoie la transaction brute codée en hexadécimal. À noter que les entrées de transaction ne sont pas signées, et qu'elle n'est pas stockée dans le portefeuille ni transmise au réseau.
ru: Создаёт транзакцию, которая тратит заданные вводы и создаёт новые выводы. Выводы могут быть адресами или данными. Вывод зашифрованную шестнадцатеричным кодированием сырую транзакцию. Обратите внимание, что вводы транзакции не подписаны, и что она не хранится в кошельке и не передаётся в сеть.
zh_cn: 创建一个根据输入来完成交易并创建新输出的交易。输出可以是地址或数据。以十六进制编码返回原始交易。请注意，交易的输入未签名，并且不存储在钱包中或传输到网络上。

source: decoderawtransaction "hexstring"
ar: فك شفرة المعاملات الخام "هيستسترينج"

source: Return a JSON object representing the serialized, hex-encoded transaction.
ar: إرجاع كائن JSON يمثل المعاملة المتسلسلة ، المشفرة عشري.
fr: Renvoie un objet JSON représentant la transaction sérialisée, codée en hexadécimal.
ru: Вывести JSON объект в виде сериализованной, зашифрованной шестнадцатеричным кодированием транзакции
zh_cn: 返回表示序列化十六进制编码交易的JSON对象。

source: Decode a hex-encoded script.
ar: فك تشفير البرنامج النصي المشفّر سداسي عشري.
fr: Décode un script codé en hexadécimal.
ru: Расшифровать зашифрованный шестнадцатеричным кодированием скрипт.
zh_cn: 解码十六进制编码的脚本。

source: getrawtransaction "txid" ( verbose )
ar: الحصول على المعاملة الأولية "txid" (مطول)
fr: getrawtransaction "txid" ( bavard )

source: Submits raw transaction (serialized, hex-encoded) to local node and network. Also see createrawtransaction and signrawtransaction calls.
ar: يقدم المعاملة الأولية (متسلسلة ، ومشفرة عرافة) إلى العقدة والشبكة المحلية. راجع أيضًا إنشاء المعاملة الأولية وتوقيع مكالمات المعاملات الأولية.
fr: Soumet une transaction brute (sérialisée, codée en hexadécimal) au nœud local et au réseau. Voir aussi les appels createrawtransaction et signrawtransaction.
ru: Направляет сырые транзакции (сериализованные, зашифрованные шестнадцатеричным кодированием) локальной ноде и в сеть. См. также вызовы createrawtransaction и signrawtransaction.
zh_cn: 将序列化的（十六进制原始）交易提交到本地节点和网络。如需了解其它信息，请参阅createrawtransaction和signrawtransaction调用。

source: signrawtransaction "hexstring" ( [{"txid":"id","vout":n,"scriptPubKey":"hex","redeemScript":"hex"},...] ["privatekey1",...] sighashtype )
ar: تسجيل المعاملة الأولية "hexstring" ([{"txid": "id"، "vout": n، "scriptPubKey": "hex"، "redeemScript": "hex"}، ...] ["privatekey1" ،. ..] sighashtype)

source: Sign inputs for raw transaction (serialized, hex-encoded). The second optional argument (may be null) is an array of previous transaction outputs that this transaction depends on but may not yet be in the block chain. The third optional argument (may be null) is an array of base58-encoded private keys that, if given, will be the only keys used to sign the transaction.
ar: تسجيل المدخلات للمعاملة الأولية (تسلسلية ، ترميز عرافة). الوسيطة الاختيارية الثانية (قد تكون فارغة) هي مجموعة من مخرجات العمليات السابقة التي تعتمد عليها هذه المعاملة ولكنها قد لا تكون في سلسلة الحظر. الوسيطة الاختيارية الثالثة (قد تكون فارغة) هي مجموعة من المفاتيح الخاصة المشفرة بالقاعدة 58 ، والتي إذا كانت معطاة ، ستكون المفاتيح الوحيدة المستخدمة لتوقيع المعاملة.
fr: Signe les entrées pour une transaction brute (sérialisée, codée en hexadécimal). Le second argument facultatif (peut être nul) est un tableau des précédentes sorties de transaction dont dépend cette transaction mais qui peuvent ne pas être encore dans la blockchain. Le troisième argument facultatif (peut être nul) est un tableau de clés privées codées base58 qui, si fournies, seront les seules clés utilisées pour signer la transaction.
ru: Подписать вводы для сырой транзакции (сериализованной, зашифрованной шестнадцатеричным кодированием). Второй возможный аргумент (который может быть нулём) это массив предыдущих выводов транзакции, от которых зависит эта транзакция, но которые могут ещё не находится в цепочке блоков. Третий возможный аргумент (может быть нулём) это массив зашифрованных base58 приватных ключей, который, если задан, будет состоять исключительно из ключей, использованных для подписания транзакции.
zh_cn: 以序列化的（十六进制编码）的形式签署原始交易的输入。第二个可选参数（可以为零）是此前交易的数组，它是交易所依赖的数组，但可能还不存在于区块链上。第三个可选参数（可以为零）是base58编码的私钥数组，如果这些参数已经给定，那么这些数组将是为交易签名的唯一数组。

source: createmultisig nrequired ["key",...]
ar: إنشاء multisig المطلوبة ["مفتاح" ، ...]

source: Creates a multi-signature address with n signature of m keys required. It returns a json object with the address and redeemScript.
ar: إنشاء عنوان متعدد التوقيع مع توقيع n من مفاتيح m المطلوبة. تقوم بإرجاع كائن json باستخدام العنوان واسترداد Script
fr: Crée une adresse multi-signature avec n signatures sur m clés requises. Renvoie un objet JSON avec l'adresse et redeemScript.
ru: Создаёт адрес с мульти-подписью, с требованием n подписей от m ключей. Выводит json объект с адресом и redeemScript.
zh_cn: 创建一个多签名地址，其中用户需要取得m个签名中的n个才能授权交易。它返回一个带有地址和redeemScript的JSON对象。

source: estimatefee nblocks
ar: تقديرالقوالب
