Repository: 12Gitcat/docs
Catalog: locale/*/LC_MESSAGES/wallets/dashcore/cmd-rpc.po
Languages: ar, fr, ru, zh_cn

source: Dash Core wallet startup arguments and RPC command reference
ar: محفظة داش كور و الحجج و بدء التشغيل و مرجع الأوامر
fr: Guide de référence des arguments de démarrage et des commandes RPC du portefeuille logiciel Dash Core
ru: Аргументы запуска кошелька Dash Core и справка по командам RPC

source: dash, core, wallet, arguments, commands, RPC
ar: داش ، كور ، المحفظة ، الحجج ، الأوامر ، RPC
fr: dash, core, portefeuille logiciel, arguments, commandes, RPC
ru: dash, core, кошелёк, аргументы, команды, RPC

source: Arguments and commands
ar: الحجج و الأوامر
fr: Arguments et commandes
ru: Аргументы и команды
zh_cn: 命令和参数

source: All command-line options (except for ``-datadir`` and ``-conf``) may be specified in a configuration file, and all configuration file options may also be specified on the command line. Command-line options override values set in the configuration file. The configuration file is a list of ``setting=value`` pairs, one per line, with optional comments starting with the ``#`` character.
ar: يمكن تحديد جميع خيارات سطر الأوامر (فيما عدا ``datadir-`` و ``-conf`` ) في ملف التوصيف ، كما يمكن تحديد جميع خيارات ملفات التهيئة في سطر الأوامر. تتجاوز خيارات سطر الأوامر القيم المحددة في ملف التهيئة. ملف التهيئة هو قائمة من أزواج ``setting = value`` ، واحدة لكل سطر ، مع التعليقات الاختيارية التي تبدأ بالحرف ``#``.
fr: Toutes les options de ligne de commande (sauf pour ``-datadir`` et ``-conf``) peuvent être indiquées dans un fichier de configuration, et toutes les options de fichier de configuration peuvent aussi être indiquées en ligne de commande. Les options de ligne de commande outrepassent les valeurs indiquées dans le fichier de configuration. Le fichier de configuration est une liste de paires ``réglage=valeur``, une par ligne, avec des commentaires facultatifs qui commencent par le caractère ``#``.
ru: Все параметры командной строки (за исключением ``-datadir`` и ``-conf``) можно задать в файле конфигурации, и все параметры файла конфигурации можно также задать с помощью командной строки. Параметры, заданные через командную строку, превалируют над значениями, заданными в файле конфигурации. Файл конфигурации состоит из списка пар вида ``setting=value``, по одной в строке, возможно также наличие комментариев, которые начинаются с символа ``#``.
zh_cn: 可以在配置文件中指定（除了``-datadir``和``-conf``之外）的所有命令行选项，也可以在命令行中指定所有配置文件选项。命令行选项会覆盖配置文件中的设定值。配置文件是一个包含``setting=value``的列表，每行都有，除此之外，文件中还包括以 ``#`` 字符开头的可选注释。

source: The configuration file is not automatically created; you can create it using your favorite plain-text editor. By default, dash-qt (or dashd) will look for a file named ``dash.conf`` in the dash data directory, but both the data directory and the configuration file path may be changed using the -datadir and -conf command-line arguments.
ar: لا يتم إنشاء ملف التكوين تلقائيًا ؛ يمكنك إنشاؤه باستخدام محرر النص العادي المفضل لديك. بشكل افتراضي ، ستبحث dash-qt (أو dashd) عن ملف اسمه ``dash.conf`` في دليل بيانات الشرطة ، ولكن قد يتم تغيير كل من دليل البيانات ومسار ملف التهيئة باستخدام الأمر datadir و -conf الحجج الخطية.
fr: Ce fichier de configuration n'est pas créé automatiquement ; vous pouvez le créer avec votre éditeur de texte préféré. Par défaut, dash-qt (ou dashd) cherchera un fichier nommé ``dash.conf`` dans le répertoire de données Dash, mais les chemins de ce répertoire ou du fichier peuvent être modifiés avec les arguments -datadir et -conf command-line.
ru: Файл конфигурации не создаётся автоматически; его можно создать с помощью вашего любимого текстового редактора. По умолчанию, dash-qt (или dashd) будет искать файл с названием ``dash.conf`` в папке с данными dash, но путь к папке с данными, равно как и путь к файлу конфигурации, можно изменить с помощью аргументов командной строки -datadir и -conf.
zh_cn: 配置文件不是自动创建的。用户可以通过纯文本编辑器来完成创建。在默认情况下，dash-qt（或dashd）会在达世币数据目录中查找名为``dash.conf``的文件。不过，用户可以使用 -datadir 和 -conf 命令行来更改数据目录和配置文件路径。

source: Platform
ar: المنصة
fr: Plateforme
ru: Платформа
zh_cn: 平台

source: Path to data folder
ar: المسار إلى مجلد البيانات
fr: Chemin du répertoire de données
ru: Путь к папке с данными
zh_cn: 数据文件夹路径

source: Typical path to configuration file
ar: المسار النموذجي لملف التكوين
fr: Chemin typique du fichier de configuration
ru: Стандартный путь к файлу конфигурации
zh_cn: 配置文件的通常路径

source: Linux
ar: لينكس

source: macOS
ar: ماك

source: Windows
ar: ويندوز

source: Note: if running Dash in testnet mode, the sub-folder ``testnet3`` will be appended to the data directory automatically.
ar: ملاحظة: في حالة تشغيل داش في وضع testnet ، سيتم إلحاق المجلد الفرعي ``testnet3`` بدليل البيانات تلقائيًا.
fr: À noter : si Dash tourne en mode de réseau de test, le sous-répertoire ``testnet3`` sera ajouté automatiquement au répertoire de données.
ru: Обратите внимание: если Dash запущен в режиме тестнета, подпапка ``testnet3`` будет автоматически добавлена в директорию с данными.
zh_cn: 注意：如果用户在测试网环境下运行达世币核心钱包，子文件夹 ``testnet3`` 会被自动添加到数据目录中。

source: Command line arguments
ar: وسائط سطر الأوامر
fr: Arguments de ligne de commande
ru: Аргументы командной строки
zh_cn: 命令行参数

source: Dash Core Daemon
ar: جوهرة داش كور
fr: Daemon Dash Core
ru: Демон Dash Core

source: Usage
ar: الإستخدام
fr: Utilisation
ru: Применение
zh_cn: 使用

source: dashd [options]
ar: dashd [الخصائص]
zh_cn: dashd [选项]

source: Start Dash Core Daemon
ar: بدأ جوهرة داش كور
fr: Démarrage du daemon Dash Core
ru: Запустите демон Dash Core
zh_cn: 开启Dash Core Daemon

source: Options
ar: الخصائص
ru: Опции
zh_cn: 选项

source: Print version and exit
ar: طبع الإصدار و اخرج
fr: Afficher la version et quitter
ru: Распечатать версию и выйти
zh_cn: 打印版本并退出

source: Receive and display P2P network alerts (default: 1)
ar: تلقي تنبيهات شبكة P2P وعرضها (الافتراضي: 1)
fr: Recevoir et afficher les alertes pair à pair du réseau (par défaut : 1)
ru: Получить и вывести на экран сообщения P2P сети (по умолчанию: 1)
zh_cn: 接收并显示P2P网络的警报（默认值：1）

source: Execute command when a relevant alert is received or we see a really long fork (%s in cmd is replaced by message)
ar: تنفيذ الأمر عند تلقي تنبيه ملائم أو رؤية شوكة طويلة حقًا ( %s في cmd يتم استبدالها برسالة)
fr: Exécuter la commande quand une alerte correspondante est reçue, ou quand un très long fork est constaté (%s dans la commande est remplacé par le message)
ru: Выполнить команду, когда всплывает соответствующее уведомление, или мы видим действительно большой форк (%sв cmd заменяется сообщением)
zh_cn: 在接收到相关警报或看到相当长的分叉后执行命令（cmd中的%s被消息所替代）

source: Execute command when the best block changes (%s in cmd is replaced by block hash)
ar: تنفيذ الأمر عند تغيير أفضل كتلة ( %s في cmd يتم استبداله بكتلة التجزئة)
fr: Exécuter la commande quand le meilleur bloc est modifié (%s dans la commande est remplacé par l'empreinte de hachage du bloc)
ru: Выполнить команду, когда изменяется лучший блок (%s в cmd заменяется хэшем блока)
zh_cn: 在最佳区块更改时执行命令（cmd中的%s被区块哈希值所替代）

source: If this block is in the chain assume that it and its ancestors are valid and potentially skip their script verification (0 to verify all, default: 00000000000000b4181bbbdddbae464ce11fede5d0292fb63fdede1e7c8ab21c, testnet: 00000ce22113f3eb8636e225d6a1691e132fdd587aed993e1bc9b07a0235eea4)
ar: إذا كانت هذه المجموعة في السلسلة تفترض أنها وأجدادها صالحة ويمكن تخطي التحقق من النص البرمجي (0 للتحقق من الكل ، الافتراضي: 00000000000000b4181bbbdddbae464ce11fede5d0292fb63fdede1e7c8ab21c, testnet: 00000ce22113f3eb8636e225d6a1691e132fdd587aed993e1bc9b07a0235eea4)
fr: Si ce bloc est dans la chaîne, considérer que lui et ses ancêtres sont valides et sauter potentiellement leur vérification de script (0 pour tout vérifier, par défaut : 00000000000000b4181bbbdddbae464ce11fede5d0292fb63fdede1e7c8ab21c, réseau de test : 00000ce22113f3eb8636e225d6a1691e132fdd587aed993e1bc9b07a0235eea4)
ru: Если этот блок находится в цепочке, считать его и предшествующие блоки валидными и, возможно, пропустить верификацию с помощью скрипта (0 - верифицировать всё, по умолчанию: 00000000000000b4181bbbdddbae464ce11fede5d0292fb63fdede1e7c8ab21c, тестнет: 00000ce22113f3eb8636e225d6a1691e132fdd587aed993e1bc9b07a0235eea4)
zh_cn: 如果该区块在区块链中，则假设该区块及此前的区块有效并可能跳过其脚本验证(0 来验证全部, 默认: 00000000000000b4181bbbdddbae464ce11fede5d0292fb63fdede1e7c8ab21c, 测试网: 00000ce22113f3eb8636e225d6a1691e132fdd587aed993e1bc9b07a0235eea4)

source: Specify configuration file (default: dash.conf)
ar: تحديد ملف التكوين (افتراضي: dash.conf)
fr: Indiquer le fichier de configuration (par défaut : dash.conf)
ru: Задать файл конфигурации (по умолчанию: dash.conf)
zh_cn: 指定配置文件（默认：dash.conf）

source: Run in the background as a daemon and accept commands
ar: تشغيل في الخلفية كخفي وقبول الأوامر
fr: Tourner en arrière-plan en tant que daemon et accepter les commandes
ru: Запустить в фоновом режиме в качестве демона и принять команды
zh_cn: 在后台运行，以作为守护进程并接收命令

source: Specify data directory
ar: تحديد دليل البيانات
fr: Indiquer le répertoire de données
ru: Определить папку с данными
zh_cn: 指定数据目录

source: Set database cache size in megabytes (4 to 16384, default: 100)
ar: تعيين حجم ذاكرة التخزين المؤقت لقاعدة البيانات بالميغابايت (4 إلى 16384 ، القيمة الافتراضية: 100)
fr: Définir la taille du cache de la base de données, en Mo (4 à 16384, par défaut : 100)
ru: Установить размер кэша базы данных в мегабайтах (от 4 до 16384, по умолчанию - 100)
zh_cn: 以兆字节为单位设置数据库缓存大小(4 至 16384, 默认: 100)

source: Imports blocks from external blk000??.dat file on startup
ar: يستورد كتل من ملف blk000 ؟؟ dat الخارجي عند بدء التشغيل
fr: Importer les blocs depuis un fichier externe blk000??.dat au démarrage
ru: При запуске импортировать блоки из внешнего файла blk000??.dat
zh_cn: 在启动时从外部的blk000??.dat文件中导入区块

source: Keep at most <n> unconnectable transactions in memory (default: 100)
ar: ابقى على اقصى حد <n> معاملات غير قابلة للاتصال في الذاكرة (افتراضي: 100)
fr: Conserver au maximum <n> transactions non connectables en mémoire (par défaut : 100)
ru: Хранить в памяти максимум <n> неподключённую транзакцию (по умолчанию: 100)
zh_cn: 在内存中最多保留<n>个不可连接的交易（默认值：100）

source: Keep the transaction memory pool below <n> megabytes (default: 300)
ar: إبقاء تجمع ذاكرة المعاملة أدناه <n> ميغابايت (افتراضي: 300)
fr: Garder le tampon mémoire de transactions sous <n> Mo (par défaut : 300)
ru: Следить, чтобы размер пула памяти был не больше <n> мегабайт (по умолчанию - 300)
zh_cn: 使交易内存池维持在<n>兆字节以下（默认值：300）

source: Do not keep transactions in the mempool longer than <n> hours (default: 72)
ar: لا تبقي المعاملات في mempool أطول من <n> ساعات ( افتراضي: 72)
fr: Ne pas garder les transactions dans le tampon mémoire plus que <n> heures (défaut : 72)
ru: Не хранить транзакции в мемпуле дольше <n> часов (по умолчанию - 72)
zh_cn: 不要在内存池中保留超过<n>小时的交易（默认值：72）

source: Set the number of script verification threads (-1 to 16, 0 = auto, <0 = leave that many cores free, default: 0)
ar: تعيين عدد مؤشرات الترابط التحقق من البرنامج النصي (-1 إلى 16 ، 0 = تلقائي ، <0 = ترك أن العديد من النوى الحرة ، الافتراضي: 0)
fr: Définir le nombre de files de vérification de script (-1 à 16, 0 = auto, <0 = garder libres ce nombre de cœurs, défaut : 0)
ru: Установить количество ветвей верификаций скрипта (от -1 до 16, 0 = авто, <0 = оставить такое количество ядер свободными, по умолчанию - 0)
zh_cn: 设置脚本验证线程的数量（范围：-1到16，0 则为自动设置，<0 则为闲置，默认值：0）

source: Specify pid file (default: dashd.pid)
ar: تحديد ملف pid (افتراضي: dashd.pid)
fr: Indiquer le fichier pid (défaut : dashd.pid)
ru: Задать pid файл (по умолчанию: dashd.pid)
zh_cn: 指定pid文件（默认值：dashd.pid）

source: Rebuild chain state from the currently indexed blocks
ar: إعادة بناء سلسلة السلسلة من الكتل المفهرسة حاليًا
fr: Reconstruire l'état de la chaîne depuis les blocs actuellement indexés
ru: Восстановить состояние цепи из неиндексированных на данный момент блоков
zh_cn: 以当前索引的区块为基础重建区块链状态

source: Rebuild chain state and block index from the blk*.dat files on disk
ar: إعادة إنشاء حالة سلسلة وكتلة فهرس من ملفات blk * .dat على القرص
fr: Reconstruire l'état de la chaîne et de l'index de blocs depuis les fichiers blk*.dat sur disque
ru: Восстановить состояние цепи и индекс блоков из файлов blk*.dat на диске
zh_cn: 以磁盘上的 blk*.dat文件为基础重建区块链状态和区块索引

source: Create new files with system default permissions, instead of umask 077 (only effective with disabled wallet functionality)
ar: إنشاء ملفات جديدة بأذونات النظام الافتراضية ، بدلاً من umask 077 (فعال فقط مع وظيفة المحفظة المعطلة)
fr: Créer de nouveau fichiers avec les autorisations système par défaut, au lieu de umask 077 (effectif seulement avec les fonctionnalités de portefeuille désactivées)
ru: Создать новые файлы с системными доступами по умолчанию, вместо umask 077 (работает только при условии, что функционал кошелька отключён)
zh_cn: 使用系统默认权限而不是umask 077创建新文件（仅对已禁用的钱包功能有效）

source: Maintain a full transaction index, used by the getrawtransaction rpc call (default: 1)
ar: الاحتفاظ بفهرس كامل للمعاملات ، يتم استخدامه بواسطة استدعاء rpc للمعاملات الأولية (الافتراضي: 1)
fr: Garder un index complet des transactions, utilisé par l'appel RPC getrawtransaction (défaut : 1)
ru: Сохранять полный индекс транзакции, использованный при вызове getrawtransaction rpc (по умолчанию: 1)
zh_cn: 维护getrawtransaction rpc所使用的完整的交易索引（默认值：1）

source: Maintain a full address index, used to query for the balance, txids and unspent outputs for addresses (default: 0)
ar: الاحتفاظ بفهرس كامل العنوان ، يُستخدم للاستعلام عن الرصيد ، و txids والمخرجات غير المنفقة للعناوين (افتراضي: 0)
fr: Garder un index complet des adresses, utilisé pour interroger le solde, les identifiants de transaction et les sorties non dépensées des adresses (défaut : 0)
ru: Сохранять полный индекс транзакции, использованный при запросе баланса, txids и неизрасходованных выводов для адресов (по умолчанию: 0)
zh_cn: 维护完整的地址索引，以便查询钱包地址上的余额、交易ID和未使用的输出（默认值：0）

source: Maintain a timestamp index for block hashes, used to query blocks hashes by a range of timestamps (default: 0)
ar: الحفاظ على فهرس الطابع الزمني لكتل التجزئات ، المستخدمة في الاستعلام عن تجزئة القطع بواسطة مجموعة من الطوابع الزمنية (الافتراضي: 0)
fr: Garder un index des horodatages des signatures de hachage des blocs, utilisé pour interroger les signatures de hachage par dates (défaut : 0)
ru: Сохранять отметку времени для хэшей блока, использованных для запроса хэшей блока целым рядом временных отметок (по умолчанию: 0)
zh_cn: 维护区块哈希值的时间戳索引，以便通过一系列时间戳查询区块哈希值（默认值：0）

source: Maintain a full spent index, used to query the spending txid and input index for an outpoint (default: 0)
ar: الحفاظ على فهرس كامل مستهلك ، يتم استخدامه للاستعلام عن إنفاق txid ومُدخل فهرس نقطة خارجية (افتراضي: 0)
fr: Garder un index complet des dépenses, utilisé pour interroger l'identifiant de transaction de dépense et l'index d'entrée pour une sortie (défaut : 0)
ru: Сохранять полностью потраченный индекс, использованный для запроса потраченных txid и входящего индекса для точки вывода (по умолчанию: 0)
zh_cn: 维护一个完整的支付索引，以便查询输出点的消费交易ID和输入索引（默认值：0）

source: Connection options
ar: خيارات الاتصال
fr: Options de connexion
ru: Настройки соединения
zh_cn: 连接选项

source: Add a node to connect to and attempt to keep the connection open
ar: أضف عقدة للاتصال بها ومحاولة للحفاظ على اتصال مفتوح
fr: Ajouter un nœud auquel se connecter, et essayer de garder la connexion ouverte
ru: Добавить ноду для подключения и держать канал связи открытым
zh_cn: 添加想要连接的节点，并尝试保持连接的开放

source: Threshold for disconnecting misbehaving peers (default: 100)
ar: عتبة انفصال أقران سوء التصرف (الافتراضي: 100)
fr: Seuil de déconnexion des pairs qui se comportent mal (défaut : 100)
ru: Порог для отключения плохо ведущих себя пиров (по умолчанию: 100)
zh_cn: 对连接不畅或操作不当的其他用户设置的阈值（默认值：100）

source: Number of seconds to keep misbehaving peers from reconnecting (default: 86400)
ar: عدد الثواني للحفاظ على نظائرها على نحو غير صحيح من إعادة الاتصال (الإعداد الافتراضي: 86400)
fr: Nombre de secondes pendant lesquelles les pairs qui se comportent mal ne peuvent pas se reconnecter (défaut : 86400)
ru: Количество секунд, в течение которого плохо ведущие себя пиры не могут переподключиться (по умолчанию: 86400)
zh_cn: 防止操作不当的其他用户重新连接的秒数（默认值：86400）

source: Bind to given address and always listen on it. Use [host]:port notation for IPv6
ar: ربط عنوان معين والاستماع دائما على ذلك. استخدم [host]: تدوين المنفذ لـ IPv6
fr: Se lier à une adresse donnée et toujours l'écouter. Utiliser la notation [hôte]:port pour IPv6
ru: Привязать к определённому адресу и всегда обращать наа него внимание. Использовать запись [host]:port для IPv6
zh_cn: 绑定到既定的地址，并始终读取它的消息。使用IPv6协议的[host]:端口

source: Discover own IP addresses (default: 1 when listening and no -externalip or -proxy)
ar: اكتشاف عناوين IP الخاصة (الافتراضي: 1 عند الاستماع وعدم وجود - أو "خضوع")
fr: Découvrir ses propres adresses IP (défaut : 1 à l'écoute et sans -externalip ou -proxy)
ru: Раскрыть собственный IP адрес (по умолчанию: 1 для внимания и -externalip or -proxy, когда нет)
zh_cn: 发现个人的IP地址（默认值：1表示始终读取，没有-externalip 或 -proxy）

source: Allow DNS lookups for -addnode, -seednode and -connect (default: 1)
ar: السماح بعمليات البحث عن DNS لـ -addnode و -seednode و -اتصال (الافتراضي: 1)
fr: Autoriser les consultations DNS pour -addnode, -seednode et -connect (défaut : 1)
ru: Позволить поиск по DNS для -addnode, -seednode и -connect (по умолчанию: 1)
zh_cn: 允许DNS查找-addnode、-seednode和-connect（默认值：1）

source: Specify your own public address
ar: حدد عنوانك العام
fr: Indiquer votre propre adresse publique
ru: Задать собственный публичный адрес
zh_cn: 指定个人的公共地址

source: Always query for peer addresses via DNS lookup (default: 0)
ar: دائما الاستعلام عن عناوين النظير عن طريق البحث عن DNS (الافتراضي: 0)
fr: Toujours demander les adresses de pairs par consultation DNS (défaut : 0)
ru: Всегда запрашивать адреса пиров через поиск по DNS (по умолчанию: 0)
zh_cn: 始终通过DNS查询其他用户的地址（默认值：0）

source: Accept connections from outside (default: 1 if no -proxy or -connect)
ar: قبول الاتصالات من الخارج (الافتراضي: 1 في حالة عدم وجود وكيل أو اتصال)
fr: Accepter les connexions de l'extérieur (défaut : 1, si pas de -proxy ou de -connect)
ru: Принимать подключения извне (по умолчанию: 1, если отсутствует -proxy или -connect)
zh_cn: 允许来自外部的连接（默认值：如果不是-proxy 或-connect，则默认值为1）

source: Automatically create Tor hidden service (default: 1)
ar: إنشاء خدمة Tor المخفية تلقائيًا (افتراضيًا: 1)
fr: Créer automatiquement un service caché Tor (défaut : 1)
ru: Автоматически создавать скрытую службу Tor (по умолчанию: 1)
zh_cn: 自动创建Tor隐藏服务（默认值：1）

source: Maintain at most <n> connections to peers (temporary service connections excluded) (default: 125)
ar: الحفاظ على الأكثر <n> الاتصالات إلى الأقران (باستثناء اتصالات الخدمة المؤقتة) (الافتراضي: 125)
fr: Conserver un maximum de <n> connexions aux pairs (connexions temporaires de service exclues) (défaut : 125)
ru: Поддерживать не более <n>подключений к пирам (за исключением подключений временных служб) (по умолчанию: 125)
zh_cn: 最多与<n>位其他用户保持连接（其中不包括临时的服务连接）（默认值：125）

source: Maximum per-connection receive buffer, <n>*1000 bytes (default: 5000)
ar: الحد الأقصى لكل تلقي مخزن مؤقت <n> 1000 بايت (افتراضي: 5000)
fr: Tampon de réception par connexion maximal, <n>*1000 octets (défaut : 5000)
ru: Максимальный размер входящего буфера на подключение, <n>*1000 байт (по умолчанию: 5000)
zh_cn: 每次连接的最大数据接收缓存为<n>*1000字节（默认值：5000）

source: Maximum per-connection send buffer, <n>*1000 bytes (default: 1000)
ar: الحد الأقصى لكل اتصال إرسال العازلة <n> 1000 بايت (افتراضي: 1000)
fr: Tampon d'envoi par connexion maximal, <n>*1000 octets (défaut : 1000)
ru: Максимальный размер исходящего буфера на подключение, <n>*1000 байт (по умолчанию: 1000)
zh_cn: 每次连接的最大数据发送缓存为<n>*1000字节（默认值：1000）

source: Use separate SOCKS5 proxy to reach peers via Tor hidden services (default: -proxy)
ar: استخدام بروكسي SOCKS5 منفصل للوصول إلى نظرائه عبر خدمات Tor المخفية (افتراضي: -proxy)
fr: Utiliser un proxy SOCKS5 distinct pour atteindre les pairs par des services cachés Tor (défaut : -proxy)
ru: Использовать отдельный прокси SOCKS5 для подключения к пирам через скрытые службы Tor (по умолчанию: -proxy)
zh_cn: 使用独立的SOCKS5代理和Tor隐藏服务连接到其它用户（默认值：-proxy）

source: Only connect to nodes in network <net> (ipv4, ipv6 or onion)
ar: فقط الاتصال بالعقد في الشبكة <net> (ipv4, ipv6 or onion)
fr: Ne se connecter qu'aux nœuds du réseau <net> (ipv4, ipv6 ou onion)
ru: Подключаться только к нодам в сети <net> (ipv4, ipv6 или onion)
zh_cn: 仅连接到网络<net>中的节点（ipv4, ipv6 或 onion）

source: Relay non-P2SH multisig (default: 1)
ar: حقيقا لا-P2SH ( افتراضي: 1)
fr: Retransmettre les multi-signatures non P2SH (défaut : 1)
ru: Передать не-P2SH мультиподпись (по умолчанию: 1)
zh_cn: 通过非P2SH 多重签名完成中转（默认值：1）

source: Support filtering of blocks and transaction with bloom filters (default: 1)
ar: دعم تصفية الكتل والمعاملات مع مرشحات bloom (الافتراضي: 1)
fr: Assurer le filtrage des blocs et transactions avec des filtres bloom (défaut : 1)
ru: Поддерживать фильтрацию блоков и транзакций с помощью имеющихся фильтров (по умолчанию: 1)
zh_cn: 支持用户使用bloom过滤器来过滤区块和交易（默认值：1）

source: Listen for connections on <port> (default: 9999 or testnet: 19999)
ar: الاستماع للاتصالات على <port> (الإعداد الافتراضي: 9999 أو testnet: 19999)
fr: Écouter les connexions sur <port> (défaut : 9999 or réseau de test : 19999)
ru: Прислушиваться к подключениями по <port> (по умолчанию: 9999 или testnet: 19999)
zh_cn: 读取<port>上的连接（默认值：9999或测试网：19999）

source: Connect through SOCKS5 proxy
ar: الاتصال من خلال وكيل SOCKS5
fr: Se connecter par proxy SOCKS5
ru: Подключаться через SOCKS5 прокси
zh_cn: 通过SOCKS5代理建立连接

source: Randomize credentials for every proxy connection. This enables Tor stream isolation (default: 1)
ar: عشوائية وثائق الاعتماد لكل اتصال الوكيل. وهذا يتيح لعزل تيار Tor (الافتراضي: 1)
fr: Identifiants aléatoires pour chaque connexion proxy. Cela active l'isolation de canal Tor (défaut : 1)
ru: Рандомизировать мандаты для каждого прокси-подключения. Эта опция включает изоляцию стрима от Tor (по умолчанию: 1)
zh_cn: 随意排列各个代理连接的凭证。这项操作将激活Tor的流量隔离功能（默认值：1）

source: Connect to a node to retrieve peer addresses, and disconnect
ar: الاتصال بعقدة لاسترداد عناوين النظير ، وقطع الاتصال
fr: Se connecter à un nœud pour obtenir les adresses de pairs, puis se déconnecter
ru: Подключиться к ноде, чтобы восстановить адреса пиров, а затем отключиться
zh_cn: 连接到节点，以便检索其他用户的地址，然后断开连接

source: Specify connection timeout in milliseconds (minimum: 1, default: 5000)
ar: تحديد مهلة الاتصال بالمللي ثانية (الحد الأدنى: 1 ، القيمة الافتراضية: 5000)
fr: Indiquer l'expiration de la connexion en millisecondes (minimum : 1, défaut : 5000)
ru: Задать время ожидания подключения в миллисекундах (минимум: 1, по умолчанию: 5000)
zh_cn: 以毫秒为单位指定连接超时（最小值：1，默认值：5000）

source: Tor control port to use if onion listening enabled (default: 127.0.0.1:9051)
ar: منفذ تحكم Tor يُستخدم إذا تم تمكين الاستماع إلى البصل (الإعداد الافتراضي: 127.0.0.1:9051)
fr: Port de contrôle Tor à utiliser si l'écoute Onion est activée (défaut : 127.0.0.1:9051)
ru: Контрольный порт Tor для использования в том случае, если включён onion-мониторинг (по умолчанию: 127.0.0.1:9051)
zh_cn: 在启用洋葱读取功能的前提下使用Tor控制端口（默认值：127.0.0.1:9051）

source: Tor control port password (default: empty)
ar: كلمة مرور منفذ تحكم Tor (افتراضي: فارغ)
fr: Mot de passe du port de contrôle Tor (défaut : vide)
ru: Пароль от контрольного порта Tor (по умолчанию: пусто)
zh_cn: Tor控制端口的密码（默认值：空）

source: Use UPnP to map the listening port (default: 0)
ar: استخدم UPnP لتعيين منفذ الاستماع (الافتراضي: 0)
fr: Utiliser UpnP pour lier le port d'écoute (défaut : 0)
ru: Использовать UPnP, чтобы отметить порт для мониторинга (по умолчанию: 0)
zh_cn: 使用通用即插即用功能映射读取端口（默认值：0）
