Repository: 12Gitcat/docs
Catalog: locale/*/LC_MESSAGES/wallets/dashcore/installation.po
Languages: ar, de, es, fr, ko, pt, ru, vi, zh_cn

source: How to download and install the Dash Core wallet. Compilation guide also available
ar: كيفية تنزيل وتثبيت محفظة داش كور. دليل التجميع متاح أيضا
de: Wie man die Dash Core Wallet herunterlädt und installiert. Kompilierungsanleitung ebenfalls verfügbar
es: Como descargar e instalar la billetera Dash Core. La Guía de compilación también disponible
fr: Comment télécharger et installer le portefeuille logiciel Dash Core. Guide de compilation également disponible
ko: 대시 코어 지갑을 다운로드하고 설치하는 방법. 컴필레이션 가이드도 사용가능합니다.
pt: Como baixar e instalar a carteira do Dash Core. Guia de compilação também disponível
ru: Как скачать и установить кошелёк Dash Core. Также доступна инструкция по компиляции.
zh_cn: 如何下载和安装Dash Core钱包。也提供编译指南

source: dash, core, wallet, linux, windows, macos, installation, compile
ar: داش، كور، محفظة، لينكس، ويندوز، ماك، تتبيث، جمع
de: dash, core, wallet, linux, windows, macos, installation, kompilieren
es: dash, core, billetera, linux, windows, macos, instalación, compilar
fr: dash, core, portefeuille, linux, windows, macos, installation, compilation
ko: 대시, 코어, 지갑, 리눅스, 윈도우, 맥os, 설치, 컴파일
pt: dash, core, carteira, linux, windows, macos, instalação, compilar
zh_cn: dash，core，钱包，linux，windows，macos，安装，编译

source: Installation
ar: التتبيث
es: Instalación
ko: 설치하기
pt: Instalação
ru: Установка
vi: Cài đặt
zh_cn: 安装

source: Installing Dash Core is as simple as going to https://www.dash.org/ and downloading the appropriate file for your system, then following the appropriate installation steps for your system. Detailed guides are available for Linux, macOS and Windows operating systems below.
ar: إن تثبيت داش كور بسيط بقدر الذهاب إلى https://www.dash.org وتنزيل الملف المناسب لنظامك ، ثم اتباع خطوات التثبيت المناسبة لنظامك. تتوفر أدلة مفصلة لأنظمة التشغيل لينكس و ماك و ويندوز أدناه.
de: Die für ein System erforderliche Installationsdatei zu Dash Core kann unter https://www.dash.org/ heruntergeladen werden und den Installationsschritten folgend installiert werden. Eine detaillierte Anleitung findet sich weiter unten für die Betriebssysteme Linux, macOS und Windows.
es: Instalar Dash Core es tan simple como ir a https://www.dash.org/ y descargar el archivo apropiado para tu sistema, luego sigue los pasos de instalación apropiados para tu sistema. Las guías detalladas están disponibles a continuación para los sistemas operativos Linux, macOS y Windows.
fr: Pour installer le portefeuille logiciel officiel Dash Core, il suffit simplement d'aller sur https://www.dash.org/ , de télécharger le fichier correspondant à votre ordinateur, puis de suivre les instructions d'installation. Des guides détaillés sont disponibles ci-dessous pour les systèmes d'exploitation Linux, macOS et Windows.
ko: Dash Core를 설치하는 것은 매우 간단합니다. 먼저 https://www.dash.org/ 에서 시스템에 적합한 파일을 다운로드 한 다음, 본인이 사용중인 운영체제에 맞게 차례대로 설치합니다. 다음은 리눅스, 맥OS 및 윈도우즈 운영 체제에 대한 자세한 안내서입니다.
pt: Instalar o Dash Core é tão simples quanto acessar https://www.dash.org/ e baixar o arquivo apropriado para o seu sistema, seguindo as etapas de instalação apropriadas para o seu sistema. Guias detalhados estão disponíveis para Linux, macOS e sistemas operacionais Windows abaixo.
ru: Установить Dash Core просто. Зайдите на сайт https://www.dash.org/ и скачайте подходящий для вашей системы файл, а затем пошагово следуйте инструкции по установке для вашей системы. Ниже доступны подробные инструкции для операционных систем Linux, macOS и Windows.
vi: Cài đặt Dash Core khá đơn giản chỉ bằng việc vào trang web https://www.dash.org/ và tải file phù hợp cho hệ thống của bạn, sau đó theo những bược cài đặt phù hợp với hệ thống của bạn. Hướng dẫn chi tiết cũng có sẵn cho các hệ điều hành Linux, macOS và Windows ở dưới đây:
zh_cn: 安装Dash Core很简单，到网站 https://www.dash.org/ 下载适合你系统的文件，并按相应的步骤安装即可。详细的Linux、macOS和Windows系统的安装指南如下。

source: It is also possible to :ref:`compile Dash Core from source code <compiling-dash>`.
ar: ومن الممكن أيضا :ref:`ترجمة داش كور من شفرة المصدر <compiling-dash>`.
de: Es ist außerdem möglich :ref:`Dash Core aus dem Quellcode zu kompilieren <compiling-dash>`.
es: También es posible :ref:`compilar Dash Core a partir del código fuente <compiling-dash>`.
fr: Il est également possible de :ref:`compiler Dash Core depuis son code source <compiling-dash>`.
ko: :ref:`소스코드에서 Dash Core 를 컴파일 하는 것 <compiling-dash>` 도 가능합니다.
pt: Também é possível :ref:`compilar o Dash Core a partir do código fonte <compiling-dash>`.
ru: Также вы можете :ref:`скомпилировать Dash Core с помощью исходного кода<compiling-dash>`.
vi: Cũng có thể :ref:`biên dịch Dash Core từ mã nguồn <compiling-dash>`.
zh_cn: 也可以通过\ :ref:`源代码编译Dash Core <compiling-dash>`\ 。

source: Video installation guides
ar: أدلة تثبيت بالفيديو
de: Installationsanleitungsvideos
es: Guías de instalación de video
fr: Guides vidéo d'installation
ko: 설치 영상 가이드
pt: Video do Guia de Instalação
ru: Видео инструкции по установке
vi: Video hướng dẫn cài đặt
zh_cn: 视频安装教程

source: These videos show how to download, verify the checksum and install the Dash Core Wallet on Linux, macOS and Windows systems. While they are somewhat out of date, the procedure is still largely the same. The main difference is that the official Dash website is now https://www.dash.org/ rather than https://www.dashpay.io/ as stated in the videos, although the old site will redirect you to the new one. Also, in later versions of Dash Core, application data such as the blockchain is now stored in the "DashCore" rather than "Dash" folder.
ar: تعرض مقاطع الفيديو هذه كيفية التنزيل والتحقق من المجموع الاختباري وتثبيت محفظة داش كور على أنظمة لينكس و ماك و ويندوز. في حين أنها قديمة بعض الشيء ، إلا أن الإجراء لا يزال إلى حد كبير. والفرق الرئيسي هو أن موقع داش الرسمي هو الآن https://www.dash.org/ بدلاً من https://www.dashpay.io/ كما هو مذكور في مقاطع الفيديو ، على الرغم من أن الموقع القديم سيعيد توجيهك إلى الموقع الجديد . أيضًا ، في الإصدارات الأحدث من داش كور ، يتم الآن تخزين بيانات التطبيق مثل بلوكشين في المجلد "داش كور" بدلاً من "داش"
de: In diesen Videos wird gezeigt, wie man die Dash Core Wallet herunterlädt, die CheckSum verifiziert und auf Linux-, MacOS- und Windows-Systemen installiert. Die Vorgehensweise ist zwar etwas veraltet, aber weitgehend gleich. Die Hauptdifferenz ist, dass die offizielle Dash-Website jetzt https://www.dash.org/ und nicht mehr https://www.dashpay.io/ heißt, so wie in den Videos angegeben, auch wenn die alte Website den Nutzer auf die neue umleitet. Zudem werden bei neueren Versionen von Dash Core die Anwendungsdaten und die Blockchain nun im Ordner „DashCore“ und damit nicht mehr wie bisher im Ordner „Dash“ gespeichert.
es: Estos videos muestran cómo descargar, verificar la suma de comprobación e instalar la billetera Dash Core en sistemas Linux, macOS y Windows. Si bien están un poco desactualizados, el procedimiento sigue siendo en gran medida el mismo. La principal diferencia es que el sitio web oficial de Dash es ahora https://www.dash.org/ en vez https://www.dashpay.io/ como se indica en los videos, aunque el sitio antiguo te redireccionará al nuevo. Además, en versiones posteriores de Dash Core, los datos de la aplicación como la cadena de bloques ahora se almacenan en la carpeta "DashCore" en lugar de "Dash".
fr: Ces vidéos montrent comment télécharger, vérifier les sommes de contrôle et installer le portefeuille logiciel Dash Core sur les systèmes d'exploitation Linux, macOS et Windows. Bien qu'elles soient un peu anciennes, la procédure est encore largement similaire. La principale différence est que le site web officiel Dash est désormais https://www.dash.org/ plutôt que l'adresse https://www.dashpay.io/ indiquée dans les vidéos, et bien que cette ancienne adresse vous redirigera vers la nouvelle. De plus, dans les versions récentes de Dash Core, les données de l'application telles que la blockchain sont désormais stockées dans le dossier "DashCore" plutôt que "Dash".
ko: 이 비디오에서는 리눅스, 맥OS 및 윈도우 등에서 다운로드하여 체크섬을 확인하고 Dash Core 지갑을 설치하는 방법을 안내합니다. 최신버전은 아니지만 절차는 대체로 동일합니다. 가장 큰 차이점이라면 비디오 상에서 Dash의 웹사이트 주소가 https://www.dashpay.io/ 로 명시되지만, 이는 구 버전이고 현재 Dash의 공식 웹사이트 주소는 https://www.dash.org/ 입니다. 한가지 더, 최신 버전의 Dash Core에서는 블록 체인과 같은 응용 프로그램 데이터가 "Dash"폴더가 아닌 "DashCore"에 저장됩니다.
pt: Esses vídeos mostram como baixar, verificar e instalar o Dash Core Wallet no Linux, macOS e sistemas Windows. Enquanto eles estão um pouco desatualizados, o procedimento ainda é basicamente o mesmo. A principal diferença é que o site oficial do Dash agora é https://www.dash.org/ em vez de https://www.dashpay.io/, conforme indicado nos vídeos, embora o site antigo o redirecione para o novo site. . Além disso, em versões posteriores do Dash Core, os dados de aplicativos, como o blockchain, agora são armazenados na pasta "DashCore" em vez de "Dash".
ru: В этих видео рассказывается как скачать, проверить контрольную сумму и установить кошелёк Dash Core для систем Linux, macOS and Windows. Несмотря на то, что инструкции немного устарели, общие черты процедуры по большей части сохранились. Основная разница в том, что официальный сайт Dash сейчас находится по адресу https://www.dash.org/, а не https://www.dashpay.io/, как говорится в видео, хотя старый сайт всё равно перенаправляет пользователей на новый. Также, в последних версиях Dash Core такие данные приложения, как блокчейн, теперь хранятся в папке под названием "DashCore", а не "Dash".
vi: Những video sau đây sẽ hướng dẫn bạn tải, kiểm tra mã checksum và cài đặt ví Dash Core trên các hệ điều hành Linux, macOS và Windows. Dù nó có thể là phiên bản hơi cũ, nhưng về mặt quy trình thì phần lớn là giống như vậy. Khác biệt chính chỉ là trang web chính thức bây giờ là https://www.dash.org/ chứ không phải là https://www.dashpay.io/ như trong các video trên, mặc dù trang web cũ cũng sẽ tái định hướng đến trang web mới bây giờ. Cũng vậy, trong các phiên bản mới hơn của Dash Core, dữ liệu của chương trình như blockchain bây giờ được đặt trong thư mục "DashCore" thay vì trong thư mục "Dash".
zh_cn: 这一部分的视频讲述了如何在Linux、macOS和Windows系统里去下载，验证校验和以及安装Dash Core钱包。其内容可能有点过时，但流程大体差不多。主要的差别是达世币现在的官网是 https://www.dash.org/ 而不是视频里说的 https://www.dashpay.io/ ，当然旧官网也会将你重新指向新的官网。另外，在最新的Dash Core中，应用数据如区块链是存储在“DashCore”而不是“Dash”下。

source: **How to Install DashQT Wallet on Linux**
ar: **كيفية تثبيت محفظة DashQT على لينكس**
de: **Wie man die DashQT Wallet unter Linux installiert**
es: **Como instalar la billetera DashQT en Linux**
fr: **Comment installer le portefeuille Dash Core sur Linux**
ko: **리눅스에서 DashQT 지갑 설치하기**
pt: **Como instalar o DashQT Wallet no Linux**
ru: **Как установить DashQT Wallet на Linux**
vi: *Làm thế nào cài đặt ví DashQT trên Linux**
zh_cn: **如何在Linux系统安装达世币QT钱包**

source: **How to Verify the CheckSum of DashQT Wallet for Linux**
ar: **كيفية التحقق من المجموع الاختباري لمحفظة DashQT لنظام التشغيل لينكس**
de: **Wie man die CheckSum der DashQT Wallet unter Linux verifiziert**
es: **Como verificar la suma de confirmación de la billetera DashQT para Linux**
fr: **Comment vérifier la somme de contrôle du portefeuille Dash Core sur Linux**
ko: **리눅스에서 DashQT 지갑의 CheckSum 확인하는 방법**
pt: **Como verificar o CheckSum do DashQT Wallet para Linux**
ru: **Как верифицировать контрольную сумму DashQT Wallet на Linux**
vi: **Làm thế nào kiểm tra CheckSum của ví DashQT cho Linux**
zh_cn: **如何在Linux系统校验达世币QT钱包**

source: **How to Install DashQT Wallet on macOS**
ar: **كيفية تثبيت محفظة DashQT على ماك**
de: **Wie man die DashQT Wallet unter macOS installiert**
es: **Como instalar la billetera DashQT en macOS**
fr: **Comment installer le portefeuille Dash Core sur macOS**
ko: **맥OS에서 DaashQT 지갑 설치하기**
pt: **Como Instalar o DashQT Wallet no macOS**
ru: **Как установить DashQT Wallet на macOS**
vi: **Làm thế nào cài đặt ví DashQT trên macOS**
zh_cn: **如何在macOS系统安装达世币QT钱包**

source: **How to Verify the CheckSum of DashQT Wallet for macOS**
ar: **كيفية التحقق من المجموع الاختباري من DashQT المحفظة ل ماك**
de: **Wie man die CheckSum der DashQT Wallet unter macOS verifiziert**
es: **Como verificar la suma de confirmación de la billetera DashQT para macOS**
fr: **Comment vérifier la somme de contrôle du portefeuille Dash Core sur macOS**
ko: **맥OS 용 DashQT 지갑의 CheckSum 확인하는 방법**
pt: **Como verificar o CheckSum do DashQT Wallet para macOS**
ru: **Как верифицировать контрольную сумму DashQT Wallet на macOS**
vi: **Làm thế nào kiểm tra CheckSum của ví DashQT cho macOS**
zh_cn: **如何在macOS系统校验达世币QT钱包**

source: **How to Install DashQT Wallet on Windows**
ar: **كيفية تثبيت محفظة DashQT على الويندوز**
de: **Wie man die DashQT Wallet unter Windows installiert**
es: **Como instalar la billetera DashQT en Windows**
fr: **Comment installer le portefeuille Dash Core sur Windows**
ko: **윈도우즈에서 DashQT 지갑 설치하기**
pt: **Como Instalar DashQT Wallet no Windows**
ru: **Как установить DashQT Wallet на Windows**
vi: *Làm thế nào cài đặt ví DashQT trên Windows**
zh_cn: **如何在Windows系统安装达世币QT钱包**

source: **How to Verify CheckSum of DashQT Wallet for Windows**
ar: **كيفية التحقق من تدقيق محفظة DashQT لنظام التشغيل ويندوز**
de: **Wie man die CheckSum der DashQT Wallet unter Windows verifiziert**
es: **Como verificar la suma de confirmación de la billetera DashQT para Windows**
fr: **Comment vérifier la somme de contrôle du portefeuille Dash Core sur Windows**
ko: **윈도우즈에서 DashQT 지갑의 CheckSum 확인하는 방법**
pt: **Como verificar o CheckSum do DashQT Wallet para Windows**
ru: **Как верифицировать контрольную сумму DashQT Wallet на Windows**
vi: **Làm thế nào kiểm tra CheckSum của ví DashQT cho Windows**
zh_cn: **如何在Windows系统校验达世币QT钱包**

source: **How to Encrypt/Decrypt Your DashQT Wallet**
ar: **كيفية تشفير / فك تشفير محفظة DashQT الخاصة بك**
de: **Wie man die DashQT Wallet verschlüsselt/entschlüsselt**
es: **Como encriptar/desencriptartu billetera DashQT**
fr: **Comment chiffrer ou déchiffrer votre portefeuille Dash Core**
ko: **DashQT 지갑 암호화 / 디코드하는 방법**
pt: **Como criptografar/descriptografar sua carteira DashQT**
ru: **Как зашифровать/расшифровать ваш DashQT Wallet**
vi: **Làm thế nào Mã hoá/Giải mã ví DashQT của bạn**
zh_cn: **如何加密/解密你的达世币QT钱包**
