Repository: 12Gitcat/docs
Catalog: locale/*/LC_MESSAGES/wallets/dashcore/installation-windows.po
Languages: de

source: How to download, install and encrypt the Dash Core wallet in Windows
de: Wie man die Dash Core Wallet unter Windows herunterlädt, installiert und verschlüsselt

source: Windows Installation Guide
de: Installationsanleitung für Windows

source: This guide describes how to download, install and encrypt the Dash Core wallet for Windows. The guide is written for Windows 10, but the steps should be similar for Windows XP, Vista, 7 and 8.
de: Diese Anleitung beschreibt wie die Dash Core Wallet für Windows heruntergeladen, installiert und verschlüsselt wird. Die Anleitung wurde für Windows 10 geschrieben, sollte aber auch für Windows XP, Vista, 7 und 8 gelten.

source: Downloading the Dash Core wallet
de: Dash Core Wallet herunterladen

source: Visit https://www.dash.org/get-dash/ to download the latest Dash Core wallet. In most cases, the website will properly detect which version you need. Click the blue **Dash Core** button to download the installer directly.
de: Besuchen Sie https://www.dash.org/get-dash/ um die neuste Version des Dash Wallets zu erhalten. In den meisten Fällen wird die Webseite die benötigte Version automatisch erkennen. Klicken Sie auf den blauen **Dash Core** Button, um den Installer direkt zu downloaden.

source: The website properly detects the wallet appropriate for your system
de: Die Webseite erkennt das richtige Wallet für Ihr Betriebssystem

source: If detection does not work, you will need to manually choose your operating system and whether you need a 32 or 64 bit version. If you are unsure whether your version of Windows is 32 or 64 bit, you can check in Windows 10 under **Start > Settings > System > About**. For details on how to check this in other versions of Windows, see `here <https://www.lifewire.com/am-i-running-a-32-bit-or-64-bit-version-of-windows-2624475>`__.
de: Falls die automatische Erkennung des Betriebssystems nicht funktionieren sollte müssen Sie das OS und die Systemarchitektur (32bit/64bit) manuell auswählen. Wenn Sie sich unsicher sind, welche Systemarchitektur Sie haben (32 oder 64 bit) können Sie das in Windows 10 unter **Start > Einstellungen > System > Info** einsehen. Wenn Sie wissen möchten, wie man es in anderen Windows Versionen einsehen kann, klicken Sie `hier <https://www.lifewire.com/am-i-running-a-32-bit-or-64-bit-version-of-windows-2624475>`__.

source: In Windows Settings, click System
de: Klicken Sie in den Windows Einstellung auf "System"

source: Under the System section, click About to view the System type. This is a 64 bit system.
de: Im System Bereich auf „Info“ klicken, um den Typen des System herauszufinden. Dies ist ein 64-bit System.

source: Once you know which version you need, download the Dash Core Installer to your computer from https://www.dash.org/wallets/
de: Wenn Sie wissen, welche Version Sie benötigen, können Sie den Installer auf https://www.dash.org/wallets/ herunterladen.

source: Manually selecting and downloading an installer
de: Die Installationsdatei manuell auswählen und herunterladen

source: Save the file you downloaded to your Downloads folder.
de: Speichern Sie die Datei in Ihrem Download-Ordner.

source: Verifying Dash Core
de: Dash Core verifizieren

source: This step is optional, but recommended to verify the integrity of the file you downloaded. This is done by checking its SHA256 hash against the hash published by the Dash Core development team. To view the published hash, click the **Hash file** button on the wallet download page.
de: Dieser Schritt ist optional, wird aber empfohlen, um die Integrität der heruntergeladenen Dateien zu verifizieren. Hierdurch wird der SHA256 Hash der Datei mit jenem verglichen, der vom Dash Core Entwicklerteam veröffentlicht wurde. Der veröffentlichte Hash wird über den Knopf mit der Aufschrift **Hash File** auf der Wallet-Downloadseite angezeigt.

source: Downloading the Dash Core hash file
de: Lade die Dash Core Hash Datei herunter

source: Once both the Dash Core file and the hash file have downloaded, open the hash file in a text editor or your browser and find the hash value for the Dash Core file you downloaded.
de: Nach dem Herunterladen der Dash Core-Datei und der Hash-Datei muss die Hash-Datei in einem Texteditor oder einem Browser geöffnet und der Hash-Wert der heruntergeladenen Dash Core-Datei ermittelt werden.

source: Viewing the Dash Core hash file
de: Zeige die Dash Core Hash Datei an

source: This hash value should correspond with the hash value of the file you have downloaded to ensure it is authentic and was not corrupted during transit. To do this, open **Command Prompt**, browse to the location where you saved the file, and run the following command, replacing the version with the specific version of the file you downloaded.
de: Der Hashwert sollte mit dem Hashwert der zuvor heruntergeladenen Datei identisch sein, um sicherzustellen, dass diese authentisch ist und nicht während der Übermittlung korrumpiert wurde. Dazu muss man die **Befehlszeile** öffnen, das Verzeichnis aufrufen, in dem die Datei gespeichert wurde, und den nachfolgenden Befehl eingeben, mit dem die Version dieser Datei durch die entsprechende Version der heruntergeladenen Datei ersetzt wird.

source: Generating an SHA256 hash for the downloaded file
de: Generiere einen SHA256 Hash für die heruntergeladene Datei

source: If the hashes match, then you have an authentic copy of Dash Core for Windows.
de: Wenn die Hashes zusammenpassen, handelt es sich um eine authentische Version der Dash Core Wallet für Windows.

source: Running the Dash Core installer
de: Starten Sie den Dash Core Installer

source: Double-click the file to start installing Dash Core.
de: Doppel-Klick auf die Datei um die Installation von Dash Core zu starten.

source: The Dash Core installer in the Downloads folder
de: Der Dash Core Installer im Downloads-Ordner

source: At this point, you may see a warning from Windows SmartScreen that the app is unrecognized. You can safely skip past this warning by clicking **More info**, then **Run anyway**.
de: An dieser Stelle erkennen sie eventuell eine Warnung von Windows SmartScreen, dass die Anwendung unbekannter Herkunft ist. Sie können es sicher überspringen, wenn Sie auf **Weitere Informationen**, dann **Trotzdem ausführen** klicken.

source: Bypassing Windows SmartScreen to run the app. This warning is known as a “false positive”.
de: Windows SmartScreen umgehen, um die App zu starten. Diese Warnung ist bekannt als ein „falsches Positiv“.

source: The installer will then guide you through the installation process.
de: Der Installer wird sie durch den Installationsprozess führen.

source: The Dash Core installer welcome screen
de: Der Dash Core Installer Willkommensscreen

source: Click through the following screens. All settings can be left at their default values unless you have a specific reason to change something.
de: Klicken Sie sich durch die folgende Inhalte. Alle Einstellungen können dabei ihren Standard-Werten belassen werden.

source: Select the installation location
de: Wählen Sie den Installationsort

source: Select the Start menu folder
de: Selektieren Sie das Start Menü

source: Dash Core is being installed
de: Dash Core wird installiert

source: Installation is complete
de: Installation ist komplett

source: Running Dash Core for the first time
de: Starten Sie Dash Core zum ersten Mal

source: Once installation is complete, Dash Core will start up immediately. If it does not, click **Start > Dash Core > Dash Core** to start the application. The first time the program is launched, you will be offered a choice of where you want to store your blockchain and wallet data. Choose a location with enough free space, as the blockchain can reach around 3-4GB in size. It is recommended to use the default data folder if possible.
de: Wenn die Installation vervollständigt wurde sollte Dash Core direkt starten. Falls dies nicht der Fall sein sollte, klicken Sie auf **Start > Dash Core > Dash Core** um die Anwendung zu starten. Beim ersten Launch werden Sie gefragt, wo Sie ihre Blockchain und Wallet Daten speichern möchten. Wählen Sie einen Ort mit genügend Speicherplatz, da der Blockchain bis zu 3-4GB groß werden kann. Es wird empfohlen den Standard Speicherplatz auszuwählen.

source: Choosing the Dash Core data folder
de: Das Dash Core Verzeichnis auswählen

source: Dash Core will then start up. This will take a little longer than usual the first time you run it, since Dash Core needs to generate cryptographic data to secure your wallet.
de: Dash Core wird dann starten. Der Start wird beim ersten Mal etwas länger dauern als sonst, da Dash Core die Kryptographische Daten, die Ihr Wallet sichern, erstellen muss.

source: Starting Dash Core
de: Starte Dash Core

source: Synchronizing Dash Core to the Dash network
de: Dash Core mit dem Dash-Netzwerk synchronisieren

source: Once Dash Core is successfully installed and started, you will see the wallet overview screen. You will notice that the wallet is “out of sync”, and the status bar at the bottom of the window will show the synchronization progress.
de: Sobald Dash Core erfolgreich installiert und gestartet wurde, wird eine Wallet-Übersicht angezeigt. Die Wallet ist zunächst „nicht synchronisiert“ und die Statusleiste am unteren Rand des Fensters zeigt den Synchronisationsfortschritt an.

source: Dash Core begins synchronizing with the Dash network
de: Dash Core startet sich mit dem Dash Netzwerk zu synchronisieren

source: During this process, Dash Core will download a full copy of the Dash blockchain from other nodes to your device. Depending on your internet connection, this may take a long time. If you see the message “No block source available”, check your internet connection. When synchronization is complete, you will see a small blue tick in the lower right corner.
de: Während dieses Prozesses wird Dash Core eine volle Kopie des Dash Blockchains auf Ihr Gerät herunterladen. Die Dauer hängt von der Geschwindigkeit Ihres Internets ab. Wenn Sie die Nachricht "Keine Block Quelle verfügbar" sehen überprüfen Sie Ihre Internet Verbindung. Wenn die Synchronisation vervollständigt wurde können Sie ein kleines blaues Häckchen in der unteren rechten Ecke sehen.

source: Dash Core synchronization is complete
de: Die Dash Core Synchronisation ist vervollständigt

source: You can now begin to use your wallet to send and receive funds.
de: Sie können nun mit der Nutzung des Wallets beginnen um Coins zu empfangen als auch zu senden.

source: Encrypting your Dash wallet
de: Dash-Wallet verschlüsseln

source: After your wallet has synchronized with the Dash network, it is strongly advised to encrypt the wallet with a password or passphrase to prevent unauthorized access. You should use a strong, new password that you have never used somewhere else. Take note of your password and store it somewhere safe or you will be locked out of your wallet and lose access to your funds.
de: Nachdem die Wallet mit dem Dash-Netzwerk synchronisiert wurde, wird sehr stark empfohlen sie mit einem Passwort oder einer Passphrase zu verschlüsseln, damit ein unautorisierter Zugriff verhindert werden kann. Das Passwort sollte sehr sicher und zudem noch niemals verwendet worden sein. Das Passwort sollte niedergeschrieben werden, da bei Vergessen der Zugang zur Wallet und deren Inhalt für immer verloren wäre.

source: To encrypt your wallet, click **Settings > Encrypt Wallet**.
de: Die Wallet wird über **Einstellungen > Wallet verschlüsseln** verschlüsselt.

source: Encrypting the Dash wallet with a password
de: Dash-Wallet mit einem Passwort verschlüsseln

source: You will be asked to enter and verify a password.
de: Sie werden nach der Eingabe und Bestätigung eines Passwords gefragt.

source: Enter a password
de: Geben Sie ein Passwort ein

source: Confirm you want to encrypt your wallet
de: Bestätigen Sie, dass Sie ihr Wallet verschlüsseln wollen

source: When the encryption process is complete, you will see a warning that past backups of your wallet will no longer be usable, and be asked to shut down Dash Core. When you restart Dash Core, you will see a small blue lock in the lower right corner.
de: Wenn der Verschlüsselungsprozess erfolgreich abgeschlossen wurde, erscheint eine Warnung, dass vorherige Backups der Wallet zukünftig nicht mehr verwendet werden können. Nachdem Dash Core heruntergefahren und neugestartet wurde erscheint am unteren rechten Rand des Fensters ein blaues Vorhängeschloss.

source: Fully encrypted and synchronized Dash Core wallet
de: Vollständig verschlüsselte und synchronisierte Dash Core Wallet

source: You can now begin to use your wallet to safely send and receive funds.
de: Sie können nun mit der Nutzung des Wallets, um Dash sicher zu senden und empfangen, beginnen.
