Repository: 12Gitcat/docs
Catalog: locale/*/LC_MESSAGES/wallets/dashcore/privatesend-instantsend.po
Languages: de, fr, pt, ru

source: Using InstantSend and PrivateSend with Dash
de: InstantSend und PrivateSend mit Dash verwenden
fr: Utilisation d'InstantSend et de PrivateSend avec Dash
pt: Usando o InstantSend e o PrivateSend com Dash
ru: Использование функций InstantSend и PrivateSend с Dash

source: dash, core, mobile, wallet, privatesend, instantsend
fr: dash, core, mobile, portefeuille, privatesend, instantsend
pt: dash, core, mobile, carteira, privatesend, instantsend
ru: dash, core, мобильный, кошелёк, privatesend, instantsend

source: This documentation describes how to use Dash Core to send Dash anonymously. PrivateSend, released as DarkSend in RC4 of the DarkCoin client and rebranded to PrivateSend in May 2016, is a trustless method of running a sequence of transactions (known as "mixing") such that an external observer is unable to determine the source of funding when a PrivateSend transaction is created. This gives your Dash the same anonymous properties as cash withdrawn from an ATM, for example. The mixing and denomination process is seamless, automatic, and requires no intervention on the part of the user. The current implementation of PrivateSend in the Dash Core wallet allows any amount of Dash to be mixed for later use in PrivateSend transactions. As of April 2018, PrivateSend is not currently available in other Dash wallets.
pt: Esta documentação descreve como usar o Dash Core para enviar o Dash anonimamente. O PrivateSend, lançado como DarkSend no RC4 do cliente DarkCoin e renomeado para PrivateSend em maio de 2016, é um método infalível de executar uma sequência de transações (conhecida como "Mixing") de tal forma que um observador externo não consegue determinar a origem do financiamento uma transação do PrivateSend é criada. Isso dá ao seu Dash as mesmas propriedades anônimas que o dinheiro retirado de um caixa eletrônico, por exemplo. O processo de mixing e denominação é contínuo, automático e não requer intervenção por parte do usuário. A implementação atual do PrivateSend na carteira do Dash Core permite que qualquer quantidade de Dash seja misturada para uso posterior nas transações do PrivateSend. A partir de abril de 2018, o PrivateSend não está atualmente disponível em outras carteiras do Dash.

source: Knowledge of the exact number of rounds of PrivateSend mixing used in any given PrivateSend transaction has a `quantifiable effect <https://www.dash.org/forum/threads/evaluating-the-privacy-of- privatesend.32472/>`_ on the confidence an adversary may have when attempting to guess the source of a PrivateSend transaction. For this reason, the recommended (and default) number of rounds of PrivateSend mixing is set to four.
de: Das Wissen um die exakte Nummer an Runden, mit denen PrivateSend-Beträge gemischt wurden, führt zu einem `quantifizierbaren Effekt <https://www.dash.org/forum/threads/evaluating-the-privacy-of- privatesend.32472/>`_, der es erleichtert den Ursprung einer PrivateSend-Transaktion zu erkennen. Aus diesem Grund ist die empfohlene (und als Standard eingestellte) Nummer an PrivateSend-Mischrunden auf vier festgesetzt, kann aber verändert werden.
fr: La connaissance du nombre exact de cycles de mélange PrivateSend utilisés dans une transaction PrivateSend donnée a un `effet mesurable <https://www.dash.org/forum/threads/evaluating-the-privacy-of- privatesend.32472/>`_ sur la probabilité qu'a un adversaire de deviner la source d'une transaction PrivateSend. Pour cette raison, le nombre de cycles de mélange PrivateSend recommandé (et celui par défaut) est fixé à quatre.
pt: O conhecimento do número exato de rodadas de mistura do PrivateSend usado em qualquer transação do PrivateSend tem um `efeito quantificável <https://www.dash.org/forum/threads/evaluating-the-privacy-of- privatesend.32472/>`_ sobre a confiança que um adversário pode ter ao tentar adivinhar a origem de uma transação do PrivateSend. Por esse motivo, o número recomendado (e padrão) de rodadas de mistura do PrivateSend é definido como quatro.
ru: Знание точного количества раундов смешивания PrivateSend, используемого в любой представленной транзакции PrivateSend, имеет `количественный эффект <https://www.dash.org/forum/threads/evaluating-the-privacy-of- privatesend.32472/>`_ основанный на уверенности, которую может иметь злоумышленник при попытке угадать источник транзакции PrivateSend. По этой причине рекомендуемое (и установленное по умолчанию) количество раундов смешивания PrivateSend равно четырем.

source: You can read more about PrivateSend theory and processes :ref:`here <privatesend>`.
de: Mehr zur Theorie hinter PrivateSend und dem exakten Verfahren gibt es :ref:`hier <privatesend>`.
fr: Vous pouvez en savoir plus sur le concept et les procédures PrivateSend :ref:`ici <privatesend>`.
pt: Você pode ler mais sobre teoria e processos do PrivateSend :ref:`aqui <privatesend>`.
ru: Подробнее теоретическую часть и о процессах функции PrivateSend вы можете почитать :ref:`здесь <privatesend>`.

source: Configuration
de: Konfiguration
pt: Configuração
ru: Конфигурация

source: Open your Dash Core wallet, go to **Settings** and select **Options**. Go to the **Wallet** tab.
de: Dash Core Wallet öffnen und unter **Einstellungen** den Punkt **Konfiguration** auswählen. Die entsprechenden Einstellungen befinden sich in der Registerkarte **Wallet**.
fr: Ouvrez votre portefeuille logiciel Dash Core, allez à **Réglages** et choisissez **Options**. Allez sur l'onglet **Portefeuille**.
pt: Abra sua carteira do Dash Core, vá para **Definições** e selecione **Opções**. Vá para guia **Carteira**.
ru: Откройте ваш кошелёк Dash Core, нажмите **Настройки** и выберите **Параметры**. Перейдите на вкладку **Кошелёк**.

source: Next to **PrivateSend rounds to use**, enter a value between 1-8. Each round of PrivateSend performs one denominated fund mixing transaction. Higher numbers of rounds increase your overall level of anonymity while decreasing the chance of detection via node collusion. 8 is the highest number of rounds currently available.
pt: Ao lado de **Rodadas do PrivateSend para usar**, insira um valor entre 1 e 8. Cada rodada de PrivateSend realiza uma transação de mistura de fundos denominada. Um número maior de rodadas aumenta seu nível de anonimato enquanto diminui a chance de detecção de nós. 8 é o maior número de rodadas atualmente disponíveis.

source: NOTE: To prevent system abuse, an average of one in ten rounds of masternode mixing incurs a fee of .001 DASH.
pt: NOTA: Para evitar o abuso do sistema, uma média de uma em dez rodadas de mistura de masternode requer em uma taxa de 0,001 DASH.

source: Enter a target value for **Amount of Dash to keep anonymized**. This value provides a lower boundary on the final amount of funds to be anonymized. Depending on how the client splits your wallet balance, you may end up with denominated inputs whose sum total is greater than the target amount. In this case the client will use all existing denominated inputs in the PrivateSend process. The final anonymized amount may be higher than your target, but should be close.
pt: Insira um valor de destino para **Quantidade de Dash para manter anonimizada**. Esse valor fornece um limite inferior para o valor final dos fundos a serem anonimizados. Dependendo de como o cliente divide seu saldo de carteira, você pode acabar com entradas denominadas cujo total é maior que o valor desejado. Nesse caso, o cliente usará todas as entradas denominadas existentes no processo PrivateSend. O valor final anonimizado pode ser maior que o seu alvo, mas deve estar próximo.

source: Click **OK** to save settings.
de: Über **OK** werden die Einstellungen gespeichert.
fr: Cliquez sur **OK** pour enregistrer les réglages.
pt: Clique em **OK** para salvar as configurações.
ru: Нажмите **OK** для сохранения настроек.

source: PrivateSend is disabled by default when you open the wallet. It will only start after you set the number of rounds and number of Dash to mix under settings and click **Start Mixing** on the **Overview** tab of your wallet.
de: PrivateSend ist standardmäßig deaktiviert. Es wird nur aktiviert wenn nach dem Setzen der Runden und des Zielbetrags auch der Knopf mit der Aufschrift **Starte Mixen** gedrückt wurde, der sich unter der Registerkarte **Übersicht** befindet.
fr: La fonction PrivateSend est désactivée par défaut quand vous ouvrez votre portefeuille. Elle ne démarrera que lorsque vous aurez décidé, dans les Réglages, du nombre de cycles de mélange et du montant à mélanger, et que vous aurez cliqué sur **Commencer le mélange** dans l'onglet **Vue d'ensemble** de votre portefeuille.
pt: O PrivateSend é desativado por padrão quando você abre a carteira. Ele só será iniciado depois que você definir o número de rodadas e o número de Dashs para misturar nas configurações e clicar em **Iniciar mixagem** na guia **Visão geral** da sua carteira.
ru: При открытии кошелька функция PrivateSend по умолчанию отключена. Она запустится только после того, как вы зададите количество раундов и сумму DASH для смешивания в настройках и нажмёте кнопку **Начать перемешивание** на вкладке **Обзор** кошелька.

source: Starting Mixing
de: Mischen starten
fr: Commencer le mélange
pt: Iniciar Mixing
ru: Начало перемешивания

source: The PrivateSend process is initiated by clicking the **Start Mixing** button on the **Overview** tab of the Dash Core wallet. Mixing is possible once the following conditions have been met:
de: Der PrivateSend-Prozess wird gestartet, wenn der Knopf mit der Aufschrift **Starte Mixen** gedrückt wurde, der sich unter der Registerkarte **Übersicht** der Dash Core Wallet befindet. Mischen ist nur erfolgreich, wenn die folgenden Bedingungen erfüllt sind:
fr: La procédure PrivateSend est démarrée en cliquant sur le bouton **Commencer le mélange** dans l'onglet **Vue d'ensemble** du portefeuille logiciel Dash Core. Le mélange est possible dès que les conditions suivantes sont réunies :
pt: O processo PrivateSend é iniciado clicando no botão **Iniciar mixagem** na guia **Visão geral** da carteira do Dash Core. A mixagem é possível depois que as seguintes condições forem atendidas:
ru: Процесс PrivateSend начинается нажатием на кнопку **Начать перемешивание** на вкладке **Обзор** кошелька Dash Core. Смешивание становится возможным, как только будут выполнены следующие условия:

source: The wallet contains sufficient non-anonymized funds to create the minimum required denominated values
pt: A carteira contém fundos não anonimos suficientes para criar os valores mínimos obrigatórios

source: The user has not disabled PrivateSend in the Options dialog
de: Der Nutzer hat PrivateSend nicht über den Konfigurationsdialog deaktiviert
fr: L'utilisateur n'a pas désactivé la fonction PrivateSend dans le dialogue Options
pt: O usuário não desativou o PrivateSend na caixa de diálogo Opções
ru: Функция PrivateSend в диалоговом окне "Параметры" не отключена пользователем

source: The target value for anonymized Funds in the Options dialog is greater than zero
pt: O valor alvo para fundos anonimizados na caixa de diálogo Opções é maior que zero

source: If your wallet is encrypted (highly recommended), you will be asked to enter your wallet passphrase. Enable the **Only for mixing via PrivateSend** checkbox to unlock the wallet for mixing only.
de: Wenn die Wallet verschlüsselt wurde (dies wird sehr eindringlich empfohlen), muss das Wallet-Passwort vor dem Mischen angegeben werden. Über **Wallet für den Mischvorgang entsperren** kann ausgewählt werden, dass die Wallet nur zum Mischen entsperrt wird.
fr: Si votre portefeuille est chiffré (ce qui est chaudement recommandé), il vous sera demandé de saisir sa phrase de passe. Cochez la case **Seulement pour le mélange PrivateSend** si vous souhaitez déverrouiller le portefeuille uniquement pour le mélange.
pt: Se a sua carteira estiver criptografada (altamente recomendada), você será solicitado a digitar sua senha da carteira. Ative a caixa de seleção **Somente para mixagem via PrivateSend** para desbloquear a carteira somente para mixagem.
ru: Если кошелёк зашифрован (что настоятельно рекомендуется), то вам будет предложено ввести фразу пароль вашего кошелька. Установите галочку возле пункта **Разблокировать кошелёк только для перемешивания PrivateSend**, чтобы разблокировать кошелёк только для процесса перемешивания.

source: Entering a password for PrivateSend mixing only
de: Ein Passwort nur zum Mischen für PrivateSend eingeben
fr: Saisie d'un mot de passe uniquement pour le mélange PrivateSend
pt: Digitar uma senha somente para o PrivateSend
ru: Ввод пароля только для активации смешивания для функции PrivateSend

source: This will unlock your wallet, and the PrivateSend mixing process will begin. The wallet will remain unlocked until PrivateSend mixing is complete, at which point it will be locked automatically.
de: Dies wird die Wallet entsperren und den PrivateSend-Mischvorgang starten. Die Wallet bleibt entsperrt, bis der Mischvorgang beendet wurde und sperrt sich dann automatisch selbst.
fr: Cela déverrouillera votre portefeuille, et le processus de mélange PrivateSend démarrera. Le portefeuille restera déverrouillé jusqu'à ce que le mélange PrivateSend soit terminé, puis il sera automatiquement verrouillé.
pt: Isso desbloqueará sua carteira e o processo de mixagem do PrivateSend será iniciado. A carteira permanecerá desbloqueada até a conclusão da mixagem do PrivateSend, quando será bloqueada automaticamente.
ru: После этого ваш кошелёк будет разблокирован, и начнётся процесс смешивания PrivateSend. Кошелёк останется разблокированным до тех пор, пока смешивание PrivateSend не будет завершено, после чего он будет заблокирован автоматически.

source: PrivateSend interface after clicking the **Start Mixing** button. Note the **Status** is **Enabled**.
de: PrivateSend-Schnittstelle nach dem Drücken des Knopfes mit der Aufschrift **Starte Mixen**. Als **Status** wird **Aktiviert** angezeigt.
fr: Interface PrivateSend après avoir cliqué sur le bouton **Commencer le mélange**. À noter, l'**État** est **Activé**.
pt: Interface do PrivateSend depois de clicar no botão **Iniciar mixagem**. Observe que o **status** é **ativado**.
ru: Интерфейс PrivateSend после нажатия кнопки **Начать перемешивание**. Обратите внимание, что **Статус** должен быть **Включён**.

source: PrivateSend will begin creating transactions and your PrivateSend balance will gradually increase. This process can take some time, so be patient. You can monitor the process in more detail as described in the following section.
de: PrivateSend wird damit beginnen, Transaktionen zu schaffen und das PrivateSend-Guthaben wird kontinuierlich wachsen. Dieser Vorgang kann einige Zeit in Anspruch nehmen. Im folgenden Abschnitt wird erklärt, wie dieser Vorgang genauer beobachtet werden kann.
fr: PrivateSend commencera à créer des transactions et votre solde PrivateSend augmentera progressivement. Ce processus peut prendre un certain temps, alors soyez patient. Vous pouvez suivre ce processus en détail, comme l'explique la section suivante.
pt: O PrivateSend começará a criar transações e seu saldo do PrivateSend aumentará gradualmente. Esse processo pode levar algum tempo, então seja paciente. Você pode monitorar o processo com mais detalhes, conforme descrito na seção a seguir.
ru: PrivateSend начнёт создавать транзакции, и ваш баланс PrivateSend будет постепенно увеличиваться. Этот процесс может занять некоторое время, поэтому проявите терпение. Вы можете отслеживать подробности этого процесса, как описано в следующем разделе

source: Any of the following actions will interrupt the mixing process. Because the transactions are atomic (they either take place completely, or do not take place at all), it should be possible to safely interrupt PrivateSend mixing at any time.
de: Jede der folgenden Aktionen wird den Mischvorgang unterbrechen. Da die Transaktionen atomar sind (sie finden entweder ganz statt der gar nicht), ist es sicher PrivateSend zu jedem Zeitpunkt zu unterbrechen.
fr: N'importe laquelle des actions suivantes interrompra le processus de mélange. Comme les transactions sont atomiques (elles ont entièrement lieu, ou bien n'ont pas lieu du tout), il doit être possible d'interrompre le mélange PrivateSend à tout moment, en toute sécurité.
pt: Qualquer uma das seguintes ações interromperá o processo de mixagem. Como as transações são atômicas (elas ocorrem completamente ou não ocorrem), deve ser possível interromper com segurança a mixagem do PrivateSend a qualquer momento.
ru: Любое из следующих действий приведет к прерыванию процесса смешивания. Поскольку транзакции являются неделимыми (они либо выполняются полностью, либо не выполняются вообще), в любом случае должно быть возможно безопасное прерывание смешивания PrivateSend.

source: Clicking the Stop Mixing button on the Overview tab
de: Den Knopf mit der Aufschrift Stop Mixing in der Übersicht-Registerkarte drücken
fr: Cliquer sur le bouton Arrêter le mélange, dans l'onglet Vue d'ensemble
pt: Clicando no botão Parar Mixagem na guia Visão Geral
ru: Нажатие кнопки "Остановить перемешивание" на вкладке "Обзор"

source: Closing the client before PrivateSend mixing is completed
de: Den Client schließen, bevor der Mischvorgang beendet wurde
fr: Fermer le logiciel avant que le mélange PrivateSend soit terminé
pt: Fechar o cliente antes da conclusão da mixagem do PrivateSend
ru: Закрытие программы до того, как смешивание PrivateSend завершено

source: Sending PrivateSend funds from the wallet before PrivateSend rounds are completed
de: PrivateSend-Guthaben aus einer Wallet verschicken, bevor die PrivateSend-Runden beendet wurden
fr: Envoyer des fonds PrivateSend depuis le portefeuille avant que les cycles PrivateSend soient terminés
pt: Enviando fundos do PrivateSend da carteira antes que as rodadas do PrivateSend sejam concluídas
ru: Отправка средств PrivateSend из кошелька до того, как раунды PrivateSend завершены

source: Disabling PrivateSend before the process is complete
de: PrivateSend deaktivieren, bevor der Prozess beendet wurde
fr: Désactiver PrivateSend avant que le processus soit terminé
pt: Desativando o PrivateSend antes que o processo seja concluído
ru: Отключение функции PrivateSend до завершения процесса

source: Monitoring Mixing
de: Mischen beobachten
fr: Suivi du mélange
pt: Monitorando Mixagem
ru: Наблюдение за смешиванием

source: If you want to monitor PrivateSend in more detail, you need to enable some advanced features of the wallet. Go to **Settings**, select **Options** and go to the **Wallet** tab. Check the boxes next to the **Enable coin control features** and **Enable advanced PrivateSend interface** options.
de: Um PrivateSend mit mehr Details zu beobachten, müssen erweiterte Funktionen der Wallet aktiviert werden. Unter **Einstellungen** den Punkt **Konfiguration** auswählen und die entsprechenden Einstellungen in der Registerkarte **Wallet** auswählen. Bei **"Coin Control"-Funktionen aktivieren** und **Erweiterte PrivateSend Schnittstelle anzeigen** muss ein Haken gesetzt werden.
fr: Si vous souhaitez suivre le processus PrivateSend en détail, vous devez activer certaines fonctions avancées du portefeuille. Allez dans **Réglages**, choisissez **Options** puis allez sur l'onglet **Portefeuille**. Cochez les cases **Activer les fonctions de contrôle des pièces** et **Activer l'interface avancée PrivateSend**.
pt: Se você quiser monitorar o PrivateSend com mais detalhes, é necessário ativar alguns recursos avançados da carteira. Vá para **Definições**, selecione **Opções** e vá para a guia **Carteira**. Marque as caixas ao lado das opções **Ativar recursos de controle de moeda** e **Ativar interface avançada de PrivateSend**.
ru: Если вы хотите наблюдать за деталями процесса PrivateSend, вам необходимо активировать некоторые дополнительные функции кошелька. Отправляйтесь в **Настройки**, выберите **Параметры** и перейдите на вкладку **Кошелёк**. Проверьте наличие галочек возле пунктов **Включить функции контроля монет** и **Включить расширенный интерфейс PrivateSend**.

source: Enabling advanced options for PrivateSend in the Dash Core wallet settings
de: Erweiterte PrivateSend-Funktionen in den Dash Core Wallet-Einstellungen aktivieren
fr: Activation des options avancées PrivateSend dans les réglages du logiciel Dash Core
pt: Ativando opções avançadas para PrivateSend nas configurações da carteira do Dash Core
ru: Активация расширенных опций для функции PrivateSend в настройках кошелька Dash Core

source: This will allow you to monitor progress and see which individual operations PrivateSend is carrying out in the background.
de: Hierdurch können der Fortschritt und einzelne PrivateSend-Operationen, die im Hintergrund stattfinden, beobachtet werden.
fr: Cela vous permettra de suivre la progression et de voir quelles opérations individuelles sont menées par PrivateSend en arrière-plan.
pt: Isso permitirá que você monitore o progresso e veja quais operações individuais o PrivateSend está executando em segundo plano.
ru: Это позволит вам отслеживать процесс и видеть, какие отдельные операции PrivateSend выполняются в фоновом режиме.

source: Monitoring PrivateSend progress
de: PrivateSend Fortschritt beobachten
fr: Suivi de la progression de PrivateSend
pt: Monitorando o progresso do PrivateSend
ru: Отслеживание процесса PrivateSend

source: Since PrivateSend mixing creates a lot of new address keys to send and receive the anonymized denominations, you may receive a warning when the number of remaining keys runs low. This is nothing to be worried about, since the wallet will simply create more keys as necessary. However, these keys will not exist in any previous backups of your wallet. For this reason, it is important to backup your wallet again after mixing is complete.
pt: Como a mixagem do PrivateSend cria muitas novas chaves de endereço para enviar e receber as denominações anônimas, você pode receber um aviso quando o número de chaves restantes estiver baixo. Isso não é nada para se preocupar, já que a carteira simplesmente criará mais chaves conforme necessário. No entanto, essas chaves não existirão em nenhum backup anterior de sua carteira. Por esse motivo, é importante fazer backup de sua carteira novamente após a conclusão da mixagem.

source: You can also monitor PrivateSend progress by viewing the transactions created by the mixing process on the **Transactions** tab.
de: Der PrivateSend-Fortschritt wird auch ersichtlich, wenn die Transaktionen, die wegen des Mischvorgangs stattfinden, in der **Transaktionen** Registerkarte beobachtet werden.
fr: Vous pouvez aussi suivre la progression de PrivateSend en consultant les transactions créées par le processus de mélange, dans l'onglet **Transactions**.
pt: Você também pode monitorar o progresso do PrivateSend visualizando as transações criadas pelo processo de mixagem na guia **Transações**.
ru: Также вы можете следить за процессом выполнения функции PrivateSend просматривая транзакции, созданные процессом перемешивания на вкладке **Транзакции**.

source: Transactions created by PrivateSend on the Transactions tab
de: Transaktionen, die wegen PrivateSend in der Transaktionen Registerkarte beobachtet werden können
fr: Transactions créées par PrivateSend, dans l'onglet Transactions
pt: Transações criadas pelo PrivateSend na guia Transações
ru: Транзакции, созданые PrivateSend на вкладке "Транзакции"
