Repository: 12Gitcat/docs
Catalog: locale/*/LC_MESSAGES/wallets/dashcore/privatesend-instantsend.po
Languages: de, fr, pt, ru

source: You can also use the coin control feature to view which addresses hold mixed denominations ready to be used for PrivateSend transactions. Go to the **Send** tab of your wallet and click **Inputs** to view the possible input addresses for your transactions. You can see how each address holds given denominations of mixed Dash, and how many rounds of mixing have been completed. This is to ensure that an efficient combination of addresses can be used as inputs in PrivateSend transactions without too much change, since amount in a PrivateSend transaction must be rounded up to completely spend all inputs. The current minimum balance for an input used in a PrivateSend transaction is 0.00100010 DASH.
de: Über die Funktion Coin Control ist es möglich zu sehen, welche Adressen gemischte Denominationen enthalten und für PrivateSend Transaktionen verwendet werden können. In der Registerkarte **Überweisen** kann Coin Control über das Feld **Inputs** angewendet werden. Hier kann gesehen werden, welche Adressen Denominationen beinhalten und wie oft diese gemischt wurden. Hierdurch können gezielt Adressen verwendet werden, durch die nicht zu viel Wechselgeld entsteht, da PrivateSend aufrunden muss, damit ein Input vollständig ausgegeben wird. Das momentan nötige Guthaben, um eine PrivateSend-Transaktion durchführen zu können, liegt bei 0.00100010 Dash.
fr: Vous pouvez aussi utiliser la fonction de contrôle des pièces pour voir quelles adresses contiennent des coupures mélangées, prêtes à être utilisées dans des transactions PrivateSend. Allez sur l'onglet **Envoyer** de votre portefeuille et cliquez sur le bouton **Entrées** pour voir les adresses d'entrée possibles pour vos transactions. Vous pouvez savoir combien chaque adresse contient de coupures mélangées Dash, et combien de cycles de mélange y ont été appliqués. Ceci permet d'assurer qu'une combinaison efficace d'adresses peut être utilisée comme entrées dans les transactions PrivateSend sans générer trop de monnaie rendue, puisque le montant d'une transaction PrivateSend doit être arrondi à la coupure supérieure pour dépenser l'intégralité des entrées. Le solde minimum actuel pour une entrée utilisée dans une transaction PrivateSend est de 0,00100010 dash.
ru: Вы также можете использовать функцию контроля монет, чтобы посмотреть, какие адреса содержат смешанные номиналы, готовые для использования в транзакциях PrivateSend. Перейдите на вкладку **Отправить** вашего кошелька и нажмите **Входы**, чтобы просмотреть возможные входные адреса ваших транзакций. Вы увидите, что на каждом адресе содержатся данные о номиналах смешанных DASH и информация о том, сколько раундов смешивания завершено. Эта эффективная комбинация адресов затем используется в качестве входных данных в транзакциях PrivateSend без особых изменений, так как сумма в транзакции PrivateSend должна быть округлена, чтобы полностью использовать все входы. Текущий минимальный баланс для ввода, используемого в транзакции PrivateSend, составляет 0.00100010 DASH.

source: You can only use PrivateSend for payments once you have mixed enough Dash to make up the amount you are trying to send. Because the mixing process takes time, it must be done in advance before you create the send transaction. A PrivateSend transaction is effectively the same as any other transaction on the blockchain, but it draws only from input addresses where the denomination has previously been mixed to ensure privacy of funds. Because several input addresses are usually required to make up the amount you are trying to send, a PrivateSend transaction will usually take up more space (in kilobytes) on the blockchain, and therefore will be charged a slightly higher fee.
fr: Vous pouvez utiliser PrivateSend pour les paiements uniquement lorsque vous disposez d'assez de dashs mélangés pour constituer le montant que vous souhaitez envoyer. Comme le processus de mélange prend du temps, il doit être exécuté à l'avance, avant de créer la transaction d'envoi. Une transaction PrivateSend est en pratique identique à toute autre transaction sur la blockchain, mais elle n'utilise que des adresses d'entrée dont les coupures ont été précédemment mélangées, afin de garantir la confidentialité des fonds. Puisque plusieurs adresses d'entrée sont en général indispensables pour constituer le montant que vous souhaitez envoyer, une transaction PrivateSend consommera en général plus d'espace (en kilo-octets) sur la blockchain, et fera donc l'objet de frais de transaction légèrement plus élevés.

source: To send a payment using PrivateSend, go to the **Send** tab of the Dash Core wallet and enable the **PrivateSend** option. The balance displayed will change to show your PrivateSend balance instead of the total balance. You can then enter the **Pay To** address, **Label**, **Amount** and click **Send** as usual. Your payment will be rounded up to completely spend the lowest possible denomination of mixed balance available (currently to the nearest 0.001 DASH). You will be prompted to enter your password and receive a detailed breakdown of the fee structure for PrivateSend before sending.
de: Um eine Zahlung per PrivateSend zu versenden muss über die Registerkarte **Überweisen** die Option **PrivateSend** aktiviert werden. Das angezeigte Guthaben wird nun nur die bereits gemischten Beträge anzeigen. **Empfänger**, **Bezeichnung** und **Betrag** werden wie üblich eingetragen und zum Versenden wird ebenfalls der Knopf mit der Aufschrift **Überweisen** verwendet. Die Zahlung wird aufgerundet und es ist notwendig auf die geringste Denomination (momentan 0.001 Dash) aufzurunden. Zur Bestätigung muss das Passwort eingegeben werden, bevor eine vollständige Analyse der Transaktionskosten angezeigt werden, mit denen die PrivateSend-Transaktion durchgeführt werden kann.
fr: Pour envoyer un paiement avec PrivateSend, allez sur l'onglet **Envoyer** du portefeuille logiciel Dash Core et activez l'option **PrivateSend**. Le solde affiché sera modifié, il affichera le solde PrivateSend au lieu de votre solde total. Vous pouvez ensuite saisir l'adresse dans le champ **Payer à**, l'**Étiquette**, le **Montant**, et cliquer sur le bouton **Envoyer** comme d'habitude. Votre paiement sera légèrement arrondi pour dépenser complètement la plus petite coupure possible de fonds mélangés disponibles (actuellement, à hauteur de 0,001 dash). Il vous sera demandé de saisir votre mot de passe et il vous sera affiché un détail complet des frais PrivateSend, avant l'envoi.
ru: Чтобы отправить платёж с использованием функции PrivateSend, отправляйтесь на вкладку **Отправить** кошелька Dash Core и активируйте опцию **PrivateSend**. Отображаемый баланс изменится и вместо общего баланса отобразится баланс PrivateSend. Затем в поле **Получатель** вы можете ввести адрес, а также добавить информацию в полях **Метка** и **Количество** и щёлкнуть **Отправить**, как это обычно делается. Ваш платёж будет округлён, чтобы полностью задействовать минимально возможное номинальное значение смешанного баланса (в настоящее время до ближайших 0,001 DASH). Вам будет предложено ввести ваш пароль и получить подробную разбивку структуры комиссии для PrivateSend перед отправкой.

source: InstantSend functions by setting a flag on the transaction, causing deterministic selection of a quorum of 10 masternodes for each input spent in an InstantSend transaction. The masternodes examine the input, and if a majority determines it has at least six confirmations, they then accept the transaction. The input is then locked until the transaction has been confirmed in six mined blocks, at which point the output can be used as an input in another InstantSend transaction. This differs from inputs used in normal transactions, which can be spent after just one confirmation regardless of whether the Dash was received using InstantSend or not. A higher fee will be charged for InstantSend transactions with more than four inputs, according to the :ref:`fee schedule <fees>`. Note that the receiving wallet must also be aware of InstantSend in order to be able to immediately continue with the transaction or display an appropriate notification that the transaction should be considered locked. If the receiving wallet is not aware of InstantSend, it will simply appear as a normal transaction and you will need to wait for standard block confirmations.
de: InstantSend wird dadurch gewährleistet, dass es ein Quorum aus 10 Masternodes deterministisch festsetzt, damit jedes Quorum den Input einer InstantSend-Transaktion absichert. Die Masternodes untersuchen den Input und wenn eine Mehrheit diesen bestätigt, wird die Transaktion akzeptiert. Der Input wird nun von den Masternodes unter Verschluß gehalten, bis dieser durch 6 Blöcke bestätigt wurde, wodurch er erneut für eine InstantSend-Transaktion freigegeben wird. InstantSend unterscheidet sich dadurch von normalen Transaktionen, die nach einer Block-Bestätigung bereits weiterversandt werden können, selbst wenn sie aus einer InstantSend-Transaktion stammen. Laut der :ref:`Gebührentafel <fees>` wird für InstantSend-Transaktionen mit mehr als 4 Inputs eine höhere Gebühr erhoben. Wichtig ist, dass die empfangende Wallet InstantSend erkennt, da sie die Transaktion sonst wie eine normale Transaktion behandeln und nicht als sofort bestätigt ansehen würde. In diesem Fall müsste der Nutzer abwarten, bis die normalen Bestätigungen durch die Blockchain stattfinden.
fr: InstantSend fonctionne en associant un signal à la transaction, entraînant la sélection déterministe d'un quorum de 10 masternodes pour chaque entrée dépensée dans la transaction InstantSend. Les masternodes inspectent l'entrée, et si une majorité détermine qu'elle a au moins six confirmations, ils acceptent la transaction. L'entrée est alors verrouillée jusqu'à ce que la transaction ait été confirmée dans six blocs minés, à partir de quoi la sortie peut être utilisée comme entrée dans une autre transaction InstantSend. Cela est différent des entrées utilisées dans des transactions normales, qui peuvent être dépensées après une seule confirmation, indépendamment que les dashs aient été reçus via InstantSend ou pas. Des frais de transaction plus élevés sont appliqués pour les transactions InstantSend, selon le :ref:`barème des frais <fees>`. À noter que le portefeuille destinataire doit aussi être compatible InstantSend pour pouvoir continuer le traitement de la transaction, ou afficher une notification appropriée selon laquelle la transaction peut être considérée verrouillée. Si le portefeuille destinataire n'est pas compatible InstantSend, la transaction y apparaîtra comme normale, et vous devrez attendre les confirmations de bloc normales.
ru: Устанавливая соответствующую галочку на транзакцию, функция InstantSend инициирует детерминированный выбор кворума из 10 мастернод для каждого входа, задействованного в InstantSend транзакции. Мастерноды проверяют вход, и если большинство определяет, что у него есть как минимум шесть подтверждений, то они принимают транзакцию. Затем вход фиксируется до тех пор, пока транзакция не будет подтверждена в шести добытых блоках, после чего этот выход может использоваться в качестве входа в другой транзакции InstantSend. Эти входы отличаются от входов, используемых в обычных транзакциях, деньги в которых могут быть потрачены после одного подтверждения независимо от того, получены ли DASH с помощью InstantSend или нет. Повышенная комиссия будет взиматься за транзакции InstantSend, согласно :ref:`таблице комиссий <fees>`. Обратите внимание, что кошелёк, получающий средства должен также быть уведомлён об InstantSend для возможности немедленно продолжить транзакцию или отобразить соответствующее уведомление о том, что транзакция должна считаться зафиксированной. Если получающий кошелёк не уведомлён об InstantSend, транзакция отобразится как обычная, и вам нужно будет ждать стандартных подтверждений.

source: PrivateSend
ru: Функция PrivateSend
