Repository: 12Gitcat/docs
Catalog: locale/*/LC_MESSAGES/wallets/dashcore/privatesend-instantsend.po
Languages: de, fr, pt, ru

source: The following table describes the PrivateSend-related transactions displayed in the Type column of the **Transactions** tab:
de: Die folgende Tabelle beschreibt die PrivateSend-Transaktionstypen, die in der Typ-Spalte der **Transaktionen** Registerkarte aufgeführt werden:
fr: Le tableau suivant décrit les transactions relatives à PrivateSend, telles qu'affichées dans la colonne Type de l'onglet **Transactions** :
pt: A tabela a seguir descreve as transações relacionadas ao PrivateSend exibidas na coluna Tipo da guia **Transações**:
ru: Следующая таблица описывает относящиеся к функции PrivateSend транзакции, которые отображены в столбце "Тип" вкладки **Транзакции**:

source: PrivateSend Transaction Type
de: PrivateSend Transaktions-Typ
fr: Type de transaction PrivateSend
pt: Tipo de transação PrivateSend
ru: Тип транзакции PrivateSend

source: Transaction Description
de: Transaktionsbeschreibung
fr: Description de la transaction
pt: Descrição da transação
ru: Описание транзакции

source: PrivateSend Make Collateral Inputs (*Mixing*)
de: PrivateSend Sicherheits-Eingänge machen (*Mixing*)
fr: Création d'entrées de caution PrivateSend (*Mélange*)
pt: PrivateSend Faça Entradas Colaterais (*Mixing*)
ru: PrivateSend создаёт входы для обеспечительных монет (*Перемешивание*)

source: Wallet funds were moved to collateral inputs that will be used to make collateral payments. This is done to minimize traceability of collaterals.
de: Wallet-Guthaben wurde zu den Kollateral-Inputs bewegt, die dazu verwendet werden Kollateral-Zahlungen durchzuführen. Dies geschieht, damit der Ursprung des Kollaterals verschleiert wird.
fr: Les fonds du portefeuille ont été déplacés dans des entrées de caution qui seront utilisées pour créer des paiements de caution. Cela est opéré pour minimiser le traçabilité des cautions.
pt: Os fundos da carteira foram transferidos para entradas colaterais que serão utilizadas para efectuar pagamentos colaterais. Isso é feito para minimizar a rastreabilidade das garantias.
ru: Средства из кошелька перемещены на входы обеспечения, которые будут использованы для совершения платежей по обеспечению. Это сделано для минимизации отслеживаемости залогов.

source: PrivateSend Create Denominations (*Mixing*)
de: PrivateSend Stückelung erzeugen (*Mixing*)
fr: Création de coupures PrivateSend (*Mélange*)
pt: PrivateSend Cria Denominações (*Mixing*)
ru: PrivateSend создаёт номиналы (*Перемешивание*)

source: Wallet funds were broken into PrivateSend denominations (Step 1 :ref:`here<privatesend>`)
pt: Os fundos da carteira foram divididos em denominações do PrivateSend (Etapa 1 :ref:`aqui <privatesend>`)

source: PrivateSend Denominate (*Mixing*)
de: PrivateSend Stückelung (*Mixing*)
fr: Coupure PrivateSend (*Mélange*)
pt: PrivateSend Denominação (*Mixing*)
ru: Создание номиналов PrivateSend (*Перемешивание*)

source: A transaction was sent to a masternode in order to participate in a mixing session (Step 3 :ref:`here<privatesend>`)
pt: Uma transação foi enviada para um masternode para participar de uma sessão de mixagem (Passo 3 :ref: `aqui<privatesend>`)

source: PrivateSend Collateral Payment (*Mixing*)
de: PrivateSend Sicherheits-Zahlung (*Mixing*)
fr: Paiement de caution PrivateSend (*Mélange*)
pt: Pagamento de garantia por parte do PrivateSend (*Mixing*)
ru: Платёж PrivateSend за создание обеспечительных монет (*Перемешивание*)

source: The mixing session collateral was claimed. This fee is charged in ~10% of mixing sessions to prevent spam attacks.
de: Das Kollateral der Mischrunde wurde beansprucht. Diese Gebühr wird in ~10% der Mischrunden erhoben, damit Spam-Angriffe verhindert werden können.
fr: La caution de session de mélange a été perçue. Ces frais sont imputés dans environ 10% des sessions de mélange pour empêcher les attaques spam.
pt: A garantia da sessão de mistura foi reivindicada. Esta taxa é cobrada em ~10% das sessões de mixagem para evitar ataques de spam.
ru: Выполнен запрос на создание обеспечительных монет для смешивания. В ~10% случаев для сеансов смешивания за это взимается комиссия для предотвращения спам-атак.

source: PrivateSend (*Spending*)
de: PrivateSend (*Zahlung*)
fr: PrivateSend (*Dépense*)
pt: PrivateSend (*Gastos*)
ru: PrivateSend (*Траты*)

source: Mixed funds were used to send a payment to someone. Note: Unlike the previous 4 transaction types, this is not a mixing process transaction.
de: Gemischtes Guthaben wurde dazu verwendet eine Zahlung an jemanden zu versenden. Hinweis: Anders als bei den bisherigen 4 Transaktions-Typen, handelt es sich hierbei nicht um einen Teil des Mischvorgangs.
fr: Des fonds mélangés ont été utilisés pour envoyer un paiement à quelqu'un. À noter : au contraire des 4 précédents types de transaction, il ne s'agit pas d'une transaction propre au processus de mélange.
pt: Fundos mistos foram usados para enviar um pagamento para alguém. Nota: Ao contrário dos 4 tipos de transação anteriores, esta não é uma transação do processo de mixagem.
ru: Перемешанные средства были использованы для отправки другому пользователю. Примечание: в отличие от 4-х предыдущих типов транзакций, в этой транзакции не применялся процесс смешивания.

source: You can also use the coin control feature to view which addresses hold mixed denominations ready to be used for PrivateSend transactions. Go to the **Send** tab of your wallet and click **Inputs** to view the possible input addresses for your transactions. You can see how each address holds given denominations of mixed Dash, and how many rounds of mixing have been completed. This is to ensure that an efficient combination of addresses can be used as inputs in PrivateSend transactions without too much change, since amount in a PrivateSend transaction must be rounded up to completely spend all inputs. The current minimum balance for an input used in a PrivateSend transaction is 0.01000010 DASH.
pt: Você também pode usar o recurso de controle de moedas para visualizar quais endereços contêm denominações mistas prontas para serem usadas nas transações do PrivateSend. Vá para a guia **Enviar** da sua carteira e clique em **Entradas** para visualizar os possíveis endereços de entrada para suas transações. Você pode ver como cada endereço contém denominações de dash misto e quantas rodadas de mixagem foram concluídas. Isso serve para garantir que uma combinação eficiente de endereços possa ser usada como entrada nas transações do PrivateSend sem muita alteração, pois o valor em uma transação do PrivateSend deve ser arredondado para gastar completamente todas as entradas. O saldo mínimo atual de uma entrada usada em uma transação do PrivateSend é de 0,01000010 DASH.

source: Coin Selection dialog showing addresses holding PrivateSend mixed balances in different denominations
de: Der Coin Selection Dialog zeigt Adressen, die gemischte PrivateSend-Guthaben in unterschiedlichen Denominationen beinhalten
fr: Dialogue Contrôle des pièces affichant les adresses contenant des fonds mélangés PrivateSend sous différentes coupures
pt: Caixa de diálogo seleção de moedas mostrando os endereços que mantêm os saldos mistos do PrivateSend em diferentes denominações
ru: В диалоговом окне "Выбор монет" показаны адреса, содержащие смешанные балансы PrivateSend в разных номиналах

source: Paying with PrivateSend
de: Mit PrivateSend bezahlen
fr: Payer avec PrivateSend
pt: Pagando com PrivateSend
ru: Оплата с помощью PrivateSend

source: You can only use PrivateSend for payments once you have mixed enough Dash to make up the amount you are trying to send. Because the mixing process takes time, it must be done in advance before you create the send transaction. A PrivateSend transaction is effectively the same as any other transaction on the blockchain, but it draws only from input addresses where the denomination has previously been mixed to ensure anonymity of funds. Because several input addresses are usually required to make up the amount you are trying to send, a PrivateSend transaction will usually take up more space (in kilobytes) on the blockchain, and therefore will be charged a slightly higher fee.
pt: Você só pode usar o PrivateSend para pagamentos depois de misturar o Dash o suficiente para compensar o valor que está tentando enviar. Como o processo de mixagem leva tempo, ele deve ser feito antes de você criar a transação de envio. Uma transação do PrivateSend é efetivamente a mesma que qualquer outra transação no blockchain, mas ela atrai apenas os endereços de entrada onde a denominação foi previamente misturada para garantir o anonimato dos fundos. Como geralmente são necessários vários endereços de entrada para compensar o valor que você está tentando enviar, uma transação do PrivateSend normalmente ocupará mais espaço (em kilobytes) no blockchain e, portanto, será cobrada uma taxa um pouco mais alta.

source: To send a payment using PrivateSend, go to the **Send** tab of the Dash Core wallet and enable the **PrivateSend** option. The balance displayed will change to show your PrivateSend balance instead of the total balance. You can then enter the **Pay To** address, **Label**, **Amount** and click **Send** as usual. Your payment will be rounded up to completely spend the lowest possible denomination of mixed balance available (currently to the nearest 0.01 DASH). You will be prompted to enter your password and receive a detailed breakdown of the fee structure for PrivateSend before sending.
pt: Para enviar um pagamento usando o PrivateSend, vá para a guia **Enviar** da carteira do Dash Core e ative a opção **PrivateSend**. O saldo exibido mudará para mostrar seu saldo do PrivateSend em vez do saldo total. Você pode inserir o endereço **Pagar a**, **Rotulo**, **Quantidade** e clicar em **Enviar** como de costume. Seu pagamento será arredondado para gastar completamente a menor denominação possível de saldo misto disponível (atualmente para o 0,01 DASH mais próximo). Você será solicitado a digitar sua senha e receber uma análise detalhada da estrutura de taxas do PrivateSend antes do envio.

source: Dash Core ready to send a PrivateSend transaction. Note PrivateSend is enabled and the amount to be sent is less than the available PrivateSend balance
de: Dash Core ist bereit eine PrivateSend-Transaktion durchzuführen. Hierfür muss PrivateSend aktiviert sein und der Transaktionsbetrag darf nicht die verfügbare PrivateSend-Gesamtsumme übersteigen.
fr: Logiciel Dash Core prêt à envoyer une transaction PrivateSend. À noter que PrivateSend est activé et que le montant à envoyer est inférieur au solde PrivateSend disponible
pt: Dash Core pronto para enviar uma transação do PrivateSend. Observação O PrivateSend está ativado e o valor a ser enviado é menor que o saldo do PrivateSend disponível
ru: Dash Core готов к отправке транзакции PrivateSend. Обратите внимание, что функция PrivateSend активирована, а количество, указанное к отправке меньше доступного на балансе PrivateSend.

source: Introduction
de: Einleitung
pt: introdução
ru: Введение

source: This documentation describes how to use InstantSend to instantly send funds to any other Dash user around the world. Dash InstantSend is supported by many wallets and vendors, including (but not limited to) the following:
de: Diese Dokumentation beschreibt, wie InstantSend dazu verwendet werden kann, sofortige Dash-Transaktionen rund um die Erde durchzuführen. Dash InstantSend wird von vielen verschiedenen Wallets und Händlern verwendet, zu denen auch (aber nicht nur) die folgenden gehören:
fr: Cette documentation décrit comment utiliser InstantSend pour envoyer instantanément des fonds à tout autre utilisateur Dash dans le monde. La fonction InstantSend de Dash est compatible avec beaucoup de portefeuilles et de marchands, dont les suivants (liste non exhaustive) :
pt: Esta documentação descreve como usar o InstantSend para enviar instantaneamente fundos para qualquer outro usuário do Dash em todo o mundo. O Dash InstantSend é suportado por muitas carteiras e fornecedores, incluindo (mas não limitado a) o seguinte:
ru: В этой документации описывается, как использовать функцию InstantSend для немедленной отправки средств любому другому пользователю Dash в любой точке земного шара. Dash InstantSend поддерживается многими кошельками и поставщиками, включая (но не ограничиваясь) следующих:

source: Dash Core Wallet
fr: Portefeuille logiciel Dash Core
pt: Carteira Dash Core

source: Dash Android Wallet
fr: Portefeuille Android Dash
pt: Carteira Dash Android
ru: Кошелёк Dash для Android

source: Dash iOS Wallet
fr: Portefeuille IOS Dash
pt: Carteira Dash iOS
ru: Кошелёк Dash для iOS

source: Dash Copay Wallet
pt: Carteira Dash Copay

source: My Dash Wallet
fr: Portefeuille My Dash Wallet
pt: Minha Carteira Dash

source: and many more...
de: und viele mehr...
fr: et beaucoup d'autres
pt: e muito mais...
ru: и многие другие...

source: You can read more about InstantSend theory and processes :ref:`here <instantsend>`.
de: Mehr zur Theorie hinter InstantSend und dem exakten Verfahren gibt es :ref:`hier <instantsend>`.
fr: Pour en savoir plus sur le concept et le processus InstantSend, voir :ref:`ici <instantsend>`.
pt: Você pode ler mais sobre teoria e processos do InstantSend :ref: `aqui <instantsend>`.
ru: Подробнее теоретическую часть и о процессах функции InstantSend вы можете почитать :ref:`здесь <instantsend>`.

source: Paying with InstantSend
de: Mit InstantSend bezahlen
fr: Payer avec InstantSend
pt: Pagando com InstantSend
ru: Оплата с помощью InstantSend

source: InstantSend functions by setting a flag on the transaction, causing deterministic selection of a quorum of 10 masternodes for each input spent in an InstantSend transaction. The masternodes examine the input, and if a majority determines it has at least six confirmations, they then accept the transaction. The input is then locked until the transaction has been confirmed in six mined blocks, at which point the output can be used as an input in another InstantSend transaction. This differs from inputs used in normal transactions, which can be spent after just one confirmation regardless of whether the Dash was received using InstantSend or not. A higher fee will be charged for InstantSend transactions, according to the :ref:`fee schedule <fees>`. Note that the receiving wallet must also be aware of InstantSend in order to be able to immediately continue with the transaction or display an appropriate notification that the transaction should be considered locked. If the receiving wallet is not aware of InstantSend, it will simply appear as a normal transaction and you will need to wait for standard block confirmations.
pt: O InstantSend funciona definindo um sinalizador na transação, causando a seleção determinística de um quorum de 10 masternodes para cada entrada gasta em uma transação do InstantSend. Os masternodes examinam a entrada e, se a maioria determinar que tem pelo menos seis confirmações, eles aceitam a transação. A entrada é então bloqueada até que a transação tenha sido confirmada em seis blocos minerados, ponto no qual a saída pode ser usada como uma entrada em outra transação do InstantSend. Isso difere das entradas usadas em transações normais, que podem ser gastas após apenas uma confirmação, independentemente de o Dash ter sido recebido usando o InstantSend ou não. Uma taxa mais alta será cobrada pelas transações do InstantSend, de acordo com :ref: `fee schedule <fees>`. Observe que a carteira de recebimento também deve estar ciente do InstantSend para poder continuar imediatamente com a transação ou exibir uma notificação apropriada de que a transação deve ser considerada bloqueada. Se a carteira de recebimento não estiver ciente do InstantSend, ela aparecerá simplesmente como uma transação normal e você precisará aguardar por confirmações de bloqueio padrão.

source: To pay with InstantSend, simply check the relevant checkbox in your app. The following screenshots indicate where this setting can be found in the Dash Core, iOS and Android wallets.
de: Um mit InstantSend zu bezahlen muss lediglich ein Haken im entsprechenden Kästchen eingefügt werden. Die folgenden Screenshots zeigen wo sich dieses Kästchen in der Dash Core, der iOS und der Android Wallet befinden.
fr: Pour payer avec InstantSend, cochez simplement la case appropriée dans votre applications. Les captures d'écran suivantes indiquent où ce réglage peut être trouvé dans les portefeuilles Dash Core, iOS et Android.
pt: Para pagar com o InstantSend, basta marcar a caixa de seleção relevante no seu aplicativo. As capturas de tela a seguir indicam onde essa configuração pode ser encontrada nas carteiras do Dash Core, iOS e Android.
ru: Для совершения оплаты с помощью InstantSend, просто проверьте наличие галочки в соответствующем поле в вашем приложении. На следующих скриншотах показано, где найти эту опцию в Dash Core, iOS и Android кошельках.

source: Dash Wallets showing InstantSend option
de: Dash Wallets mit InstantSend Option
fr: Portefeuilles Dash avec l'option InstantSend
pt: Carteiras Dash mostrando a opção InstantSend
ru: Кошельки Dash демонстрирующие функцию InstantSend

source: PrivateSend and InstantSend
de: PrivateSend und InstantSend
fr: PrivateSend et InstantSend
ru: Функции PrivateSend и InstantSend

source: This documentation describes how to use Dash Core to send Dash privately. PrivateSend, released as DarkSend in RC4 of the DarkCoin client and rebranded to PrivateSend in May 2016, is a trustless method of running a sequence of transactions (known as "mixing") such that an external observer is unable to determine the source of funding when a PrivateSend transaction is created. This gives your Dash the same privacy properties as cash withdrawn from an ATM, for example. The mixing and denomination process is seamless, automatic, and requires no intervention on the part of the user. The current implementation of PrivateSend in the Dash Core wallet allows any amount of Dash to be mixed for later use in PrivateSend transactions. As of December 2018, PrivateSend is not currently available in other Dash wallets.
fr: Cette documentation explique comment utiliser le logiciel portefeuille Dash Core pour envoyer des dashs de manière anonyme. La fonction PrivateSend, d'abord sortie sous le nom de DarkSend dans la version RC4 du client DarkCoin, puis rebaptisée PrivateSend en mai 2016, est une méthode sans tiers de confiance nécessaire (trustless), permettant d'opérer une série de transactions (appelée "mélange") de telle manière qu'un observateur extérieur soit incapable de déterminer l'origine des fonds à la création d'une transaction PrivateSend. Cela confère à vos fonds Dash les mêmes qualités d'anonymat que, par exemple, de l'argent liquide retiré à un distributeur. Le mélange et le processus de gestion des coupures sont automatiques et ne demandent pas d'intervention de la part de l'utilisateur. L'implémentation actuelle de PrivateSend dans le portefeuille logiciel Dash Core permet de mélanger un montant arbitraire de dashs pour une utilisation ultérieure dans des transactions PrivateSend. À la date de décembre 2018, la fonction PrivateSend n'est pas encore disponible dans d'autres portefeuilles Dash.

source: Next to **PrivateSend rounds to use**, enter a value between 1-16. Each round of PrivateSend performs one denominated fund mixing transaction. Higher numbers of rounds increase your overall level of privacy while decreasing the chance of detection via node collusion. 16 is the highest number of rounds currently available.
fr: Pour **Cycles PrivateSend à utiliser**, saisissez un nombre entre 1 et 16. Chaque cycle PrivateSend opère une transaction de mélange pour une coupure. Un nombre élevé de cycles améliore votre niveau général d'anonymat tout en réduisant le risque d'une détection par collusion de nœuds. 16 est le plus grand nombre de cycles actuellement possible.

source: NOTE: To prevent system abuse, an average of one in ten rounds of masternode mixing incurs a fee of .0001 DASH.
de: HINWEIS: Um den Missbrauch des Systems zu verhindern wird ca. alle zehn Runden eine Gebühr von 0.0001 Dash erhoben.
fr: À NOTER : pour dissuader un abus du système, un cycle de mélange sur dix en moyenne comporte des frais de 0,0001 dash.
ru: ПРИМЕЧАНИЕ: Для предотвращения злоупотребления системой, в среднем за один из десяти раундов смешивания с помощью мастернод взимается комиссия в размере 0,0001 DASH.

source: Enter a target value for **Amount of Dash to keep mixed**. This value provides a lower boundary on the final amount of funds to be mixed. Depending on how the client splits your wallet balance, you may end up with denominated inputs whose sum total is greater than the target amount. In this case the client will use all existing denominated inputs in the PrivateSend process. The final mixed amount may be higher than your target, but should be close.
fr: Indiquez une valeur cible dans **Nombre de dashs à conserver mélangés**. Cette valeur constitue une valeur minimale sur la quantité totale de fonds à mélanger. Selon la manière dont le logiciel client gère votre solde, vous pouvez vous retrouver avec des coupures dont la somme totale est plus grande que la valeur cible. Dans ce cas, le logiciel client utilisera toutes les coupures existantes dans la procédure PrivateSend. Le montant mélangé total peut être supérieur à votre valeur cible, mais devrait en être proche.

source: The wallet contains sufficient non-mixed funds to create the minimum required denominated values
fr: Le portefeuille contient suffisamment de fonds non mélangés pour créer les coupures minimales exigibles

source: The target value for mixed Funds in the Options dialog is greater than zero
fr: La valeur cible des fonds mélangés dans le dialogue Option est supérieure à zéro

source: Since PrivateSend mixing creates a lot of new address keys to send and receive the mixed denominations, you may receive a warning when the number of remaining keys runs low. This is nothing to be worried about, since the wallet will simply create more keys as necessary. However, these keys will not exist in any previous backups of your wallet. For this reason, it is important to backup your wallet again after mixing is complete.
fr: Comme le mélange PrivateSend crée beaucoup de nouvelles adresses pour créer et recevoir les coupures mélangées, vous pourrez voir apparaître un avertissement quand le nombre de clés restantes commence à devenir faible. Il ne faut pas s'en inquiéter, car le portefeuille créera simplement davantage de clés, selon ses besoins. Cependant, ces clés n'existeront pas dans les sauvegardes précédentes de votre portefeuille. Pour cette raison, il est important de sauvegarder une nouvelle fois votre portefeuille après que le mélange soit terminé.

source: Wallet funds were broken into PrivateSend denominations (Step 1 :ref:`here <privatesend>`)
de: Wallet-Guthaben wurde in PrivateSend-Denominationen aufgeteilt (Schritt 1 :ref:`hier <privatesend>`)
fr: Des fonds du portefeuille ont été divisés en coupures PrivateSend (étape 1 :ref:`ici <privatesend>`)
ru: Средства кошелька были разбиты на номиналы PrivateSend (Шаг 1 :ref:`здесь <privatesend>`)

source: A transaction was sent to a masternode in order to participate in a mixing session (Step 3 :ref:`here <privatesend>`)
de: Eine Transaktion wurde an eine Masternode gesandt, um eine Mischrunde einzuleiten (Schritt 3 :ref:`hier <privatesend>`)
fr: Une transaction a été envoyée à un masternode afin de participer à une session de mélange (étape 3 :ref:`ici <privatesend>`)
ru: Транзакция была отправлена мастерноде для принятия участия в сессии смешивания (Шаг 3 :ref:`здесь <privatesend>`)
