Repository: 12Gitcat/docs
Catalog: locale/*/LC_MESSAGES/wallets/copay/getting-started.po
Languages: vi

source: Getting Started
vi: Bắt đầu

source: This documentation describes how to use the most common features of the Dash Copay wallet. Since the functionality is similar across all supported platforms (Android, iOS, Windows, macOS, Linux), the instructions and screenshots will reference the Android software, highlighting differences between the platforms where necessary.
vi: Tài liệu này mô tả cách sử dụng hầu hết các tính năng thông dụng của ví Dash Copay. Các chức năng này là tương tự nhau cho các nền tảng mà nó hỗ trợ (Android, iOS, Windows, macOS và Linux), hướng dẫn và ảnh chụp màn hình sẽ dùng trên phiên bản Android, những sự khác nhau giữa các nền tảng sẽ được làm rõ khi cần.

source: Installation
vi: Cài đặt

source: When you first start your Dash Wallet, you will be prompted to choose between creating a new wallet or restoring an existing wallet from backup. Choose **Get started** to create a new wallet unless you have existing funds stored in another wallet using a recovery phrase. Your new wallet will be generated, and a recovery phrase will appear so you can recover the funds later if you lose or damage your device or need to transfer the account to another device. Write the phrase down on paper and store it in a safe place - if you lose this, you will also lose access to your funds forever. Do not take screenshots to store your recovery phrase! Screenshots may be automatically backed up to cloud file storage services where you may no longer have complete control over who views the files.
vi: Khi bạn khởi động ví Dash lần đầu tiên, bạn sẽ được nhắc để lựa chọn giữa việc tạo một ví mới hoặc phục hồi từ một ví đã có sẵn. Chọn **Get started** để tạo một ví mới, trừ khi bạn đã có sẵn một ví mà đã có tiền trong đó thì bạn sử dụng một câu phục hồi. Khi ví mới của bạn được tạo, và một câu phục hồi sẽ xuất hiện để giúp bạn có thể phục hồi để lấy lại tiền trong ví trong tương lai nếu bạn bị mất hoặc hỏng điện thoại hay bạn muốn chuyển tài khoản sang thiết bị khác. Hãy viết dòng chữ đó xuống và cất giữ nó ở nơi an toàn - nếu bạn để mất nó, bạn sẽ có thể mất quyền truy cập đến khoản tiền của mình mãi mãi. Đừng chụp ảnh màn hình để lưu câu phục hồi của bạn! Ảnh chụp màn hình có thể được tự động sao lưu vào hệ thống lưu trữ trên đám mây nơi bạn không hoàn toàn có quyền kiểm soát việc ai được phép xem những file đó.

source: *Creating a new wallet and generating the recovery phrase in Dash Copay wallet*
vi: *Tạo một ví mới và sinh một câu khôi phục trong ví Dash Copay*

source: If you want to restore an existing Dash Copay wallet, simply tap **Restore from backup** and enter the 12 word recovery phrase. File/text backups are also supported.
vi: Nếu bạn muốn khôi phục từ một ví Dash Copay đã có, chỉ cần đơn giản bấm vào **Restore from backup** và nhập vào 12 từ của câu phục hồi. File/text backups cũng được hỗ trợ.

source: Receiving
vi: Nhận

source: Simply tap the **Receive** icon at the bottom of the screen to receive Dash. The wallet will generate and display a QR code for the other device to scan, or you can simply tap the displayed address to copy it to the clipboard so you can paste it in another app. If you have multiple wallets, you can see the name of the wallet at the bottom of the screen, and tap it to switch between wallets. The receiving address will change and you will receive a notification when you receive the transfer.
vi: Chỉ đơn giảm bấm biểu tượng **Nhận** ở dưới cuối màn hình để nhận Dash. Ví sẽ tự động sinh và hiển thị một mã QE cho thiết bị khác quét, hoặc bạn chỉ cần bấm để hiển thị địa chỉ để có thể copy vào bộ nhớ đệm và sau đó bạn có thể dán vào một ứng dụng khác. Nếu bạn có nhiều ví, bạn có thể nhìn thấy tên ví ở cuối của màn hình, và bấm vào tên đó để chuyển qua lại giữa các ví. Địa chỉ nhận cũng sẽ thay đổi và bạn sẽ nhận được thông báo khi bạn nhận được tiền.

source: *Receiving dash and viewing your balance in Dash Copay wallet*
vi: *Nhận Dash và xem số dư của bạn trong ví Dash Copay*

source: Sending
vi: Gửi

source: *Sending Dash from Dash Copay wallet*
vi: *Gửi Dash từ ví Dash Copay*

source: Viewing transactions and balances
vi: Xem các giao dịch và các số dư

source: Your recent transactions appear on the **Home** screen. You can tap any transaction to view more details or enter a **Memo** to help you remember the purpose of the transaction. Tap **View on blockchain** to open the Insight blockchain explorer to view full transaction details. All the wallets you have created and their respective balances appear below the recent transactions on the **Home** screen. You can tap any wallet to view the balance and transaction history associated with that wallet only.
vi: Những giao dịch gần đây của bạn xuất hiện ở màn hình **Home**. Bạn có thể bấm vào bất kỳ giao dịch nào để xem cụ thể hơn hoặc nhập một **Memo** để giúp bạn nhớ được mục đích của giao dịch. Bấm vào **View on blockchain** để mở chức năng Insight blockchain explorer để xem đầy đủ chi tiết giao dịch. Tất cả các ví của bạn được tạo và có số dư tương ứng xuất hiện ở bên dưới các giao dịch gần đây trên màn hình **Home**. Bạn có thẻ bấm vào bất kỳ ví nào để xem số dư và lịch sử giao dịch trong mỗi ví đó.

source: *Home screen, transaction details and wallet details in Dash Copay wallet*
vi: *Màn hình chính, chi tiết giao dịch và chi tiết ví trong ví Dash Copay*
