Repository: 12Gitcat/docs
Catalog: locale/*/LC_MESSAGES/developers/compiling.po
Languages: ar, el, es, fr, ru, zh_cn

source: Setup the host environment
ar: إعداد بيئة المضيف
el: Διαμορφώστε το host environment
es: Configurar el entorno de alojamiento
fr: Mise en place de l'environnement hôte
ru: Установка принимающей системы
zh_cn: 设置主机环境

source: Gitian builds are known to be working on Debian 8.x. If your machine is already running this system, you can perform Gitian builds on the actual hardware. Alternatively, you can install it in a virtual machine. Follow the guide for :ref:`setting up a VPS for masternodes <vps-setup>`, selecting a Debian 8.x image during the installation process and naming your non-root user ``gitianuser``. Selecting a VPS with two processors will also greatly speed up the build process. If you cannot login to your VPS over SSH as root, access the terminal and issue the following command::
ar: من المعروف أن Gitian builds تعمل على Debian 8.x. إذا كان جهازك يعمل بالفعل على هذا النظام ، يمكنك تنفيذ Gitian على الأجهزة الفعلية. بدلاً من ذلك ، يمكنك تثبيته في جهاز ظاهري. اتبع الدليل ل :ref:`اعدادات ماسترنود <vps-setup>`، تحديد صورة Debian 8.x أثناء عملية التثبيت وتسمية المستخدم غير الجذر ``gitianuser``. سيؤدي اختيار VPS مع معالجين إلى تسريع عملية الإنشاء بشكل كبير. إذا لم تتمكن من تسجيل الدخول إلى VPS عبر SSH كجذر ، فقم بالوصول إلى المحطة وإصدار الأمر التالي:
el: Τα Gitian builds είναι γνωστό ότι δουλεύουν στο Debian 8.x. Αν το μηχάνημά σας ήδη τρέχει αυτό το σύστημα, μπορείτε να τρέξετε Gitian builds με το τρέχον hardware. Εναλλακτικά, μπορείτε να το εγκαταστήσετε σε μια virtual machine. Ακολουθήστε τον οδηγό για :ref:`setting up a VPS for masternodes <vps-setup>`, επιλέξτε το Debian 8.x image κατά την διάρκεια της διαικασίας εγκατάστασης και ονομάστε τον non-root user ``gitianuser``. Αν επιλέξετε ένα VPS με δύο επεξεργαστές θα επιταχύνετε πολύ την διαδικασία build. Αν δεν μπορείτε να κάνετε login στο VPS σας ως root μπείτε στο terminal και πληκτρολογήστε την ακόλουθη command::
es: Se sabe que las versiones de Gitian están trabajando en Debian 8.x. Si tu máquina ya está ejecutando este sistema, puedes realizar compilaciones de Gitian en el hardware actual. Alternativamente, puedes instalarlo en una máquina virtual. Siguiendo la guía para :ref:`configurar un VPS para masternodes <vps-setup>`, seleccionando una imagen de Debian 8.x durante el proceso de instalación y nombrando a tu usuario non-root ``gitianuser``. Seleccionar un VPS con dos procesadores también acelerará en gran medida el proceso de compilación. Si no puedes iniciar sesión en tu VPS a través de SSH como root, accede al terminal y emite el siguiente comando::
fr: Les compilations Gitian sont réputées fonctionner sur Debian 8.x. Si votre machine tourne déjà sur ce système, vous pouvez exécuter les compilations Gitian directement sur votre matériel. Alternativement, vous pouvez l'installer dans une machine virtuelle. Veuillez suivre le guide de :ref:`mise en place d'un VPS pour les masternodes <vps-setup>`, sélectionnez une image Debian 8.x pendant le processus d'installation et nommez votre utilisateur non-root "gitianuser". Choisir un VPS avec deux processeurs augmentera grandement la vitesse de compilation. Si vous ne pouvez pas vous connecter via SSH à votre VPS en tant que root, connectez-vous au terminal et saisissez la commande suivante ::
ru: Gitian-версии работают на Debian 8.x. Если у вас уже установлена эта система, то вы можете запускать Gitian-версии прямо на собственном оборудовании. Если нет, то вы можете установить её на виртуальную машину. Выполните :ref:`установку VPS для Мастернод <vps-setup>`, выбрав раздел Debian 8.x во время процесса установки и назвав вашего пользователя без администраторских полномочий ``gitianuser``. Выбрав для VPS машину с двумя процессорами, вы значительно ускорите процесс построения. Если вы не можете войти на свой VPS через SSH как администратор, то воспользуйтесь терминалом и выполните следующие команды::
zh_cn: 已知Gitian构建是基于Debian 8.x.，如果您的计算机已运行该系统，那么您即可在实际硬件上执行Gitian构建。或者，您也可以将其安装到虚拟机中。参照指南 :ref:`为主节点 <vps-setup> 设置VPS ` ，在安装过程中选择Debian 8.x映像，将您的非根用户命名为 ``gitianuser``。选择具有两台处理器的VPS也将大大加速构建过程。如果您无法通过SSH以根用户身份登录VPS，请访问终端，发布以下指令::

source: Log in to your new environment by SSH as root. Set up the dependencies first by pasting the following in the terminal::
ar: تسجيل الدخول إلى البيئة الجديدة الخاصة بك عن طريق SSH كجذر. قم بإعداد التبعيات أولاً عن طريق لصق ما يلي في terminal ::
el: Καντε log in στο νέο περιβάλλον μέσω SSH ως root. Διαμορφώστε πρώτα τα dependancies κάνωντας paste τα παρακάτω στο terminal::
es: Inicia sesión en su tuevo entorno mediante SSH como raíz. Configura las dependencias primero pegando lo siguiente en el terminal::
fr: Connectez-vous à votre nouvel environnement via SSH en tant que root. Mettez d'abord en place les dépendances en copiant-collant ce qui suit dans le terminal ::
ru: Войдите в вашу новую систему под SSH как администратор. Сначала установите зависимости, скопировав в терминал следующие команды::
zh_cn: 通过SSH以根用户身份登录新环境。首先在终端中粘贴以下内容，进行依赖项设置::

source: Then set up LXC and the rest with the following, which is a complex jumble of settings and workarounds::
ar: ثم قم بإعداد LXC والباقي مع ما يلي ، وهو مزيج معقد من الإعدادات والحلول:
el: Μετά διαμορφώστε το LXC και τα υπόλοιπα με τα παρακάτω, τα οποία είναι μια πολύπλοκη ομάδα από settings και workarounds::
es: Luego configura LXC y el resto con lo siguiente, que es una mezcla compleja de configuraciones y soluciones::
fr: Puis mettez en place LXC et le reste avec ce qui suit (un mélange complexe de réglages et de contournements) ::
ru: Потом установите LXC и всё нижеследующее::
zh_cn: 然后采用下列方法设置LXC和剩余部分，下列方法是一种设置与变通方法相混杂的复合体::

source: At the end Debian is rebooted to make sure that the changes take effect. Re-login as the user gitianuser that was created during installation. The rest of the steps in this guide will be performed as that user.
ar: في النهاية ، يتم إعادة تمهيد Debian للتأكد من أن التغييرات سارية المفعول. إعادة تسجيل الدخول باسم المستخدم gitianuser التي تم إنشاؤها أثناء التثبيت. سيتم تنفيذ بقية الخطوات في هذا الدليل كهذا المستخدم.
el: Στο τέλος το Debian κάνει επανεκκίνηση για να επαληθεύσει ότι ισχύουν οι αλλαγές. Ξανα κάντε login ως ο χρήστης gitianuser που δημιουργήσατε κατά την διάρκεια της εγκατάστασης. Όλα τα υπόλοιπα βήματα σε αυτόν τον οδηγό γίνονται με αυτόν τον χρήστη.
es: Al final, Debian se reinicia para garantizar que los cambios entren en vigencia. Vuelve a iniciar sesión como el usuario gitianuser que se creó durante la instalación. El resto de los pasos en esta guía se realizarán como ese usuario.
fr: À la fin, Debian redémarre pour être certain que les modifications prennent effet. Re-connectez-vous en tant qu'utilisateur "gitianuser", celui créé durant l'installation. Le reste des étapes de ce guide seront exécutées en tant que cet utilisateur.
ru: В конце необходимо перезагрузить Debian, чтобы убедиться, что установки вступили в силу. Перезайдите как пользователь gitianuser, которого вы создали в ходе установки. Оставшиеся шаги в этом руководстве выполняются от имени этого пользователя.
zh_cn: 最后，重启Debian，确保更改生效。以安装过程中所设置的 gitianuser 用户身份重新登录。然后以该身份执行该指南的剩余步骤。

source: There is no ``python-vm-builder`` package in Debian, so we need to install it from source ourselves::
ar: لا توجد حزمة ``python-vm-builder`` في دبيان ، لذلك نحن بحاجة إلى تثبيتها من المصدر أنفسنا ::
el: Δεν υπάρχει πακέτο ``python-vm-builder`` στο Debian, οπότε πρέπει να το εγκαταστήσουμε από την πηγή μόνοι μας::
es: No existe el paquete ``python-vm-builder`` en Debian, por lo que debemos instalarlo desde la fuente nosotros mismos::
fr: Il n'y a pas de paquet ``python-vm-builder`` dans Debian, nous devons donc l'installer nous-mêmes depuis la source ::
ru: В Debian нет пакета ``python-vm-builder``, так что его придётся установить из источника самостоятельно::
zh_cn: Debian中不含 ``python-vm-builder`` 程序包，我们需要从源代码自行安装::

source: Set up the environment and compile
ar: إعداد البيئة وتجميعها
el: Διαμορφώστε το περιβάλλον και κάντε compile
es: Configurar el entorno y compilar
fr: Mise en place de l'environnement et compilation
ru: Установите среду и скомпилируйте
zh_cn: 设置环境并编译

source: Clone the Dash Core repository to your home directory::
ar: استنساخ مستودع داش كور إلى دليل المنزل الخاص بك ::
el: Κλωνοποιήστε την αποθήκη Dash Core στο δικό σας home directory::
es: Clona el repositorio de Dash Core en tu directorio personal::
fr: Clonez le dépôt Dash Core dans votre répertoire home ::
ru: Клонируйте репозиторий Dash Core в свой каталог home::
zh_cn: 复制Dash Core仓储到您的主目录::

source: Then create the script file::
ar: ثم قم بإنشاء ملف البرنامج النصي ::
el: Έπειτα δημιουργήστε το αρχείο script::
es: Luego crea el archivo de script::
fr: Puis créer le fichier script ::
ru: Создайте скриптовый файл::
zh_cn: 创建脚本文件::

source: And paste the following script in place (this will be automatic if/when the script is pulled into Dash Core)::
ar: ثم قم بلصق البرنامج النصي التالي في مكانه (سيكون هذا تلقائيًا إذا / عندما يتم سحب البرنامج النصي إلى داش كور) ::
el: Και κάντε paste το ακόλουθο script (αυτό θα γίνει αυτόματα αν/όταν το script τοποθετείται στο Dash Core)::
es: Y pega el siguiente script en su lugar (esto será automático si/cuando el script se inserta en Dash Core)::
fr: Collez le script suivant au bon endroit (ce sera automatique si/quand le script est placé dans Dash Core) ::
ru: Вставьте следующий скрипт (это будет произведено автоматически когда и если скрипт присутствует в Dash Core)::
zh_cn: 粘贴以下脚本到（如果/当脚本被拉入Dash Core，该粘贴将自动进行）::

source: Save the file and set it executable::
ar: احفظ الملف واضبطه للتنفيذ ::
el: Αποθηκεύστε το αρχείο και θέστε το ως executable::
es: Guarda el archivo y configúralo como ejecutable::
fr: Enregistrez le fichier et rendez-le exécutable ::
ru: Сохраните файл и сделайте его исполнительным::
zh_cn: 保存文件并将其设置为可执行::

source: Set up the environment, replacing the name and version with your name and target version::
ar: قم بإعداد البيئة ، واستبدل الاسم والإصدار باسمك وإصدارك المستهدف:
el: Διαμορφώστε το περιβάλλον, αντικαθιστώντας το όνομα και την έκδοση με το δικό σας όνομα και την έκδοση στόχο::
es: Configurar el entorno, reemplazando el nombre y la versión con tu nombre y versión de destino::
fr: Mettez en place l'environnement, en remplaçant le nom et la version par vos nom et version-cible ::
ru: Установите среду, заменив имя и версию своим именем и целевой версией::
zh_cn: 设置环境，将名称和版本更换为您的名称和目标版本::

source: Run the compilation script::
ar: تشغيل البرنامج النصي التصنيف ::
el: Τρέξτε το compilation script::
es: Ejecuta el script de compilación::
fr: Lancez le script de compilation ::
ru: Запустите компилирующий скрипт::
zh_cn: 运行编译脚本::

source: Your system will build all dependencies and Dash Core from scratch for Windows and Linux platforms (macOS if the dependencies were installed according to `these instructions <https://github.com/dashpay/dash/blob/master/doc/build-osx.md>`_). This can take some time. When complete, you will see the SHA256 checksums, which you can compare against the hashes available on the `Dash website <https://www.dash.org/wallets>`_. In this way, you can be sure that you are running original and untampered builds of the code as it exists on GitHub.
ar: سيقوم النظام الخاص بك ببناء كل الاعتماديات و داش كور من الصفر لمنصات ويندوز و لينكس (ماك إذا تم تثبيت التبعيات وفقًا لـ `هذه التعليمات <https://github.com/dashpay/dash/blob/master/doc/build-osx.md>`_). وهذا يمكن أن يستغرق بعض الوقت. عند الاكتمال ، سترى المجموع الاختباري SHA256 ، والذي يمكنك مقارنته مع التجزئة المتاحة على `موقع داش <https://www.dash.org/wallets>`_. وبهذه الطريقة ، يمكنك التأكد من تشغيلك للبنود الأصلية وغير المضغوطة من الرمز كما هو موجود على GitHub
el: Το σύστημά σας θα χτίσει όλα τα dependancies και το Dash Core από την αρχή για πλατφόρμες Windows και Linux ( macOs αν τα dependancies εγκαταστήθηκαν σύμφωνα με `αυτές τις οδηγίες <https://github.com/dashpay/dash/blob/master/doc/build-osx.md>`_). Αυτό μπορεί να πάρει λίγη ώρα. Μόλις ολοκληρωθεί, θαδείτε τα SHA256 checksums, τα οποία μπορείτε να τα συγκρίνετε με τα hashes που είναι διαθέσιμα στην `ιστοσελίδα του Dash <https://www.dash.org/wallets>`_. Με αυτόν τον τρόπο, μπορείτε να είστε σίγουροι ότι τρέχετε αυθεντικά και untampered builds του κώδικα όπως αυτός υπάρχει στο GitHub.
es: Tu sistema creará todas las dependencias y la Dash Core desde cero para plataformas Windows y Linux (en macOS si las dependencias se instalaron de acuerdo con `estas instrucciones <https://github.com/dashpay/dash/blob/master/doc/build-osx.md>`_). Esto puede llevar algo de tiempo. Cuando se complete, verás las sumas de comprobación SHA256, con las que puedes comparar con los valores disponibles en el `Sitio web de Dash <https://www.dash.org/wallets>`_. De esta manera, puedes estar seguro de que estás ejecutando compilaciones originales y sin restricciones del código tal como existe en GitHub.
fr: Votre système compilera toutes les dépendances et Dash Core depuis zéro, pour les plateformes Windows et Linux (et macOS si les dépendances ont été installées selon `ces instructions <https://github.com/dashpay/dash/blob/master/doc/build-osx.md>`_). Cela peut prendre un certain temps. À la fin, vous verrez les sommes de contrôle SHA256, que vous pouvez comparer aux empreintes publiées sur le `site web Dash <https://www.dash.org/wallets>`_. De cette manière, vous êtes sûr que vous faites tourner des compilations originales et non altérées, issues du code tel qu'existant sur GitHub.
ru: Ваша система построит версию клиента Dash Core со всеми зависимостями для Windows и Linux (и для macOS, если зависимости были установлены в соответствии с `этими инструкциями <https://github.com/dashpay/dash/blob/master/doc/build-osx.md>`_). Это может занять какое-то время. По завершении вы увидите контрольные суммы SHA256, которые можно сравнить с теми, что доступны на `сайте Dash <https://www.dash.org/wallets>`_. Теперь вы можете быть уверены, что используете оригинальную неизменённую версию кода, который приведён на GitHub.
zh_cn: 如果是基于Windows和Linux平台，您的系统将从零开始构建所有的依赖项和Dash Core（如果是macOS，需根据\ `这些指南 <https://github.com/dashpay/dash/blob/master/doc/build-osx.md>`_\ 安装的依赖项）。这可能需花费一些时间。完成后，您将看到SHA256校验和，您可以将该校验和与\ `Dash 网站 <https://www.dash.org/wallets>`_\ 上的哈希值进行比较。借此，您可确认自己正在运行的是原始、未经篡改的代码构建，一如GitHub上的源代码。

source: While Dash offers stable binary builds on the `website <https://www.dash.org/wallets>`_, on `GitHub <https://github.com/dashpay/dash/releases>`_ and through development builds using `Bamboo <https://bamboo.dash.org>`_, many users will also be interested in building Dash binaries for themselves. The following guides are available:
el: Το Dash προσφέρει σταθερά binary builds στην `ιστοσελίδα <https://www.dash.org/wallets>`_, στο `GitHub <https://github.com/dashpay/dash/releases>`_ και μέσω development builds χρησιμοποιώντας το `Bamboo <https://bamboo.dash.org>`_, εναλλακτικά πολλοί χρήστες μπορεί να ενδιαφέρονται να φτιάξουν δικά τους Dash binaries. Είναι διαθέσιμοι οι παρακάτω οδηγοί:
ru: Стабильные скомпилированные версии Dash можно найти на `сайте <https://www.dash.org/wallets>`_ и на `GitHub <https://github.com/dashpay/dash/releases>`_. Тестовые версии можно получить с помощью `Bamboo <https://bamboo.dash.org>`_. Кроме того, пользователи которые хотят скомпилировать бинарные файлы Dash самостоятельно, могут использовать следующие руководства:

source: Eclipse (coming soon)
el: Eclipse (προσεχώς)
ru: Eclipse (в разработке)

source: This guide describes how to build Dash Core wallet without the GUI from source under Ubuntu Linux. It is intended to serve as a simple guide for general compilation of non-deterministic binary files from the stable source code. A standard installation of Ubuntu Linux 16.04 LTS will be used as an environment for the build. We assume you are running as a user with sudo permissions. First add the necessary extra repository and update all packages::
el: Σε αυτόν τον οδηγό θα μάθετε πως να φτιάξετε ένα πορτοφόλι Dash Core χωρίς το GUI της πηγής μέσω του Ubuntu Linux. Είναι ένας απλός οδηγός για μία γενική συμπλήρωση non-determenistic binary αρχείων από το σταθερό source code. Θα χρησιμοποιήσουμε μία τυπική εγκατάσταση του Ubuntu Linux 16.04 LTS για την κατασκευή. Υποθέτουμε ότι τρέχετε το πρόγραμμα ως χρήστης με sudo permisssions. Πρώτα προσθέστε όλες τα αναγκαίες εξτρα repositories και ενημερώστε όλα τα πακέτα::
ru: Это руководство описывает компилирование кошелька Dash Core без графического интерфейса на Ubuntu Linux. Оно задумано как простая инструкция по общему процессу компиляции недетерминизированных бинарных файлов из стабильного исходного кода. В качестве операционной системы используется стандартная версия Ubuntu Linux 16.04 LTS. Предполагается также, что у вас есть полномочия администратора системы. Прежде всего, добавьте необходимый репозиторий и обновите все пакеты::
