Repository: 12Gitcat/docs
Catalog: locale/*/LC_MESSAGES/developers/compiling.po
Languages: ar, el, es, fr, ru, zh_cn

source: Compile Dash Core for Linux, macOS, Windows and Gitian deterministic builds
ar: ترجمة الأساسية داش لينكس ، ماك ، ويندوز و Gitian الحتمية يبني
es: Compilar Dash Core para compilaciones deterministas en Linux, macOS, Windows y Gitian.
zh_cn: 编译Dash Core，实现Linux、macOS、Windows及Gitian确定性构建

source: dash, build, compile, linux, Jenkins, macOS, windows, binary, Gitian, developers
ar: داش، بناء، ترجمة، لينكس، جنكينز، ماك، ويندوز، ثنائي، جيتيان، المطورين
es: dash, compilar, linux, Jenkins, macOS, windows, binario, Gitian, desarrolladores
zh_cn: 达世币，构建，编译，linux，Jenkins，macOS，windows，二进制，Gitian，开发者

source: Compiling Dash Core
ar: تجميع داش كور
el: Δημιουργώντας τον Πυρήνα του Dash
es: Compilando Dash Core
fr: Compiler Dash Core
ru: Компилирование клиента Dash Core
zh_cn: 编译Dash Core

source: While Dash offers stable binary builds on the `website <https://www.dash.org/wallets>`_ and on `GitHub <https://github.com/dashpay/dash/releases>`_, and development builds using `Jenkins <https://jenkins.dash.org/blue/organizations/jenkins/dashpay-dash-gitian-nightly/activity/>`_, many users will also be interested in building Dash binaries for themselves. The following guides are available:
ar: في حين يقدم داش ثنائي مستقر يبني على `الموقع <https://www.dash.org/wallets>`_ و في `جيتب <https://github.com/dashpay/dash/releases>`_, و `المطورين في <https://jenkins.dash.org/blue/organizations/jenkins/dashpay-dash-gitian-nightly/activity/>`_, العديد من المستخدمين سوف تكون مهتمة أيضا في بناء ثنائيات داش لأنفسهم. الأدلة التالية متاحة:
es: Mientras Dash ofrece compilaciones binarias estables en el `sitio web <https://www.dash.org/wallets>`_, y en `GitHub <https://github.com/dashpay/dash/releases>`_, y compilaciones desarrolladas utilizando `Jenkins <https://jenkins.dash.org/blue/organizations/jenkins/dashpay-dash-gitian-nightly/activity/>`_, muchos usuarios también estarán interesados en compilar binarios de Dash para ellos mismos. Las siguientes guías están disponibles:
zh_cn: 达世币使用 `Jenkins <https://jenkins.dash.org/blue/organizations/jenkins/dashpay-dash-gitian-nightly/activity/>`_，提供于 `网站 <https://www.dash.org/wallets>`_ 和‘ `GitHub <https://github.com/dashpay/dash/releases>`_ 上构建稳定的二进制及开发，当然许多用户可能会想要自己构建达世币二进制。这些用户可以参考以下指南：

source: :ref:`Building on Linux <linux-build>`
ar: :ref:`بناء في لينكس <linux-build>`
el: :ref:`Βασισμένο στο Linux <linux-build>`
es: :ref:`Construir en Linux <linux-build>`
fr: :ref:`Compiler sous Linux <linux-build>`
ru: :ref:`Компилирование на Linux <linux-build>`
zh_cn: :ref:`在Linux进行构建 <linux-build>`

source: :ref:`Building on macOS <macos-build>`
ar: :ref:`بناء في ماك <macos-build>`
es: :ref:`Compilando en macOS <macos-build>`
zh_cn: :ref:`在macOS进行构建 <macos-build>`

source: :ref:`Building on Windows <windows-build>`
ar: :ref:`بناء في ويندوز <windows-build>`
es: :ref:`Compilando en Windows <windows-build>`
zh_cn: :ref:`在Windows进行构建 <windows-build>`

source: :ref:`Gitian deterministic builds <gitian-build>`
ar: :ref:`بناء في Gitan <gitian-build>`
es: :ref:`Gitian compilaciones deterministas <gitian-build>`
ru: :ref:`Gitian-детерминизированные версии <gitian-build>`
zh_cn: :ref:`Gitian 确定性构建 <gitian-build>`

source: These guides describe how to build the current stable version. To build the latest version from the develop branch, replace the normal ``git clone`` command with the following command when pulling from GitHub::
ar: تصف هذه الأدلة كيفية إنشاء الإصدار الثابت الحالي. لإنشاء أحدث إصدار من فرع التطوير ، استبدل الأمر ``git clone`` الطبيعي بالأمر التالي عند السحب من GitHub ::
es: Estas guías describen como compilar la versión estable actual. Para compilar la ultima versión desde la rama desarrollada, reemplace el comando normal ``git clone`` con el siguiente comando cuando la traiga de GitHub::
zh_cn: 这些指南介绍了如何构建当前稳定版本。自开发分支构建最新版本，需在从GitHub中提取的时候，将正常的 ``git clone`` 命令替换为以下命令::

source: Linux
ar: لينكس

source: This guide describes how to build Dash Core wallet without the GUI from source under Ubuntu Linux. For a more detailed guide, see the `Unix Build Notes <https://github.com/dashpay/dash/blob/master/doc/build-unix.md>`__. The content on this page is intended to serve as a simple guide for general compilation of non-deterministic binary files from the stable source code. A standard installation of Ubuntu Linux 18.04 LTS will be used as an environment for the build. We assume you are running as a user with sudo permissions. First add the necessary extra repository and update all packages::
ar: يصف هذا الدليل كيفية بناء محفظة داش كور بدون واجهة المستخدم الرسومية GUI من المصدر تحت لينكس يوبنتو. للحصول على دليل أكثر تفصيلاً ، انظر `هنا <https://github.com/dashpay/dash/blob/master/doc/build-unix.md>`__. يهدف المحتوى الموجود في هذه الصفحة إلى تقديم دليل بسيط للتجميع العام للملفات الثنائية غير المحددة من الكود المصدري الثابت. سيتم استخدام تثبيت قياسي لنظام التشغيل لينكس يوبنتو 18.04 LTS كبيئة للبناء. نفترض أنك تعمل كمستخدم مع أذونات sudo. أولا إضافة المستودع الإضافي الضروري وتحديث جميع الحزم ::
es: Esta guía describe cómo compilación la billetera Dash Core sin la GUI de la fuente en Linux Ubuntu. Para una guia mas detallada, vea las `Notas de Compilación de Unix <https://github.com/dashpay/dash/blob/master/doc/build-unix.md>`__. El contenido en esta pagina sirve como una guía simple para la compilación general de archivos binarios no deterministas a partir del código fuente estable. Se utilizara una instalación estándar de Linux Ubuntu 18.04 LTS como entorno para la compilación. Suponemos que estás ejecutando como usuario con permisos sudo. Primero agrega el repositorio adicional necesario y actualiza todos los paquetes::
zh_cn: 本指南介绍了如何基于Ubuntu Linux操作系统，无需GUI，自源代码构建Dash Core钱包。更详细的指南，请参阅 `Unix 构建说明 <https://github.com/dashpay/dash/blob/master/doc/build-unix.md>`__。此页面所示内容旨在作为简单的指示性说明，介绍如何自稳定的源代码编译一般的非确定性二进制文件。Ubuntu Linux 18.04 LTS的标准安装将用作构建环境。我们假设您是以具有sudo权限的用户身份在运行。首先添加必要的额外仓储，并更新所有程序包::

source: Now install the dependencies as described in the installation documentation::
ar: الآن تثبيت التبعيات كما هو موضح في وثائق التثبيت ::
el: Τώρα εγκαταστήστε τα dependencies όπως περιγράφεται στα έγγραφα της εγκατάστασης::
es: Ahora instala las dependencias como se describe en la documentación de instalación::
fr: Puis installez les dépendances, tel que décrit dans la documentation d'installation ::
ru: Теперь установите зависимости в соответствии с установочной документацией::
zh_cn: 现在依照安装文档所述，安装依赖项::

source: Optionally install the Qt dependencies if you want to build the Dash GUI::
ar: اختياريًا ، قم بتثبيت تبعيات Qt إذا كنت تريد إنشاء واجهة المستخدم داش GUI ::
el: Επιλεκτικά μπορείτε να εγκαταστησετε τα Qt dependencies αν θέλετε να φτιάξετε το Dash GUI::
es: De manera opcional, instala las dependencias de Qt si deseas compilar la GUI de Dash::
fr: Installez éventuellement les dépendances Qt si vous souhaitez compiler l'interface graphique Dash (GUI) ::
ru: На ваше усмотрение установите Qt-зависимости, если хотите получить графический интерфейс Dash.
zh_cn: 若您想要构建达世币 GUI，可选择安装Qt依赖项::

source: Download the stable Dash repository::
ar: تنزيل مستودع داش ::
el: Κατεβάστε το σταθερό Dash repository::
es: Descarga el repositorio estable de Dash::
fr: Téléchargez le dépôt stable Dash ::
ru: Скачайте стабильный репозиторий Dash::
zh_cn: 下载稳定的达世币仓储::

source: And build::
ar: و بناء::
el: Και δημιουργήστε::
es: Y construye::
fr: Puis compilez ::
ru: И версия::
zh_cn: 然后构建::

source: ``/usr/local/bin`` now contains the compiled Dash binaries.
ar: ``/usr/local/bin`` يحتوي الآن على الثنائيات داش المترجمة.
el: Το ``/usr/local/bin`` τώρα περιλαμβάνει τα Dash binaries που συλλέξατε.
es: ``/usr/local/bin`` ahora contiene los binarios compilados de Dash.
fr: ``/usr/local/bin`` contient maintenant les binaires Dash compilés.
ru: ``/usr/local/bin`` содержит скомпилированные версии Dash.
zh_cn: 现在 ``/usr/local/bin`` 包含已编译的达世币二进制文件。

source: macOS
ar: ماك

source: Dash can be built for macOS either using a cross-compiler under Linux or natively under macOS.
ar: يمكن أن يتم تصميم داش للـ ماك إما باستخدام مترجم برمجي ضمن لينكس أو أصلاً تحت ماك.

source: Linux cross-compile
ar: لينكس عبر ترجمة

source: This guide describes how to build Dash Core wallet from source under Ubuntu Linux. It is intended to serve as a simple guide for general compilation of non-deterministic binary files from the stable source code. For a more detailed guide, see the `macOS Build Notes <https://github.com/dashpay/dash/blob/master/doc/build-osx.md>`__. A standard installation of Ubuntu Linux 18.04 LTS will be used as an environment for the build. We assume you are running as a user with sudo permissions. First add the necessary extra repository and update all packages::
ar: يصف هذا الدليل كيفية بناء محفظة داش كور من المصدر تحت لينكس يوبنتو. الغرض منه هو بمثابة دليل بسيط للتجميع العام للملفات الثنائية غير الحتمية من شفرة المصدر المستقرة. للحصول على دليل أكثر تفصيلاً ، انظر `هنا <https://github.com/dashpay/dash/blob/master/doc/build-osx.md>`__. سيتم استخدام تثبيت قياسي لنظام التشغيل ليتكس يوبنتو 18.04 LTS كبيئة للبناء. نفترض أنك تعمل كمستخدم مع أذونات sudo. أولا إضافة المستودع الإضافي الضروري وتحديث جميع الحزم ::

source: A copy of the macOS SDK is required during the build process. To download this, use a Google Chrome in a desktop environment to go to https://appleid.apple.com and create or sign in to your Apple account. Then go to https://developer.apple.com and open the Chrome Developer Tools from the **Menu -> More tools -> Developer tools**. Click on the **Network** tab, then go back to your main browser window and copy in the following URL::
ar: مطلوب نسخة من نظام التشغيل ماك SDK أثناء عملية الإنشاء. لتنزيل هذا ، استخدم قوقل غروم في بيئة سطح المكتب للانتقال إلى https://appleid.apple.com وإنشاء حساب Apple أو تسجيل الدخول إليه. ثم انتقل إلى https://developer.apple.com وافتح أدوات مطوري برامج غروم من القائمة **المزيد من الأدوات -> أدوات المطور** انقر على علامة **,الشبكة** ، ثم ارجع إلى نافذة المتصفح الرئيسية وانسخ في عنوان الرابط التالي:

source: Cancel the download as soon as it begins and go back to your the **Network** tab in the developer tools. Right click on the network request at the bottom of the list labeled **Xcode_7.3.1.dmg** and select **Copy -> Copy as cURL (bash)**. Paste this long string of text into your Linux terminal, append ``-o Xcode_7.3.1.dmg`` at the end and then press enter to begin the download. Once it is complete, extract the required files from the disc image as follows::
ar: إلغاء التنزيل بمجرد أن يبدأ ويعود إلى علامة **الشبكة** في أدوات المطور. انقر بزر الماوس الأيمن على طلب الشبكة في أسفل القائمة المسمى **Xcode_7.3.1.dmg** وحدد **نسخ -> نسخ باسم cURL (داش)**. الصق هذه السلسلة الطويلة من النص في وحدة لينكس ، وأضف ``-o Xcode_7.3.1.dmg`` في النهاية ، ثم اضغط على ادخل لبدء عملية التنزيل. بمجرد اكتماله ، قم باستخراج الملفات المطلوبة من صورة القرص كما يلي ::

source: ``~/dash/src`` now contains the compiled Dash binaries, and ``~/dash/src/qt`` contains the Dash GUI wallet.
ar: ``~/dash/src`` يحتوي الآن على الثنائيات داش المترجمة ، و ``~/dash/src/qt`` يحتوي على محفظة داش GUI
es: ``~/dash/src`` ahora contiene los binarios compilados de Dash, y ``~/dash/src/qt`` contiene la GUI de la billetera GUI.
zh_cn: 现在 ``~/dash/src`` 包含已编译的达世币二进制文件， ``~/dash/src/qt`` 包含达世币 GUI钱包。

source: macOS Native
ar: ماك الأصلية

source: This guide describes how to build Dash Core wallet from source under macOS. It is intended to serve as a simple guide for general compilation of non-deterministic binary files from the stable source code. For a more detailed guide, see the `macOS Build Notes <https://github.com/dashpay/dash/blob/master/doc/build-osx.md>`__. A standard installation of macOS 10.13 High Sierra will be used as an environment for the build. We assume you are running as a user with sudo permissions. First, open a the **Terminal** app and enter the following command to install the OS X command line tools::
ar: يصف هذا الدليل كيفية بناء محفظة داش كةر من المصدر تحت ماك. الغرض منه هو بمثابة دليل بسيط للتجميع العام للملفات الثنائية غير الحتمية من شفرة المصدر المستقرة. للحصول على دليل أكثر تفصيلاً ، انظر `هنا <https://github.com/dashpay/dash/blob/master/doc/build-osx.md>`__. سيتم استخدام تثبيت قياسي لنظام التشغيل ماك 10.13 High Sierra كبيئة للبناء. نفترض أنك تعمل كمستخدم مع أذونات sudo. أولاً ، افتح تطبيق **Terminal** وأدخل الأمر التالي لتثبيت أدوات سطر الأوامر OS X ::
es: Esta guía describe cómo compilar la billetera Dash Core desde la fuente bajo macOS. Está pensado para servir como una guía simple para la compilación general de archivos binarios no deterministas del código fuente estable. Para una guía mas detallada vea las `Notas de Compilación macOS <https://github.com/dashpay/dash/blob/master/doc/build-osx.md>`__. Se utilizara una instalación estándar de macOS 10.13 High Sierra como entorno para la compilación. Suponemos que estás ejecutando como usuario con permisos sudo. Primero, abra un **Terminal** e ingrese el siguiente comando para instalar las herramientas de linea de comando de OS X::
zh_cn: 本指南介绍如何基于macOS操作系统，自源代码构建Dash Core钱包。本指南仅用作简单的指示性说明，介绍如何自稳定的源代码编译一般非确定性二进制文件。更详细的指南，请参阅 `macOS 构建说明 <https://github.com/dashpay/dash/blob/master/doc/build-osx.md>`__。macOS 10.13 High Sierra的标准安装将用作构建环境。我们假设您是以具有sudo权限的用户身份在运行。首先，打开一个 **终端** 应用程序并输入以下命令，安装OS X命令行工具::

source: When the popup appears, click **Install**. Then install `Homebrew <https://brew.sh>`__::
ar: عندما تظهر النافذة المنبثقة ، انقر فوق **تثبيت**. ثم قم بتثبيت `Homebrew <https://brew.sh>`__::
es: Cuando la ventana emergente aparezca, haz clic en **Instalar**. Luego instale `Homebrew <https://brew.sh>`__::
fr: Quand la fenêtre pop-up s'affiche, cliquez sur **Installer**. Puis installez `Homebrew <https://brew.sh>`__ ::
zh_cn: 出现弹出窗口后，单击 **安装** 。安装 `Homebrew <https://brew.sh>`__::

source: Install dependencies::
ar: تثبيت التبعيات ::
es: Instalar dependencias::
fr: Installez les dépendances ::
zh_cn: 安装依赖项::

source: Clone the Dash Core source code and change to the ``dash`` directory::
ar: استنساخ كود مصدر داش كور وتغيير إلى دليل ``داش`` ::
es: Clonar el codigo fuente de la Dash Core y cambiar al directorio ``dash``::
fr: Copiez le code source Dash Core et allez dans le répertoire ``dash`` ::
zh_cn: 复制Dash Core源代码，将其更改为 ``dash`` directory::

source: Build Dash Core. Configure and build the headless dash binaries as well as the GUI (if Qt is found). You can disable the GUI build by passing ``--without-gui`` to configure::
ar: بناء داش كور. تكوين وبناء ثنائيات داش مقطوعة الرأس وكذلك واجهة المستخدم الرسومية (إذا تم العثور على كيو تي). يمكنك تعطيل إنشاء واجهة المستخدم الرسومية بتمرير ``- بدون - gui`` لتهيئة ::
es: Compilar Dash Core. Configura y compila los cabeceras de los binarios dash así como la GUI (si se encuentra la Qt). Puedes deshabilitar la compilación GUI pasando ``--without-gui`` para configurar::
fr: Compilez Dash Core. Configurez et compilez les binaires Dash sans interface mais aussi ceux avec interface (si Qt est trouvé). Vous pouvez désactiver la compilation avec interface avec l'argument ``--without-gui`` ::
zh_cn: 构建Dash Core。配置并构建无头达世币二进制文件以及GUI（如果已找到Qt）。您可以通过传送 ``--without-gui`` 禁用GUI构建，然后配置::

source: It is recommended to build and run the unit tests::
ar: يوصى ببناء وتشغيل اختبارات الوحدة ::
es: Es recomendado para compilar y ejecutar las pruebas unitarias::
fr: Il est recommandé de compiler et de lancer les tests d'unité ::
zh_cn: 建议构建并运行单元测试::

source: You can also create a ``.dmg`` that contains the ``.app`` bundle (optional)::
ar: يمكنك أيضًا إنشاء ``.dmg`` الذي يحتوي على حزمة ``.app`` (اختياري) ::
es: También puedes crear un ``.dmg`` que contiene el paquete ``.app`` (opcional)::
fr: Vous pouvez aussi (facultativement) créer une image-disque ``.dmg`` qui contient le paquet ``.app`` ::
zh_cn: 您也可以创建一个包含 ``.app`` 程序包的 ``.dmg`` （可选）::

source: Dash Core is now available at ``./src/dashd``.
ar: داش كور متاح على ``./src/dashd``.
es: La Dash Core ahora esta disponible en ``./src/dashd``.
fr: Dash Core est désormais disponible dans ``./src/dashd``.
zh_cn: 现在可以从 ``./src/dashd`` 获得Dash Core。

source: Windows
ar: ويندوز

source: This guide describes how to build Dash Core wallet from source for 64-bit Windows. Most developers use cross-compilation from Linux to build executables for Windows. The content on this page is intended to serve as a simple guide for general compilation of non-deterministic binary files from the stable source code. For a more detailed guide, see the `Windows Build Notes <https://github.com/dashpay/dash/blob/master/doc/build-windows.md>`__. A standard installation of Ubuntu Linux 18.04 LTS will be used as an environment for the build. We assume you are running as a user with sudo permissions. First add the necessary extra repository and update all packages::
ar: يصف هذا الدليل كيفية إنشاء محفظة داش كور من المصدر لنظام ويندوز 64 بت. يستخدم معظم المطورين الترجمة المتقاطعة من لينكس لإنشاء ملفات تنفيذية لـ ويندوز. يهدف المحتوى الموجود في هذه الصفحة إلى تقديم دليل بسيط للتجميع العام للملفات الثنائية غير المحددة من الكود المصدري الثابت. للحصول على دليل أكثر تفصيلاً ، انظر `هنا <https://github.com/dashpay/dash/blob/master/doc/build-windows.md>`__. سيتم استخدام تثبيت قياسي لنظام التشغيل لينكس يوبنتو 18.04 LTS كبيئة للبناء. نفترض أنك تعمل كمستخدم مع أذونات sudo. أولا إضافة المستودع الإضافي الضروري وتحديث جميع الحزم ::
es: Esta guía describe cómo compilar la billetera Dash Core desde la fuente para Windows 64-bit. La mayoria de los desarrolladores usan compilación cruzada desde liux para compilar ejecutables para Windows. El contenido de esta pagina está pensado para servir como una guía simple para la compilación general de archivos binarios no deterministas del código fuente estable. Para una guía mas detallada, vea las `Notas de Compilación de Windows <https://github.com/dashpay/dash/blob/master/doc/build-windows.md>`__. Una insalción estandar de Linux Ubuntu 18.04 LTS sera usada como ambiente para la compilación. Suponemos que estás ejecutando como usuario con permisos sudo. Primero agrega el repositorio adicional necesario y actualiza todos los paquetes::
zh_cn: 本指南介绍如何基于64位Windows系统，自源代码构建Dash Core钱包。大多数开发者使用Linux交叉编译器来构建Windows可执行文件。本页面旨在作为简单的指示性说明，介绍如何自稳定的源代码编译一般非确定性二进制文件。更详细的指南，请参阅 `Windows 构建说明 <https://github.com/dashpay/dash/blob/master/doc/build-windows.md>`__。Ubuntu Linux 18.04 LTS的标准安装将用作构建环境。我们假设您是以具有sudo权限的用户身份在运行。首先添加必要的额外存储，并更新所有程序包::

source: Build and link the depends system::
ar: بناء وربط نظام يعتمد ::
es: Compilar y enlazar los sistemas dependientes::
zh_cn: 构建并链接依赖系统::

source: Gitian is the deterministic build process that is used to build the Dash Core executables. It provides a way to be reasonably sure that the executables are really built from the source on GitHub. It also makes sure that the same, tested dependencies are used and statically built into the executable. Multiple developers build the source code by following a specific descriptor ("recipe"), cryptographically sign the result, and upload the resulting signature. These results are compared and only if they match, the build is accepted and uploaded to dash.org.
ar: Gitian هي عملية البناء الحتمية التي تُستخدم لإنشاء الملفات التنفيذية الأساسية في داش. ويوفر طريقة للتأكد بشكل معقول من أن الملفات التنفيذية مبنية بالفعل من المصدر على GitHub. كما أنه يضمن أن نفس التبعيات التي تم اختبارها قد تم استخدامها وتم دمجها بشكل ثابت في الملف القابل للتنفيذ. يقوم المطورون المتعددون ببناء الشفرة المصدرية باتباع واصف محدد ("وصفة") ، وتوقيع النتيجة مشفرًا ، وتحميل التوقيع الناتج. تتم مقارنة هذه النتائج وفقط في حالة تطابقها ، يتم قبول الإنشاء وتحميله إلى dash.org.
el: Το Gitian είναι η προσιοριστική διαδικασία δημιουργίας που χρησιμοποιούμε για να φτιάξουμε Dash Core executables. Μας δίνει ένα τρόπο για να είμαστε απολύτως σίγουροι ότι τα executables είναι φτιαγμένα από την πηγή (source) στο GitHub. Επίσης διασφαλίζει ότι τα ίδια, ελεγμένα dependencies χρησιμοποιούνται και ενσωματώνονται στατικά στο executable. Πολλαπλοί developers χτίζουν τον source code ακολουθώντας μία συγκεκριμένη "συνταγή", υπογράφοντας κρπτογραφικά το αποτέλεσμα και ανεβάζουν την υπογραφή που προκύπτει. Τα αποτελέσματα συγκρίνονται και μόνο αν συμπίπτουν, το build γίνεται δεκτό και ανεβαίνει στο dash.org.
es: Gitian es el proceso de compilación determinista que se utiliza para compilar los ejecutables de Dash Core. Proporciona una forma de estar razonablemente seguro de que los ejecutables están realmente construidos desde la fuente en GitHub. También se asegura de que se usen las mismas dependencias probadas y estén integradas estáticamente en el ejecutable. Múltiples desarrolladores crean el código fuente siguiendo un descriptor específico ("receta"), firman criptográficamente el resultado y cargan la firma resultante. Estos resultados se comparan y solo si coinciden, la compilación es aceptada y cargada en dash.org.
fr: Gitian est le processus de compilation déterministe qui est utilisé pour compiler les exécutables Dash Core. Il constitue un moyen de s'assurer raisonnablement que les exécutables sont vraiment compilés depuis la source sur GitHub. Il s'assure également que les mêmes dépendances éprouvées sont utilisées et intégrées statiquement à l'exécutable. De nombreux développeurs compilent le source code selon un descripteur spécifique ("recette"), signent cryptographiquement le résultat et téléversent la signature qui en résulte. Ces résultats sont comparés et, s'ils correspondent, la compilation est acceptée et téléversée sur dash.org.
ru: Gitian - это процесс детерминизированной компиляции, который используется для получения исполнительных файлов Dash Core. Он обеспечивает уверенность, что исполнительные файлы были получены из источника на GitHub, а также что при компиляции в конечный исполнительный файл были статично встроены стабильные проверенные зависимости. Многие разработчики пишут исходный код с использованием особых дескрипторов ("рецептов"), криптографически подписывают результат и выгружают соответствующую подпись. Эти результаты сравниваются и только при полном совпадении версия принимается и выкладывается на dash.org.
zh_cn: Gitian属于确定性构建过程，用于构建Dash Core的可执行文件。Gitian提供有一种方法，可合理地确认可执行文件真实构建自GitHub上的源文件。Gitian还可确保将相同的、经过测试的依赖项应用于可执行文件，并将其静态构建到可执行文件中。多名开发者依照特定的描述符（"recipe"）来构建源代码，加密签署结果，并将生成的签名上传。对这些结果进行比较，如果相匹配，则接受构建并上传至dash.org。

source: More independent Gitian builders are needed, which is why this guide exists. It is preferred you follow these steps yourself instead of using someone else's VM image to avoid 'contaminating' the build.
ar: هناك حاجة لمزيد من بناة Gitian مستقلة ، وهذا هو السبب في وجود هذا الدليل. يفضل استخدام هذه الخطوات بنفسك بدلاً من استخدام صورة VM لشخص آخر لتجنب "تلويث" البنية
el: Χρειαζόμαστε περισσότερους Gitian builders, για αυτό άλλωστε και υπάρχει αυτός ο οδηγός. Είναι προτιμώτερο να ακολουθήσετε αυτά τα βήματα ο ίδιος από το να χρησιμοποιήσετε την εικόνα VM κάποιου άλλου για να μην "μολυνθεί" το build.
es: Se necesitan constructores de Gitian más independientes, razón por la cual existe esta guía. Es preferible que sigas estos pasos tu mismo en lugar de usar la imagen de VM de otra persona para evitar 'contaminar' la compilación.
fr: Un plus grand nombre de compilateurs Gitian est souhaité ; c'est la raison d'être de ce guide. Il est préférable que vous suiviez ces étapes plutôt que d'utiliser l'image VM de quelqu'un d'autre, afin d'éviter de "contaminer" la compilation.
ru: Эта инструкция была написана, потому что существует потребность в большем количестве независимых версий на Gitian. Желательно, чтобы вы сами выполнили указанные действия, а не использовали чью-то чужую VM-копию. Это нужно чтобы не 'загрязнять' версию.
zh_cn: 需要更多的独立Gitian建造者，这也是该指南的意图所在。作为优先选项，您最好执行自己的步骤，不要使用他人的VM映像，这样可以避免 '污染' 构建。
