Repository: 12Gitcat/docs
Catalog: locale/*/LC_MESSAGES/developers/testnet.po
Languages: ar

source: Dash testnet and devnets are used by Dash developers for testing using tDASH
ar: يتم استخدام داش testnet و devnets بواسطة مطوري داش للاختبار باستخدام داش

source: With the release of Dash Core 12.3, Dash added support for a great new feature — **named devnets**. Devnets are developer networks that combine some aspects of testnet (the global and public testing network) and some aspects of regtest (the local-only regression testing mode that provides controlled block generation). Unlike testnet, multiple independent devnets can be created and coexist without interference. For practical documentation on how to use devnets, see the `developer documentation <https://dash-docs.github.io/en/developer-examples#devnet-mode>`__ or this `blog post <https://blog.dash.org/dash-devnets-bc27ecbf0085>`__.
ar: مع إصدار داش كور 12.3 ، أضاف داش دعمًا لميزة جديدة رائعة **Devnets** هي شبكات مطورين تجمع بين بعض جوانب testnet (شبكة الاختبار العامة والعامة) وبعض جوانب regtest (وضع اختبار الانحدار المحلي فقط الذي يوفر إنشاء كتلة محكومة). على عكس testnet ، يمكن إنشاء العديد من devnets مستقلة وتتعايش دون تدخل. للحصول على وثائق عملية حول كيفية استخدام devnets ، راجع `وتائق المطورين <https://dash-docs.github.io/en/developer-examples#devnet-mode>`__ او `هذا المقال <https://blog.dash.org/dash-devnets-bc27ecbf0085>`__.

source: Testnet is a fully functioning Dash blockchain with the one key exception that because the Dash on the network can be created freely, it has no value. This currency, known as tDASH, can be requested from a faucet to help developers test new versions of Dash, as well as test network operations using identical versions of the software before they are carried out on the mainnet. There are a few other key differences:
ar: Testnet هو بلوكشين داش تعمل بشكل كامل مع استثناء مفتاح واحد لأنه يمكن إنشاء داش على الشبكة بحرية ، فإنه لا يوجد لديه قيمة. يمكن طلب هذه العملة ، المعروفة باسم tDASH ، من صنبور لمساعدة المطورين على اختبار إصدارات جديدة من داش ، بالإضافة إلى اختبار عمليات الشبكة باستخدام إصدارات متطابقة من البرنامج قبل تنفيذها على mainnet. هناك بعض الاختلافات الرئيسية الأخرى:

source: Testnet operates on port 19999 (instead of 9999)
ar: يعمل Testnet على المنفذ 19999 (بدلاً من 9999)

source: Testnet addresses start with "y" instead of "X", ADDRESSVERSION is 140 (instead of 76)
ar: عناوين Testnet تبدأ بـ "y" بدلاً من "X" ، ADDRESSVERSION هي 140 (بدلاً من 76)

source: Testnet balances are denominated in tDASH (instead of DASH)
ar: يتم حساب أرصدة Testnet في tDASH (بدلاً من داش)

source: Protocol message header bytes are 0xcee2caff (instead of 0xbf0c6bbd)
ar: بايت رأس رسالة بروتوكول هي 0xcee2caff (بدلاً من 0xbf0c6bbd)

source: Bootstrapping uses different DNS seeds: test.dnsseed.masternode.io, testnet-seed.darkcoin.qa, testnet-seed.dashpay.io
ar: يستخدم Bootstrapping بذور DNS مختلفة: test.dnsseed.masternode.io ، testnet-seed.darkcoin.qa ، testnet-seed.dashpay.io

source: Launching Dash Core in testnet mode shows an orange splash screen
ar: يُظهر تشغيل داش كور في وضع testnet شاشة البداية باللون البرتقالي

source: To start Dash Core in testnet mode, find your dash.conf file and enter the following line::
ar: لبدء تشغيل داش كور في وضع testnet ، ابحث عن ملف dash.conf وأدخل السطر التالي:

source: Tools and links
ar: الأدوات و الروابط

source: The links below were collected from various community sources and may not necessarily be online or functioning at any given time. Please join `Dash Nation Discord <http://dashchat.org>`_ or the `Dash Forum <https://www.dash.org/forum/>`_ if you have a question relating to a specific service.
ar: تم جمع الروابط أدناه من مصادر مجتمعية مختلفة ، وقد لا تكون بالضرورة متصلة أو تعمل في أي وقت. يرجى الانضمام `هنا <http://dashchat.org>`_ او في `المنتدى <https://www.dash.org/forum/>`_ إذا كان لديك سؤال يتعلق بخدمة معينة.

source: **Test builds:** https://jenkins.dash.org/blue/
ar: **بناء التحقق** https://jenkins.dash.org/blue/

source: **Discussion and help:** https://www.dash.org/forum/topic/testing.53/
ar: **المحادتات و المساعدة** https://www.dash.org/forum/topic/testing.53/

source: **Masternode tools:** https://test.dashninja.pl/masternodes.html
ar: **الأدوات ماسترنود** https://test.dashninja.pl/masternodes.html

source: **Android wallet:** https://www.dash.org/forum/threads/dash-wallet-for-android-v5-testnet.14775/
ar: **محفظة الأندرويد** https://www.dash.org/forum/threads/dash-wallet-for-android-v5-testnet.14775/

source: Faucets
ar: المنبع

source: Explorers
ar: المستكشف

source: Pools
ar: الأماكن

source: Masternodes
ar: ماسترنود

source: Installing a masternode under testnet generally follows the same steps as the :ref:`mainnet masternode installation guide <masternode-setup>`, but with a few key differences:
ar: عادة ما يتبع تثبيت ماستىنود تحت testnet نفس الخطوات مثل :ref:`دليل تتببث ماسترنود <masternode-setup>`، ولكن مع بعض الاختلافات الرئيسية:

source: You will probably be running a development version of Dash instead of the stable release. See `here <https://jenkins.dash.org/blue/organizations/jenkins/dashpay-dash-gitian-nightly/activity>`__ for a list of builds, then choose the latest successful build and click **Artifacts** to view a list of binaries.
ar: من المحتمل أنك ستشغل إصدارًا مطورًا من داش بدلاً من الإصدار الثابت. نرى `هنا <https://jenkins.dash.org/blue/organizations/jenkins/dashpay-dash-gitian-nightly/activity>`__ للحصول على قائمة بالبنيات ، اختر أحدث البنية الناجحة وانقر **الأتار** لعرض قائمة من الثنائيات.

source: When opening the firewall, port 19999 must be opened instead of (or in addition to) 9999. Use this command: ``ufw allow 19999/tcp``
ar: عند فتح جدار الحماية ، يجب فتح المنفذ 19999 بدلاً من (أو بالإضافة إلى) 9999. استخدم هذا الأمر: ``ufw allow 19999/ tcp``

source: Your desktop wallet must be running in testnet mode. Add the following line to *dash.conf*: ``testnet = 1``
ar: يجب تشغيل محفظة سطح المكتب في وضع testnet. أضف السطر التالي إلى *dash.conf*: ``testnet = 1``

source: When sending the collateral, you can get the 1000 tDASH for free from a faucet (see above)
ar: عند إرسال الضمانات ، يمكنك الحصول على 1000 داش مجاناً من الصنبور (انظر أعلاه)

source: You cannot use dashman to install development versions of Dash. See the link to downloadable builds above.
ar: لا يمكنك استخدام dashman لتثبيت إصدارات التطوير من داش. انظر الرابط لتحميل ينزل أعلاه.

source: Your masternode configuration file must also specify testnet mode. Add the following line when setting up *dash.conf* on the masternode: ``testnet = 1``
ar: يجب أن يحدد ملف تهيئة ماسترنود أيضًا وضع testnet. أضف السطر التالي عند إعداد *dash.conf* على ماسترنود : ``testnet = 1``

source: As for mainnet masternodes, the RPC username and password must contain alphanumeric characters only
ar: بالنسبة إلى ماسترنود ، يجب أن يحتوي اسم المستخدم وكلمة المرور الخاصة بـ RPC على أحرف أبجدية رقمية فقط

source: When cloning sentinel, you may need to clone the development branch using the ``-b`` option, for example: ``git clone -b core-v0.12.2.x https://github.com/dashpay/sentinel.git``
ar: عند استنساخ الحارس ، قد تحتاج إلى استنساخ فرع التطوير باستخدام الخيار `'-b`` ، على سبيل المثال: ``git clone -b core-v0.12.2.x https://github.com/dashpay/sentinel.git``

source: Once sentinel is installed, modify ``~/.dashcore/sentinel/sentinel.conf``, comment the mainnet line and uncomment: ``network=testnet``
ar: بمجرد تثبيت الحارس ، قم بتعديل ``~\.dashcore/sentinel/sentinel.conf`` ، وعلق على خط mainnet و uncomment: ``network = testnet``

source: The wallet holding the masternode collateral will expect to find the ``masternode.conf`` file in ``~/.dashcore/testnet3/masternode.conf`` instead of ``~/.dashcore/masternode.conf``.
ar: ستتوقع المحفظة التي تحمل ضمانات ماسترنود العثور على الملف ``masternode.conf`` في ``~/.dashcore/testnet3/masternode.conf`` بدلاً من ``~/.dashcore/masternode.conf``.

source: Discussion:
ar: المحادتات:

source: Testnet tools: https://docs.dash.org/en/latest/developers/testnet.html
ar: الأدوات: https://docs.dash.org/en/latest/developers/testnet.html

source: Issue tracking: https://github.com/dashpay/dash/issues/new
ar: تتبع القضية: https://github.com/dashpay/dash/issues/new

source: Latest test binaries:
ar: أحدث ثنائيات الاختبار:

source: Named Devnets, to help developers quickly create multiple independent devnets
ar: اسمه Devnets ، لمساعدة المطورين بسرعة إنشاء devnets مستقلة متعددة

source: New format of network message signatures
ar: تنسيق جديد لتواقيع رسائل الشبكة

source: Governance system improvements
ar: تحسينات نظام الحوكمة

source: PrivateSend improvements
ar: التحسينات للإرسال المخفي

source: Additional indexes cover P2PK now
ar: تغطي الفهارس الإضافية P2PK الآن

source: Support for pruned nodes in Lite Mode
ar: دعم العقد المبردة في الوضع البسيط

source: New Masternode Information Dialog
ar: حوار معلومات ماسترنود جديد

source: DIP0001 implementation https://github.com/dashpay/dips/blob/master/dip-0001.md
ar: تنفيذ DIP0001: https://github.com/dashpay/dips/blob/master/dip-0001.md

source: 10x transaction fee reduction (including InstantSend fee)
ar: تخفيض رسوم المعاملة بمقدار 10x (بما في ذلك رسوم الإرسال الفوري)

source: InstantSend vulnerability fix
ar: إصلاح الثغرة الأمنية في الإرسال الفوري

source: Lots of other bug fixes and performance improvements
ar: الكثير من إصلاحات الأخطاء الأخرى وتحسينات الأداء

source: Experimental BIP39/BIP44 complaint HD wallet (disabled by default, should be fully functional but there is no GUI yet)
ar: يجب أن تكون محفظة HD التجريبية BIP39 / BIP44 التجريبية (تعطيلها بشكل افتراضي ، تعمل بكامل طاقتها ولكن لا يوجد واجهة مستخدم رسومية حتى الآن)

source: Testnet 12.2 discussion: https://www.dash.org/forum/threads/v12-2-testing.17412/
ar: المحادتات 12.2: https://www.dash.org/forum/threads/v12-2-testing.17412/

source: Testnet tools: https://www.dash.org/forum/threads/testnet-tools-resources.1768/
ar: الأدوات: https://www.dash.org/forum/threads/testnet-tools-resources.1768/

source: Latest successfully built develop branch binaries:
ar: أحدث بنيت بنجاح تطوير ثنائيات فرع:

source: Dash Core: https://jenkins.dash.org/blue/organizations/jenkins/dashpay-dash-gitian-nightly
ar: داش كور: https://jenkins.dash.org/blue/organizations/jenkins/dashpay-dash-gitian-nightly

source: Sentinel: https://github.com/dashpay/sentinel/tree/develop
ar: الحماية: https://github.com/dashpay/sentinel/tree/develop
