Repository: 12Gitcat/docs
Catalog: locale/*/LC_MESSAGES/masternodes/maintenance.po
Languages: ar, es, fr

source: Maintaining a Dash masternode involves staying up to date with the latest version, voting and handling payments
ar: يتضمن الحفاظ على داش ماسترنود مواكبة أحدث إصدار ، والتصويت والتعامل مع المدفوعات
es: Mantener un masternode Dash implica estar al día con la ultima versión, votar y manejar pagos.
fr: Gérer un masternode Dash signifie le mettre à jour avec la version la plus récente, voter et gérer les paiements

source: dash, cryptocurrency, masternode, maintenance, maintain, payments, withdrawal, voting, monitoring
es: dash, criptomoneda, masternode, mantenimiento, mantener, pagos, retiro, votación, monitoreo
fr: dash, cryptomonnaie, masternode, gestion, gérer, paiements, retrait, vote, surveillance

source: Maintenance
ar: الصيانة
es: Mantenimiento
fr: Gestion

source: Masternodes require regular maintenance to ensure you do not drop off the payment queue. This includes promptly installing updates to Dash, as well as maintaining the security and performance of the server. In addition, masternodes should vote on proposals and perform other tasks in the interest of the network and the value of the Dash they hold.
ar: يتطلب ماسترنود إجراء صيانة دورية لضمان عدم إسقاط قائمة انتظار الدفع. ويتضمن ذلك تثبيت التحديثات على الفور ، بالإضافة إلى الحفاظ على أمان الخادم وأدائه. بالإضافة إلى ذلك ، يجب أن تصوت ماسترنود على مقترحات وأداء مهام أخرى في مصلحة الشبكة وقيمة داش يحملونها.
es: Los Masternodes requieren mantenimiento regular para asegurar para asegurar que no interrumpe la cola de pago. Esto incluye la instalación inmediata de actualizaciones a Dash, así como el mantener la seguridad y rendimiento del servidor. En adición, los masternodes deben votar las propuestas y llevar a cabo otras tareas por el interés de la red y el valor de Dash que tienen.
fr: Les masternodes impliquent une gestion régulière, pour être certain qu'ils ne soient pas éjectés de la file d'attente des paiements. Cela comprend l'installation sans attendre des mises à jour de Dash, mais aussi certaines opérations de sécurité et de performance sur le serveur. De plus, les masternodes doivent voter sur les propositions et accomplir d'autres tâches dans l'intérêt du réseau et de la valeur en dashs qu'ils représentent.

source: Payment withdrawals
es: Retiros de pagos
fr: Retrait des paiements

source: Once your masternode has been accepted by the network, it will enter the masternode payment queue and slowly begin moving up. A masternode within the top 10% of the list is selected and receives a payment each time a new Dash block is mined. For more details on this process, see here. These payments are sent to the same address you used to start your masternode, which means you need to be careful when withdrawing the payments. The original 1000 DASH payment you used to start your masternode must remain untouched in a single unspent transaction output (utxo) or your masternode will drop off the payment list - you may have seen this ID when preparing to send the start masternode command. Payments appear in separate UTXOs, so we need a method of only spending those UTXOs and not the one containing the 1000 DASH. Note that masternode payouts can only be spent after 100 confirmations.
es: Una vez que tu masternode haya sido aceptado por la red, ingresará en la cola de pagos de masternodes y lentamente comenzará a moverse hacia arriba. Un masternode dentro del 10% superior de la lista se selecciona y recibe un pago cada vez que se mina un nuevo bloque de Dash. Para más detalles sobre este proceso, mira aquí. Estos pagos se envían a la misma dirección que usaste para iniciar tu masternode, lo que significa que debes tener cuidado al retirar los pagos. El pago de 1000 DASH original que usaste para iniciar tu masternode debe permanecer intacto en una única transacción no gastada (utxo) o tu masternode saldrá de la lista de pago - es posible que hayas visto esta identificación cuando te preparabas para enviar el comando de inicio del masternode. Los pagos aparecen en UTXOs por separado, por lo que necesitamos un método para solo gastar esos UTXOs y no el que contiene el 1000 DASH. Ten en cuenta que los pagos de masternodes solo pueden gastarse después de 100 confirmaciones.
fr: Une fois votre masternode accepté par le réseau, il sera placé au bout de la file d'attente des paiements puis se mettra à la remonter lentement. À chaque minage d'un nouveau bloc, un masternode atteignant les 10% supérieurs de la liste sera choisi et recevra un paiement. Pour en savoir plus sur ce processus, voir ici. Ces paiements sont envoyés à l'adresse déjà utilisée pour démarrer votre masternode, ce qui signifie que vous devez être prudent si vous souhaitez retirer les paiements. Le paiement originel de 1000 dashs, utilisé pour démarrer votre masternode, doit rester intact, sous la forme d'une unique transaction de sortie (utxo) non dépensée, sinon votre masternode sera éjecté de la liste d'attente des paiements -- il est probable que vous ayez vu l'identifiant de cette transaction lorsque vous avez préparé la commande de démarrage de masternode. Les paiements apparaissent sous forme de transactions distinctes, donc vous aurez besoin de savoir comment dépenser seulement ces transactions-ci, mais pas celle contenant les 1000 dashs. Veuillez noter que les paiements de masternode ne peuvent être dépensés qu'après 100 confirmations.

source: Option 1: Withdrawals using a hardware wallet
es: Opción 1: Retiros con una billetera de hardware
fr: Option 1 : Retraits avec un portefeuille matériel

source: If you used a hardware wallet such as Trezor to start your masternode, you must also use this process to make payout withdrawals. Once again, we will be using Bertrand256's Dash Masternode Tool (DMT) to select the correct outputs. With DMT, we can select specific UTXOs to withdraw the payments without touching the original collateral transaction. This is not possible using the Trezor web wallet alone.
es: Si usaste una billetera de hardware como Trezor para iniciar tu masternode, también debes usar este proceso para realizar retiros de pagos. Una vez más, utilizaremos la herramienta Dash Masternode (DMT) de Bertrand256 para seleccionar las salidas correctas. Con DMT, podemos seleccionar UTXOs específicos para retirar los pagos sin tocar la transacción de garantía original. Esto no es posible solo con la billetera web Trezor.
fr: Si vous vous êtes servi d'un portefeuille matériel, tel qu'un Trezor, pour démarrer votre masternode, vous devrez également vous en servir pour retirer vos paiements. Une fois de plus, nous utiliserons le logiciel DashMasternodeTool (DMT) de Bertrand256 pour sélectionner les sorties correctes. Avec DMT, nous pouvons choisir des transactions de sortie (UTXO) spécifiques pour retirer les paiements, tout en préservant la transaction originelle de la caution. Cela n'est pas possible avec le portefeuille web Trezor seul.

source: Open DMT and verify the RPC and HW connections are working. From the **Tools** menu, select **Transfer funds from current masternode's address** or **Transfer funds from all masternode's addresses**, if you use DMT to control multiple masternodes.
es: Abre DMT y verifica que las conexiones RPC y HW estén funcionando. Desde el menú **Herramientas**, selecciona **Transferir fondos desde la dirección del masternode actual** o **Transferir fondos desde todas las direcciones de masternode**, si usas DMT para controlar múltiples masternodes.
fr: Lancez DMT et vérifiez que les connexions RPC et HW (matérielle) fonctionnent bien. Dans le menu **Outils**, choisissez **Transférer les fonds depuis l'adresse du masternode actuel**, ou bien **Transférer les fonds depuis toutes les adresses de masternode** si DMT vous sert à gérer plusieurs masternodes.

source: Selecting the transfer funds function in DMT
es: Seleccionar la función de fondos de transferencia en DMT
fr: Choix de la fonction de transfert de fonds dans DMT

source: DMT will load for a moment, then display a window showing the available UTXOs you can use in your withdrawal. By default, all UTXOs not used as masternode collateral are checked. The masternode collateral UTXOs are not only unchecked but also hidden in order to avoid unintentionally sending funds associated with collateral and stopping your masternode. You can show these hidden entries by unchecking the **Hide collateral utxos** option. Enter your destination address for the transaction. The window should appear as follows:
es: DMT se cargará por un momento, luego mostrará una ventana que muestra los UTXOs disponibles que puedes usar en tu retiro. De forma predeterminada, se verifican todos los UTXOs que no se utilizan como garantía del masternode. Los UTXOs de garantía del masternode no solo están desactivados sino que también están ocultos para evitar el envío involuntario de fondos asociados con la garantía y la detención de tu masternode. Puedes mostrar estas entradas ocultas al desmarcar la opción **Ocultar utxos de garantía**. Ingresa tu dirección de destino para la transacción. La ventana debe aparecer de la siguiente manera:
fr: DMT tournera un moment, puis ouvrira une fenêtre montrant les UTXO que vous pouvez utiliser pour votre retrait. Par défaut, toutes les UTXO non utilisées comme caution de masternode sont cochées. Les UTXO de caution de masternode ne sont pas cochées et, en plus, elles sont cachées, dans le but d'éviter de déplacer sans le vouloir des fonds de caution et donc d'arrêter votre masternode. Vous pouvez afficher ces entrées cachées en décochant l'option **Cacher les UTXO de caution**. Saisissez l'adresse de destination de la transaction. La fenêtre doit ressembler à quelque chose comme ceci :

source: Selecting the UTXOs to use as inputs in the withdrawal transaction
es: Seleccionar los UTXOs para usarlos como entradas en la transacción de retiro
fr: Choix des UTXO à utiliser comme entrées de la transaction de retrait

source: Verify the transaction fee and click **Send**. Your Trezor will prompt to enter your PIN and confirm the transaction on the device. Once this is done, confirm one more time to DMT that you want to broadcast the transaction to the network by clicking Yes. A confirmation with the transaction ID will appear.
es: Verifica la comisión de transacción y haz click en **Enviar**. Tu Trezor te pedirá que ingreses tu PIN y confirmes la transacción en el dispositivo. Una vez hecho esto, confirma una vez más a DMT que deseas transmitir la transacción a la red haciendo click en Si. Aparecerá una confirmación con la identificación de la transacción.
fr: Vérifiez la transaction puis cliquez sur **Envoyer**. Votre Trezor vous demandera d'entrer votre code PIN puis de confirmer la transaction sur l'appareil. Une fois fait, confirmez une dernière fois à DMT que vous souhaitez diffuser la transaction au réseau, en cliquant sur Oui. Une confirmation comportant l'identifiant de transaction sera affichée.

source: Confirming broadcast of the transaction to the network
es: Confirmar la transmisión de la transacción a la red
fr: Confirmation de la diffusion de la transaction au réseau

source: Option 2: Withdrawals from Dash Core wallet
es: Opción 2: Retiros desde la billetera Dash Core
fr: Option 2 : Retraits avec le portefeuille logiciel Dash Core

source: Similar to DMT as described above, we need a method in Dash Core wallet to restrict which UTXOs are spent when making withdrawals from a masternode address to ensure that the collateral UTXO is not touched. In Dash Core wallet, this feature is known as Coin Control, and it must be enabled before you can use it. Click **Settings > Options > Wallet > Enable coin control features**. Now, when you go to the **Send** tab in your wallet, a new button labelled **Inputs...** will appear. Click this button to select which UTXOs can be used as input for any transactions you create. The following window appears:
es: Similar a DMT como se describió anteriormente, necesitamos un método en la billetera de Dash Core para restringir qué UTXOs se gastan cuando se realizan retiros de una dirección de masternode para garantizar que no se toque el UTXOs de garantía. En la billetera Dash Core, esta función se conoce como control de monedas, y debe estar habilitada antes de poder usarla. Haz clic en **Configuraciones > Opciones > Billetera > Activar funciones de control de monedas**. Ahora, cuando vayas a la pestaña **Enviar** en tu billetera, aparecerá un nuevo botón con la etiqueta **Entradas ...** Haz clic en este botón para seleccionar qué UTXOs se pueden usar como entrada para cualquier transacción que quieras crear. La siguiente ventana aparecerá:
fr: De manière similaire à la procédure DMT décrite ci-dessus, il nous faut, dans le portefeuille logiciel Dash Core, restreindre les transactions de sortie (UTXO) pouvant être dépensées lors d'un retrait depuis une adresse de masternode, afin de nous assurer que l'UTXO de caution reste intacte. Dans le portefeuille logiciel Dash Core, cette fonction porte le nom de Contrôle des pièces, et elle doit être activée pour pouvoir être utilisée. Allez dans le menu **Réglages > Options > Portefeuille > Activer les fonctionnalités de contrôle des pièces**. Désormais, quand vous irez dans l'onglet **Envoyer** de votre portefeuille, un nouveau bouton **Entrées...** sera affiché. Cliquez sur ce bouton pour choisir les UTXO pouvant servir d'entrées pour les transactions que vous créez. La fenêtre suivante s'affiche :

source: Coin Selection window in Dash Core wallet, showing two masternodes (testnet)
es: Ventana de selección de monedas en la billetera Dash Core, que muestra dos masternodes (red de prueba)
fr: Fenêtre de Contrôle des pièces dans le portefeuille logiciel Dash Core, affichant deux masternodes (du réseau de test)

source: Right click on the transaction(s) showing an amount of 1000 DASH, then select **Lock unspent**. A small lock will appear next to the transaction. Then click **OK**. You can now safely create transactions with your remaining funds without affecting the original collateral UTXOs.
es: Haz clic derecho en la transacción(es) que muestra una cantidad de 1000 DASH, luego selecciona **Bloquear sin gastar**. Aparecerá un pequeño candado junto a la transacción. Luego haz clic en **OK**. Ahora puedes crear transacciones de forma segura con sus fondos restantes sin afectar los UTXOs de garantía originales.
fr: Faites un clic-droit sur la ou les transaction(s) d'un montant de 1000 dashs, puis choisissez **Verrouiller les transactions non dépensées**. Une petite icône en forme de cadenas sera affichée à côté de la transaction. Puis cliquez sur **OK**. Vous pouvez désormais créer des transactions en toute sécurité avec les fonds restants, sans que cela n'affecte les UTXO originelles de la caution.

source: Locking UTXOs in Dash Core wallet
es: Bloquear UTXOs en la billetera Dash Core
fr: Verrouillage de transactions de sortie (UTXO) dans le portefeuille logiciel Dash Core

source: How to update a masternode
es: Cómo actualizar un masternode
fr: Comment mettre à jour un masternode

source: Periodically, the Dash Core development team will release updates to Dash. Since normal nodes rely on them for services and copies of the blockchain, masternodes are expected to update to new versions of Dash and Sentinel promptly. In some cases, hardware upgrades (more CPU, RAM or disk space, or even custom GPU/ASIC hardware) may also be necessary. Not updating will eventually result in your masternode being removed from the payment queue. If you run a hosted masternode, your host will take care of updates for you. If not, the method of updating depends on how you installed Dash.
es: Periódicamente, el equipo de desarrollo de Dash Core lanzará actualizaciones para Dash. Como los nodos normales dependen de ellos para servicios y copias de la cadena de bloques, se espera que los masternodes se actualicen rápidamente a las nuevas versiones de Dash y Sentinel. En algunos casos, las actualizaciones de hardware (más CPU, RAM o espacio en disco, o incluso hardware GPU/ASIC personalizado) también pueden ser necesarias. Si no actualizas, el nodo maestro se eliminará de la cola de pagos. Si ejecutas un masternode alojado, tu proveedor de alojamiento se encargará de las actualizaciones por ti. De lo contrario, el método de actualización depende de cómo hayas instalado Dash.
fr: L'équipe de développement Dash Core publie régulièrement des mises à jour de Dash. Comme les nœuds normaux s'appuient sur les masternodes pour certains services et l'obtention de copies de la blockchain, il est demandé aux masternodes d'appliquer rapidement les mises à jour de Dash et de Sentinel. Dans certains cas, des mises à jour matérielles (plus de puissance processeur, de mémoire vive, d'espace-disque, voire du matériel spécialisé GPU/ASIC) peuvent être aussi nécessaires. Ne pas faire les mises à jour entraîne à terme l'éjection de votre masternode de la file d'attente des paiements. Si votre masternode est hébergé, votre hébergeur fera les mises à jour pour vous. Si ce n'est pas le cas, la méthode de mise à jour dépend de la façon dont vous avez installé Dash Core sur votre serveur.

source: Minor version updates to Dash (e.g. from 0.12.3.1 to 0.12.3.2) do not make changes to the protocol version, while major version updates (e.g. from 0.12.2.3 to 0.12.3.0) will usually increase the network protocol version. If the protocol version did not change, you DO NOT need to restart your masternode if you complete the update within 60 minutes. If the protocol version did change, you must issue a start command from your wallet. Do not send start commands to your masternode if not necessary, as it will send you to the back of the payment queue.
es: Las actualizaciones menores de versiones de Dash (por ejemplo, de 0.12.3.1 a 0.12.3.2) no realizan cambios en la versión de protocolo, mientras que las actualizaciones mayores de versiones (por ejemplo, de 0.12.2.3 a 0.12.3.0) generalmente aumentarán la versión del protocolo de red. Si la versión del protocolo no cambió, NO es necesario que reinicies tu masternode si completas la actualización dentro de 60 minutos. Si la versión del protocolo cambió, debes emitir un comando de inicio desde tu billetera. No envíes comandos de inicio a tu masternode si no es necesario, ya que esto lo enviará al final de la cola de pagos.
fr: Les mises à jour mineures de Dash (par ex. de la version 0.12.3.1 à la 0.12.3.2) ne comportent aucun changement de la version du protocole, cependant que les mises à jour majeures (par ex. de 0.12.2.3 à 0.12.3.0) changent en général la version du protocole de réseau. Si la version du protocole n'a pas changé, vous n'avez PAS besoin de redémarrer votre masternode, du moment que vous avez fait la mise à jour en moins de 60 minutes. Si la version du protocole a changé, vous devez émettre une commande de démarrage depuis votre portefeuille. N'envoyez pas de commande de démarrage de votre masternode si ce n'est pas nécessaire, car cette commande vous renvoie au début de la file d'attente des paiements.

source: Option 1: Automated update using dashman
es: Opción 1: actualización automatizada usando dashman
fr: Option 1 : Mise à jour automatique avec Dashman

source: To update Dash using dashman, log in to your server and enter the following commands::
ar: لتحديث داش باستخدام dashman ، سجّل الدخول إلى خادمك وأدخل الأوامر التالية ::
es: Para actualizar Dash usando dashman, inicia sesión en st servidor e ingresa los siguientes comandos::
fr: Pour faire une mise à jour en utilisant Dashman, connectez-vous à votre serveur et saisissez les commandes suivantes ::

source: Check the status of your masternode::
ar: تحقق من حالة ماسترنود ::
es: Revisa el estado de tu masternode::
fr: Vérifiez l'état de votre masternode ::

source: If you are doing a major version update and need to restart your masternode, update the software version of the wallet holding the collateral to the latest version now by following the instructions :ref:`here <masternode-setup-start>`. Continue monitoring your masternode. After some time, all statuses should turn green, in particular **masternode started: YES** and **masternode network state: ENABLED**.
es: Si estás haciendo una actualización mayor de la versión y necesitas reiniciar tu masternode, actualiza la versión del software de la billetera que contiene la garantía a la última versión, siguiendo las instrucciones :ref:`aquí <masternode-setup-start>`. Continúa monitoreando tu masternode. Después de un tiempo, todos los estados deben tornarse verdes, en particular **masternode iniciado: SI** y **estado de red de masternode: HABILITADO**.
fr: Si vous faites une mise à jour importante et devez redémarrer votre masternode, mettez aussi à jour, sans attendre, le logiciel du portefeuille détenant la caution vers la plus récente version, en suivant les instructions :ref:`ici <masternode-setup-start>`. Surveillez en continu votre masternode. Au bout d'un certain temps, tous les états devraient s'afficher en vert, en particulier **masternode démarré : OUI** et **état réseau du masternode : ACTIVÉ**.

source: Option 2: Manual update
ar: الخيار 2: التحديث اليدوي
es: Opción 2: Actualización de manual
fr: Option 2 : Mise à jour manuelle

source: To update Dash manually, log in to your server using ssh or PuTTY. First we need to stop Dash running::
es: Para actualizar Dash manualmente, inicia sesión en tu servidor usando ssh o PuTTY. Primero tenemos que dejar de ejecutar Dash::
fr: Pour mettre à jour Dash Core manuellement, connectez-vous à votre serveur au moyen de ssh ou de PuTTY. Nous devons d'abord arrêter Dash::

source: To manually download and install the components of your Dash masternode, visit https://www.dash.org/wallets/ on your computer to find the link to the latest Dash Core wallet. Click **Linux**, then right-click on **Download TGZ** for **Dash Core Linux 64 Bit** and select **Copy link address**. Go back to your terminal window and enter the following command, pasting in the address to the latest version of Dash Core by right clicking or pressing **Ctrl + V**::
es: Para descargar e instalar manualmente los componentes de su masternode Dash, visite https://www.dash.org/wallets/ en su computador para encontrar el enlace a la ultima billetera Dash Core. Haga clic en **Linux**, luego clic derecho en **Descargar TGZ** para **Dash Core Linux 64 Bit** y seleccione **Copiar dirección de enlace**. Vaya de nuevo a la ventana terminal e ingrese el siguiente comando, pegando la dirección de la ultima version de Dash Core con clic derecho o presionando **Ctrl + V**::
fr: Pour télécharger et installer manuellement les composants de votre masternode Dash, allez à l'adresse https://www.dash.org/wallets sur votre ordinateur pour trouver le lien du portefeuille Dash Core le plus récent. Cliquez sur **Linux**, puis faites un clic-droit sur **Télécharger TGZ** pour **Dash Core Linux 64 bits** et choisissez **Copier l'adresse du lien**. Revenez à votre fenêtre de terminal et saisissez la commande suivante, en y collant l'adresse de la plus récente version de Dash Core par un clic-droit, ou par la combinaison de touches **Ctrl-V** ::

source: Verify the integrity of your download by running the following command and comparing the output against the value for the file as shown on the Dash website under **Hash File**::
es: Verifica la integridad de tu descarga ejecutando el siguiente comando y comparando la salida con el valor del archivo como se muestra en el sitio web de Dash en **Hash File**::
fr: Vérifiez l'intégrité de votre téléchargement en lançant la commande suivante et en comparant sa valeur de sortie à la valeur du fichier affiché sur le site Dash sous le nom de **Fichier d'empreinte numérique** ::
