Repository: 12Gitcat/docs
Catalog: locale/*/LC_MESSAGES/masternodes/maintenance.po
Languages: ar, es, fr

source: Link to the hash file to verify download integrity
es: Enlaza el archivo hash para verificar la integridad de la descarga
fr: Lien vers le fichier d'empreinte numérique pour vérifier l'intégrité du téléchargement

source: Remove the old binaries from the working directory, extract the compressed archive, copy the new files to the directory and set them as executable::
es: Elimina los archivos binarios antiguos del directorio de trabajo, extrae el archivo comprimido, copia los archivos nuevos en el directorio y configúralos como ejecutables::
fr: Enlevez les vieux exécutables du répertoire de travail, décompressez l'archive compressée, copiez les nouveau fichiers dans le répertoire et rendez-les exécutables ::

source: Clean up unneeded files::
es: Elimina los archivos innecesarios::
fr: Nettoyez les fichiers non nécessaires ::

source: Restart Dash::
ar: إعادت داش::
es: Reinicia Dash::
fr: Redémarrez Dash ::

source: You will see a message reading "Dash Core server starting". We will now update Sentinel::
ar: سترى رسالة تنص على "بدء تشغيل وحدة خدمة الأساسية الأساسية". سنقوم الآن بتحديث الأمان ::
es: Verás un mensaje que dice "Iniciando servidor Dash Core". Ahora actualizaremos Sentinel::
fr: Vous verrez un message disant "Démarrage du serveur Dash Core". Nous allons maintenant mettre à jour Sentinel ::

source: If the protocol version changed during this update, you will need to issue a start command from your wallet. If you are using a hardware wallet, you can issue the start command by simply clicking the button in DMT. If you are using Dash Core wallet, update it to the latest version, then open the debug console and enter this command, where MN1 is the alias for your masternode::
es: Si la versión del protocolo cambió durante esta actualización, deberás emitir un comando de inicio desde tu billetera. Si estás utilizando una billetera de hardware, puedes ejecutar el comando de inicio simplemente haciendo click en el botón en DMT. Si estás utilizando la billetera Dash Core, actualízala a la última versión, abre la consola de depuración e ingresa este comando, donde MN1 es el alias de tu masternode::
fr: Si la version du protocole a changé durant cette mise à jour, vous devrez émettre une commande de démarrage depuis votre portefeuille. Si vous utilisez un portefeuille matériel, vous pouvez émettre la commande de démarrage en cliquant simplement le bouton correspondant dans DMT. Si vous utilisez le portefeuille logiciel Dash Core, mettez-le à jour vers la plus récente version, puis ouvrez la console de débogage et saisissez cette commande, où "MN1" est l'alias de votre masternode ::

source: Monitor the status of your masternode as it starts up::
es: Mnitorea el estado de tu masternode a medida que se inicia::
fr: Surveillez l'état de votre masternode pendant son démarrage ::

source: In particular, the last command should return the status **Masternode successfully started**. If you see an error similar to **Invalid protocol version**, then the protocol version has changed and you must send a start command from your wallet again. You can also monitor the status of your masternode from Sentinel. If Sentinel detects a functioning masternode, the following command should return nothing::
es: En particular, el último comando debería devolver el estado **Masternode iniciado con éxito**. Si ves un error similar a **Versión del protocolo no válida**, entonces la versión del protocolo ha cambiado y debes enviar un comando de inicio desde tu billetera nuevamente. También puedes controlar el estado de tu masternode desde Sentinel. Si Sentinel detecta un masternode funcional, el siguiente comando no devolverá nada::
fr: En particulier, la dernière commande devrait renvoyer l'état **Masternode démarré avec succès**. Si vous voyez une erreur ressemblant à **Version de protocole invalide**, cela signifie que la version du protocole a changé et que vous devez émettre à nouveau une commande de démarrage depuis votre portefeuille. Vous pouvez aussi suivre l'état de votre masternode depuis Sentinel. Si Sentinel détecte un masternode en état de marche, la commande suivante ne devrait rien renvoyer ::

source: Finally, you can check for your masternode by its collateral address using `DashNinja <https://www.dashninja.pl/>`_, or search the consensus list of masternodes using this command and entering your masternode IP address::
es: Finalmente, puedes verificar tu masternode por su dirección de garantía usando `DashNinja <https://www.dashninja.pl/>`_, o buscar en la lista de consenso de masternodes usando este comando e ingresando tu dirección IP de masternode::
fr: Enfin, vous pouvez vérifier l'état de votre masternode par son adresse de caution au moyen de `DashNinja <https://www.dashninja.pl/>`_, ou bien chercher dans la liste consensuelle des masternodes avec cette commande, et en saisissant l'adresse IP de votre masternode ::

source: Finding your position in the payment queue
es: Encontrar su posición en la cola de pago
fr: Trouver votre position dans la file d'attente des paiements

source: Prior to Dash 0.12.4, each masternode may have a slightly different view of the network. In addition, selection from the top 10% of masternodes in the list in the :ref:`selection pool <payment-logic>` is random. This means that there is no definite answer to when your masternode will be selected for payment. However, it is possible to make an approximation based on the time your masternode entered the back of the queue.
es: Antes de Dash 0.12.4, cada masternode puede tener una vista ligeramente diferente de la red. En adición, la selección del top 10% de masternodes en la lista en la :ref:`selección del grupo <payment-logic>` es al azar. Esto significa que no hay una respuesta definitiva de cuando puede su masternode ser seleccionado para pago. Sin embargo, es posible hacer una aproximación basada en el tiempo en que su masternode ingreso al final de la cola.
fr: Dans les versions de Dash antérieures à 0.12.4, chaque masternode peut avoir une vision légèrement différente du réseau. De plus, la sélection dans les 10% supérieurs de la liste du :ref:`groupe de sélection <payment-logic>` est aléatoire. Cela veut dire qu'il n'y a pas de réponse définitive à la question de savoir quand votre masternode sera choisi pour le paiement. Cependant, il est possible d'obtenir une approximation, basée sur le temps depuis lequel votre masternode est entré au bout de la file d'attente.

source: Community members xkcd, Bertrand256 and moocowmoo have all published various tools you can run to determine your approximate position in the payment queue, and bots are available on Discord and Slack as well.
es: Los miembros de la comunidad xkcd, Bertrand256 y moocowmoo han publicado varios bots y herramientas que puede ejecutar para determinar su posición aproximada en la cola de pago, que están disponibles en Discord y Slack.
fr: Xkcd, Bertrand256 et Moocowmoo, membres de la communauté, ont publié différents outils que vous pouvez utiliser pour déterminer votre position approximative dans la file d'attente des paiements, et des robots existent aussi sur Discord et Slack.

source: DashCentral voting, verification and monitoring
ar: داش سنترال و التصويت والتحقق والرصد
es: Votación, verificación y monitoreo de DashCentral
fr: Vote, vérification et suivi avec DashCentral

source: DashCentral is a community-supported website managed by community member Rango. It has become a *de facto* site for discussion of budget proposals and to facilitate voting from a graphical user interface, but also offers functions to monitor masternodes.
ar: داش سنترال هو موقع مدعوم من قبل المجتمع المدار من قبل عضو المجتمع رانجو. لقد أصبح موقعًا * واقعيًا * لمناقشة مقترحات الميزانية وتسهيل عملية التصويت من واجهة مستخدم رسومية ، ولكنه يوفر أيضًا وظائف لمراقبة الأعداد.
es: DashCentral es un sitio web compatible con la comunidad administrado por el miembro de la comunidad Rango. Se ha convertido en un sitio *de facto* para la discusión de propuestas presupuestarias y para facilitar la votación desde una interfaz gráfica de usuario, pero también ofrece funciones para monitorear los masternodes.
fr: DashCentral est un site web communautaire géré par Rango, membre de la communauté. Il est devenu le site *de facto* pour les débats sur les propositions budgétaires et pour accomplir le vote avec une interface graphique, mais il propose aussi diverses fonctions de suivi de masternodes.

source: Adding your masternode to DashCentral
ar: إضافة ماستؤنود الخاص بك إلى داش سنترال
es: Agregar tu masternode a DashCentral
fr: Ajouter votre masternode à DashCentral

source: `Dashcentral <https://www.dashcentral.org/>`_ allows you to vote on proposals from the comfort of your browser. After completing `registration <https://www.dashcentral.org/register>`_, go to the `masternodes <https://www.dashcentral.org/masternodes>`_ page and click the **Add masternode now** button. Enter your collateral address on the following screen:
ar: `داش سنترال <https://www.dashcentral.org/>`_ يسمح لك بالتصويت على المقترحات من راحة متصفحك. بعد الانتهاء `التسجيل <https://www.dashcentral.org/register>`_, إدخب إلى `ماسترنود <https://www.dashcentral.org/masternodes>`_ الصفحة وانقر على زر **إضافة ماسترنود الآن**. أدخل عنوان الضمان الخاص بك على الشاشة التالية:
es: `Dashcentral <https://www.dashcentral.org/>`_ te permite votar propuestas desde la comodidad de tu navegador. Después de completar el `registro <https://www.dashcentral.org/register>`_, ve a la página `masternodes <https://www.dashcentral.org/masternodes>` _ y haz click en el botón **Agregar masternode ahora**. Ingresa tu dirección de garantía en la siguiente pantalla:
fr: `Dashcentral <https://www.dashcentral.org/>`_ vous permet de voter confortablement sur les propositions budgétaires, avec votre navigateur Internet. Après vous être `inscrit <https://www.dashcentral.org/register>`_, allez à la page des `masternodes <https://www.dashcentral.org/masternodes>`_ et cliquez sur le bouton **Ajouter maintenant un masternode**. Saisissez votre adresse de caution sur l'écran suivant ::

source: Adding a masternode to DashCentral
ar: اضافة ماسترنود فب داش سنترال
es: Agregar un masternode a DashCentral
fr: Ajout d'un masternode dans DashCentral

source: Click **Add masternode**. Your masternode has now been added to DashCentral.
ar: انقر **إضافة ماسترنود**. تمت إضافة ماسترنود الخاص بك الآن إلى داش سنترال.
es: Haz click en **Agregar masternode**. Tu masternode ha sido agregado a DashCentral.
fr: Cliquez sur **Ajouter un masternode**. Votre masternode est désormais ajouté à DashCentral.

source: Enabling voting from DashCentral
ar: تمكين التصويت من داش سنترال
es: Habilitar votación desde DashCentral
fr: Activer le vote depuis DashCentral

source: Click **Edit** under **Voting privkeys** to enter your masternode private key to enable voting through the DashCentral web interface. Enter a voting passphrase (not the same as your login password, but equally important to remember!) and enter the private key (the same key you used in the dash.conf file on your masternode) on the following screen:
ar: انقر فوق **تحرير** تحت **مفاتيح الخصوصية الخاصة بالتصويت** لإدخال مفتاحك الخاص الرئيسي لتمكين التصويت عبر واجهة الويب داش سنترال. أدخل عبارة مرور التصويت (ليست هي نفسها كلمة مرور تسجيل الدخول الخاصة بك ، ولكن من المهم تذكرها أيضًا!) وأدخل المفتاح الخاص (نفس المفتاح الذي استخدمته في ملف dash.conf الموجود على ماسترنوظ الخاص بك) على الشاشة التالية:
es: Haz clic en **Editar** en **Llaves privadas de votación** para ingresar la llave privada de tu masternode y permitir la votación a través de la interfaz web de DashCentral. Ingresa una contraseña de votación (no la mismo contraseña de tu inicio de sesión, pero igualmente importante de recordar) e ingresa la llave privada (la misma llave que utilizaste en el archivo dash.conf en tu masternode) en la siguiente pantalla:
fr: Cliquez sur **Modifier**, sous **Clés privées de vote**, pour saisir la clé privée de votre masternode et rendre possible le vote par l'interface web DashCentral. Saisissez une phrase de passe de vote (pas la même que votre mot de passe de connexion, mais dont il faut aussi bien se souvenir !) et saisissez la clé privée (celle que vous avez utilisée dans le fichier "dash.conf" de votre masternode) sur l'écran suivant ::

source: Adding voting privkeys to DashCentral
ar: إضافة مفاتيح حرة للتصويت إلى داش سنترال
es: Agregar llaves privadas de votación a DashCentral
fr: Ajout de clés privées de vote dans DashCentral

source: It is important to note that the private key to start your masternode is unrelated to the private keys to the collateral address storing your 1000 DASH. These keys can be used to issue commands on behalf of the masternode, such as voting, but cannot be used to access the collateral. The keys are encrypted on your device and never stored as plain text on DashCentral servers. Once you have entered the key, click **Store encrypted voting privkeys on server**. You can now vote on proposals from the DashCentral web interface.
ar: من المهم ملاحظة أن المفتاح الخاص لبدء تشغيل ماسترنود لا يرتبط بالمفاتيح الخاصة لعنوان الضمان الذي يخزن 1000 داش. يمكن استخدام هذه المفاتيح لإصدار الأوامر نيابة عن ماسترنود ، مثل التصويت ، ولكن لا يمكن استخدامها للوصول إلى الضمانات. يتم تشفير المفاتيح على جهازك ولا يتم تخزينها كنص عادي على خوادم داش سنترال. بمجرد إدخال المفتاح ، انقر فوق **قم بتخزين مفاتيح تجزئة التصويت المشفرة على الخادم**. يمكنك الآن التصويت على المقترحات من واجهة الويب داش سنترال
es: Es importante tener en cuenta que la llave privada para iniciar tu masternode no está relacionada con las llaves privadas de la dirección de la garantía que almacena tus 1000 DASH. Estas llaves se pueden usar para emitir comandos en nombre del masternode, como votar, pero no se pueden usar para acceder a la garantía. Las llaves están encriptadas en tu dispositivo y nunca se almacenan como texto sin formato en los servidores de DashCentral. Una vez que hayas ingresado la llave, haz click en **Almacenar llaves privadas de votación encriptadas en el servidor**. Ahora puedes votar propuestas desde la interfaz web de DashCentral.
fr: Il est important de noter que la clé privée de démarrage de votre masternode est sans rapport avec les clés privées de l'adresse de caution détenant vos 1000 dashs. Cette clé peut être utilisée pour émettre des commandes au nom du masternode, telles que le vote, mais ne peuvent pas servir à accéder à la caution. Les clés sont chiffrées sur votre ordinateur et ne sont jamais stockées en clair sur les serveurs de DashCentral. Une fois que vous avez saisi la clé, cliquez sur **Stocker sur le serveur les clés privées de vote chiffrées**. Vous pouvez à présent voter sur les propositions budgétaires depuis l'interface web DashCentral.

source: Verifying ownership
ar: التحقق من الملكية
es: Verificación de propiedad
fr: Certification de propriété

source: You can also issue a message from your address to verify ownership of your masternode to DashCentral. Click **Unverified** under **Ownership** and the following screen will appear:
ar: يمكنك أيضًا إصدار رسالة من عنوانك لإثبات ملكية الرمز الخاص بك إلى داش سنترال. انقر غير محقق **تحت الملكية** وستظهر الشاشة التالية:
es: También puedes emitir un mensaje desde tu dirección para verificar la propiedad de tu masternode a DashCentral. Haz click en **No verificado** en **Propiedad** y aparecerá la siguiente pantalla:
fr: Vous pouvez également émettre un message depuis votre adresse pour certifier à DashCentral que vous êtes propriétaire de votre masternode. Cliquez sur **Non vérifié** sous **Propriété** et l'écran suivant s'affichera ::

source: Verifying ownership of your masternode to DashCentral
ar: التحقق من ملكية ماسترنود الخاص بك إلى داش سنترال
es: Verificar la propiedad de tu masternode en DashCentral
fr: Certification à DashCentral de la propriété de votre masternode

source: Instructions on how to sign your collateral address using a software wallet appear. If you are using a hardware wallet other than Trezor, you will need to use the DMT app to sign the address. If you are using the Trezor hardware wallet, go to your `Trezor wallet <https://wallet.trezor.io/>`_, copy the collateral address and click **Sign & Verify**. The following screen will appear, where you can enter the message provided by DashCentral and the address you wish to sign:
ar: تظهر تعليمات حول كيفية توقيع عنوان الضمان الخاص بك باستخدام محفظة برامج. إذا كنت تستخدم محفظة أجهزة أخرى غير Trezor ، فستحتاج إلى استخدام تطبيق DMT لتوقيع العنوان. إذا كنت تستخدم محفظة الأجهزة Trezor ، انتقل إلى الخاص بك `محفظة تريزو <https://wallet.trezor.io/>`_, انسخ عنوان الضمانات وانقر على **تسجيل والتحقق**. ستظهر الشاشة التالية ، حيث يمكنك إدخال الرسالة المقدمة من داش سنترال والعنوان الذي ترغب في توقيعه:
es: Aparecerán instrucciones sobre cómo firmar tu dirección de garantía utilizando una billetera de software. Si estás usando una billetera de hardware que no sea Trezor, deberás usar la aplicación DMT para firmar la dirección. Si estás utilizando la billetera de hardware de Trezor, ve a `Billetera Trezor <https://wallet.trezor.io/>`_, copia la dirección de la garantía y haz clic en **Firmar y Verificar**. Aparecerá la siguiente pantalla, donde puedes ingresar el mensaje proporcionado por DashCentral y la dirección que deseas firmar:
fr: Des instructions sur la manière de signer votre adresse de caution avec un portefeuille logiciel sont affichées. Si vous utilisez un portefeuille matériel qui n'est pas un Trezor, vous devrez utiliser l'application DashMasternodeTool (DMT) pour signer l'adresse. Si vous utilisez le portefeuille matériel Trezor, allez à l'adresse du `portefeuille Trezor <https://wallet.trezor.io/>`_, copiez l'adresse de caution et cliquez sur **Signer & vérifier**. L'écran suivant s'affiche, où vous pouvez saisir le message fourni par DashCentral et l'adresse que vous souhaitez signer ::

source: Signing a message from the Trezor Wallet
ar: توقيع رسالة من محفظة Trezor
es: Firmar un mensaje desde la billetera Trezor
fr: Signature d'un message depuis le portefeuille Trezor

source: Click **Sign**, confirm on your Trezor device and enter your PIN to sign the message. A message signature will appear in the **Signature** box. Copy this signature and paste it into the box on DashCentral and click **Verify ownership**. Verification is now complete.
ar: انقر فوق **تسجيل** ، قم بالتأكيد على جهاز Trezor وأدخل رقم التعريف الشخصي الخاص بك لتوقيع الرسالة. سيظهر توقيع الرسالة في المربع **الإمظاء**. انسخ هذا التوقيع والصقه في المربع الموجود على داش سنترال وانقر على **التحقق من الملكية**. اكتمل التحقق الآن.
es: Haz click en **Firmar**, confirma en su dispositivo Trezor e ingresa tu PIN para firmar el mensaje. Aparecerá una firma de mensaje en el cuadro **Firma**. Copia esta firma y pégala en el recuadro de DashCentral y haz click en **Verificar propiedad**. La verificación ahora está completa.
fr: Cliquez sur **Signer**, confirmez sur votre appareil Trezor et saisissez votre code PIN pour signer le message. Une signature de message apparaîtra dans le champ **Signature**. Copiez cette signature et collez-la dans le champ sur DashCentral, puis cliquez sur **Vérifier la propriété**. La certification est maintenant terminée.

source: Masternode ownership has been successfully verified
ar: تم التحقق من ملكية ماسترنود بنجاح
es: La propiedad del masternode ha sido verificada exitosamente
fr: Propriété du masternode certifiée avec succès

source: Installing the DashCentral monitoring script
ar: تثبيت البرنامج النصي لمراقبة داش سنترال
es: Instalación de la secuencia de comandos de supervisión de DashCentral
fr: Installation du script de suivi DashCentral

source: DashCentral offers a service to monitor your masternode, automatically restart dashd in the event of a crash and send email in the event of an error. Go to the `Account settings <https://www.dashcentral.org/account/edit>`_ page and generate a new API key, adding a PIN to your account if necessary. Scroll to the following screen:
ar: يقدم داش سنترال خدمة لمراقبة ماسترنود الخاص بك ، إعادة تشغيل داش تلقائيا في حالة حدوث تعطل وإرسال البريد الإلكتروني في حالة حدوث خطأ. اذهب الى `إعدادات الحساب <https://www.dashcentral.org/account/edit>`_ الصفحة وإنشاء مفتاح جديد لواجهة برمجة التطبيقات ، مع إضافة رقم تعريف شخصي إلى حسابك إذا لزم الأمر. قم بالتمرير إلى الشاشة التالية:
es: DashCentral ofrece un servicio para monitorear tu masternode, reiniciar automáticamente dashd en caso de falla y enviar un correo electrónico en caso de error. Ve a la página `Configuración de cuenta <https://www.dashcentral.org/account/edit>`_ y genera una nueva llave API, agregando un PIN a tu cuenta si es necesario. Desplázate a la siguiente pantalla:
fr: DashCentral propose un service de suivi de masternode, qui redémarrera automatiquement dashd dans le cas d'un crash, et enverra un message par e-mail dans le cas d'une erreur. Allez sur la page des `réglages de compte <https://www.dashcentral.org/account/edit>`_ et générez une nouvelle clé d'API, en ajoutant si nécessaire un code PIN à votre compte. Défilez jusqu'à l'écran suivant ::

source: Setting up the DashCentral monitoring script
ar: إعداد البرنامج النصي لمراقبة داش سنترال
es: Configuración de la secuencia de comandos de supervisión de DashCentral
fr: Configuration du script de suivi de DashCentral

source: Copy the link to the current version of the dashcentral script by right- click and selecting **Copy link address**. Open PuTTY and connect to your masternode, then type::
ar: انسخ الرابط إلى الإصدار الحالي من البرنامج النصي داش سنترال بالنقر بزر الماوس الأيمن وتحديد **نسخ عنوان الرابط**. فتح PuTTY والاتصال بك ماسترنود ، ثم اكتب ::
es: Copia el enlace a la versión actual de la secuencia de comandos de dashcentral haciendo click derecho y seleccionando **Copiar dirección de enlace**. Abre PuTTY y conéctate a tu masternode, luego escribe::
fr: Copiez le lien de la version la plus récente du script DashCentral en faisant un clic-droit dessus et en choisissant **Copier l'adresse du lien**. Ouvrez votre terminal ou PuTTY et connectez-vous à votre masternode, puis tapez ::

source: Replace the link with the current version of dashcentral-updater as necessary. Decompress the archive using the following command::
ar: استبدال الارتباط مع الإصدار الحالي من المحدث داش سنترال حسب الضرورة. قم بإلغاء ضغط الأرشيف باستخدام الأمر التالي::
es: Reemplaza el enlace con la versión actual del actualizador de dashcentral según sea necesario. Descomprime el archivo usando el siguiente comando::
fr: Remplacez le lien avec celui de la version la plus récente de dashcentral-updater, si nécessaire. Décompressez l'archive avec la commande suivante ::

source: View your masternode configuration details by typing::
ar: عرض تفاصيل تهيئة ماسترنود بكتابة ::
es: Revisa los detalles de configuración de tu masternode escribiendo::
fr: Consultez les détails de configuration de votre masternode en tapant ::

source: Copy the values for ``rpcuser`` and ``rpcpassword``. Then edit the dashcentral configuration by typing::
ar: انسخ قيم ``rpcuser`` و ``rpcpassword``. ثم تحرير التكوين داش سنترال بكتابة ::
es: Copia los valores para ``rpcuser`` y ``rpcpassword``. Luego edita la configuración de dashcentral escribiendo::
fr: Copiez les valeurs de ``rpcuser`` et ``rpcpassword``. Puis modifiez la configuration DashCentral en tapant ::
