Repository: 12Gitcat/docs
Catalog: locale/*/LC_MESSAGES/masternodes/maintenance.po
Languages: ar, es, fr

source: Replace the values for ``api_key``, your masternode collateral address, ``rpc_user``, ``rpc_password``, ``daemon_binary`` and ``daemon_datadir`` according to your system. A common configuration, where ``lwhite`` is the name of the Linux user, may look like this:
ar: استبدل القيم الخاصة بـ ``api_key`` ، والعنوان الضمني لرنايتك البريدية ، و ``rpc_user`` ، و ``rpc_password`` ، و ``daemon_binary`` ، و ``daemon_datadir`` وفقًا للنظام الخاص بك. قد يبدو الشكل الشائع ، حيث ``lwhite`` اسم مستخدم لينكس ، كما يلي:
es: Reemplaza los valores para ``api_key``, tu dirección de garantía de masternode, ``rpc_user``, ``rpc_password``, ``daemon_binary`` y ``daemon_datadir`` de acuerdo a tu sistema. Una configuración común, donde ``lwhite`` es el nombre del usuario de Linux, puede verse así:
fr: Remplacez les valeurs de ``api_key``, de l'adresse de caution de votre masternode, de ``rpc_user``, de ``rpc_password``, de ``daemon_binary`` et ``daemon_datadir`` en fonction de votre système. Une configuration courante, où ``lwhite`` est le nom de l'utilisateur Linux, ressemble à ça ::

source: DashCentral updater configuration file
ar: داش سنترال ملف التكوين التحديث
es: Archivo de configuración del actualizador de DashCentral
fr: Fichier de configuration de dashcentral-updater

source: Press **Ctrl + X** to exit, confirm you want save with **Y** and press **Enter**. Test your configuration by running the dashcentral script, then check the website. If it was successful, you will see that an update has been sent::
ar: اضغط على **Ctrl + X** للخروج ، وتأكد من أنك تريد الحفظ مع **Y** ثم اضغط على **اضغط**. اختبار التكوين الخاص بك عن طريق تشغيل البرنامج النصي داش سنترال ، ثم تحقق من الموقع. إذا نجحت ، سترى أنه قد تم إرسال تحديث ::
es: Presiona **Ctrl + X** para salir, confirma que deseas guardar con **Y** y presiona ** Entrar**. Prueba tu configuración ejecutando el script dashcentral, luego verifica el sitio web. Si fue exitoso, verás que se ha enviado una actualización::
fr: Appuyez sur **Ctrl-X** pour sortir, confirmez l'enregistrement avec **Y** ou **O** et tapez sur **Entrée**. Testez votre configuration en lançant le script DashCentral, puis allez voir le site web. Si tout s'est bien passé, vous constaterez qu'une mise à jour a été transmise ::

source: Manually testing the DashCentral updater
ar: قم باختبار أداة التحديث داش سنترال يدويًا
es: Probar manualmente el actualizador de DashCentral
fr: Test manuel de la mise à jour DashCentral

source: DashCentral updater has successfully sent data to the DashCentral site
ar: لقد قام محدث داش سنترال بإرسال البيانات بنجاح إلى موقع داش سنترال
es: El actualizador de DashCentral ha enviado datos exitosamente al sitio de DashCentral
fr: dashcentral-updater a bien envoyé des données au site DashCentral

source: Once you have verified your configuration is working, we can edit the crontab on your system to schedule the dcupdater script to run every 2 minutes. This allows the system to give you early warning in the event of a fault and will even restart the dashd daemon if it hangs or crashes. This is an effective way to make sure you do not drop off the payment queue. Type the following command::
ar: بمجرد التحقق من عمل التهيئة ، يمكننا تحرير crontab على النظام الخاص بك لجدولة البرنامج النصي dcupdater لتشغيل كل 2 دقائق. وهذا يسمح للنظام بإعطائك إنذارًا مبكرًا في حالة حدوث خطأ وسيعيد تشغيل البرنامج الخفي إذا تم تعليقه أو تعطله. هذه طريقة فعالة للتأكد من عدم قيامك بإسقاط قائمة انتظار الدفع. اكتب الأمر التالي ::
es: Una vez que hayas verificado que tu configuración está funcionando, podemos editar el crontab en tu sistema para programar el script dcupdater para que se ejecute cada 2 minutos. Esto permite que el sistema te avise con anticipación en caso de falla e incluso reiniciará el daemon dashd si se cuelga. Esta es una forma efectiva de asegurarte de no dejar la cola de pagos. Escribe el siguiente comando::
fr: Une fois que vous avez vérifié que votre configuration fonctionne, vous pouvez modifier le fichier crontab sur votre système pour demander l'exécution du script dcupdater toutes les 2 minutes. Cela permet au système de vous envoyer rapidement une alerte en cas de problème, et ça redémarrera même le daemon dashd s'il est gelé ou s'il plante. C'est un moyen efficace de vous assurer de ne pas être éjecté de la file d'attente des paiements. Tapez la commande suivante ::

source: Select an editor if necessary and add the following line to your crontab after the line for sentinel, replacing lwhite with your username on your system::
ar: حدد محررًا إذا لزم الأمر وأضف السطر التالي إلى ملف crontab بعد سطر الحارس ، واستبدل lwhite باسم المستخدم على نظامك:
es: Selecciona un editor si es necesario y agrega la siguiente línea a tu crontab después de la línea para sentinel, reemplazando lwhite con tu nombre de usuario en tu sistema::
fr: Choisissez un éditeur de texte si nécessaire, puis ajoutez la ligne suivante à votre fichier crontab après la ligne concernant Sentinel, en remplaçant "lwhite" par votre nom d'utilisateur sur l'ordinateur ::

source: Editing crontab to run the DashCentral updater automatically
ar: تحرير crontab لتشغيل المحدث داش سنترال تلقائياً
es: Editar crontab para ejecutar automáticamente el actualizador de DashCentral
fr: Modification du fichier crontab pour exécuter automatiquement dashcentral-updater

source: Press **Ctrl + X** to exit, confirm you want save with **Y** and press **Enter**. The dcupdater script will now run every two minutes, restart dashd whenever necessary and email you in the event of an error.
ar: اضغط على **Ctrl + X** للخروج ، وتأكد من أنك تريد الحفظ مع **Y** ثم اضغط على **اضغط**. سيتم تشغيل البرنامج النصي لـ dcupdater الآن كل دقيقتين ، وأعد تشغيل dashd عند الضرورة ، ثم أرسل رسالة بريد إلكتروني إليك في حالة حدوث خطأ.
es: Presiona **Ctrl + X** para salir, confirma que deseas guardar con **Y** y presiona **Entrar**. El script dcupdater ahora se ejecutará cada dos minutos, reiniciará dashd siempre que sea necesario y te enviará un correo electrónico en caso de error.
fr: Tapez **Ctrl-X** pour sortir, confirmez l'enregistrement avec **Y** ou **O** puis appuyez sur **Entrée**. Le script dcupdater se lancera désormais toutes les deux minutes, redémarrera dashd si nécessaire et vous enverra des messages par e-mail en cas d'erreur.

source: Masternode monitoring tools
ar: الأدوات مراقبة ماسترنود
es: Herramientas de monitoreo de masternodes
fr: Outils de suivi de masternode

source: Several sites operated by community members are available to monitor key information and statistics relating to the masternode network.
ar: تتوفر العديد من المواقع التي يديرها أعضاء المجتمع لمراقبة المعلومات والإحصاءات الرئيسية المتعلقة بشبكة ماسترنود.
es: Varios sitios operados por miembros de la comunidad están disponibles para monitorear información clave y estadísticas relacionadas con la red de masternodes.
fr: Plusieurs sites gérés par des membres de la communauté sont disponibles pour surveiller les informations clés et suivre les statistiques du réseau des masternodes.

source: Block Explorers
ar: مستكشف الكتلة
es: Exploradores de bloques
fr: Explorateurs de blocs

source: Since Dash is a public blockchain, it is possible to use block explorers to view the balances of any Dash public address, as well as examine the transactions entered in any given block. Each unique transaction is also searchable by its txid. A number of block explorers are available for the Dash network.
ar: بما أن داش عبارة عن بلوكشين عام ، فمن الممكن استخدام مستكشفين مستعرضين لعرض أرصدة أي عنوان عام من داش ، بالإضافة إلى فحص المعاملات التي تم إدخالها في أي كتلة معينة. كل معاملة فريدة من نوعها هي أيضا قابلة للبحث عن طريق سداسي. يتوفر عدد من المستكشفين المحظورين لشبكة داش.
es: Dado que Dash es una cadena de bloques pública, es posible usar exploradores de bloques para ver los saldos de cualquier dirección pública de Dash, así como examinar las transacciones ingresadas en cualquier bloque dado. Cada transacción única también se puede buscar por su txid. Existen varios exploradores de bloques disponibles para la red Dash.
fr: Puisque Dash est une blockchain publique, il est possible d'utiliser des explorateurs de blocs pour consulter les soldes de n'importe quelle adresse publique Dash, ou bien examiner les transactions insérées dans un bloc donné. Chaque transaction unique peut également être trouvée par son identifiant de transaction. Un certain nombre d'explorateurs de blocs sont disponibles pour le réseau Dash.

source: `CryptoID <https://chainz.cryptoid.info/>`__ offers a `Dash blockchain explorer <https://chainz.cryptoid.info/dash/>`__ and a `function <https://chainz.cryptoid.info/dash/masternodes.dws>`__ to view and map Dash masternodes.
ar: `CryptoID <https://chainz.cryptoid.info/>`__ . يقدم `مستكشف داش <https://chainz.cryptoid.info/dash/>`__ و `وظيفة <https://chainz.cryptoid.info/dash/masternodes.dws>`__ لعرض وتعيين ماسترنود داش.
es: `CryptoID <https://chainz.cryptoid.info/>`__ ofrece un `explorador de la cadena de bloques de Dash <https://chainz.cryptoid.info/dash/>`__ y una `función <https://chainz.cryptoid.info/dash/masternodes.dws>`__ para ver y ubicar los masternodes de Dash.
fr: `CryptoID <https://chainz.cryptoid.info/>`__ propose un `explorateur de la blockchain Dash <https://chainz.cryptoid.info/dash/>`__ et une `fonction <https://chainz.cryptoid.info/dash/masternodes.dws>`__ de visualisation et de cartographie des masternodes Dash.

source: `BitInfoCharts <https://bitinfocharts.com>`_ offers a `page <https://bitinfocharts.com/dash/>`_ of price statistics and information and a `blockchain explorer <https://bitinfocharts.com/dash/explorer/>`__.
ar: `BitInfoCharts <https://bitinfocharts.com>`_ يقدم `صفحة <https://bitinfocharts.com/dash/>`_ من إحصاءات الأسعار والمعلومات و `مستكشف بلوكشين <https://bitinfocharts.com/dash/explorer/>`__.
es: `BitInfoCharts <https://bitinfocharts.com>`_ ofrece una `página <https://bitinfocharts.com/dash/>`_ de las estadísticas de precios e información y un `explorador de cadena de bloques <https://bitinfocharts.com/dash/explorer/>`__.
fr: `BitInfoCharts <https://bitinfocharts.com>`_ propose une `page <https://bitinfocharts.com/dash/>`_ d'information et de statistiques sur le cours, ainsi qu'un `explorateur de blocs <https://bitinfocharts.com/dash/explorer/>`__.

source: `CoinCheckup <https://coincheckup.com/coins/dash/charts>`__ offers a range of statistics and data on most blockchains, including Dash.
ar: `CoinCheckup <https://coincheckup.com/coins/dash/charts>`__ يقدم مجموعة من الإحصاءات والبيانات حول معظم بلوكشين ، بما في ذلك داش.
es: `CoinCheckup <https://coincheckup.com/coins/dash/charts>`__ ofrece una variedad de estadísticas y datos en la mayoría de las cadenas de bloques, incluyendo Dash.
fr: `CoinCheckup <https://coincheckup.com/coins/dash/charts>`__ propose toute une gamme de statistiques et de données sur la plupart des blockchains, dont Dash.

source: `CoinPayments <https://www.coinpayments.net/>`__ offers a simple `Dash blockchain explorer <http://explorer.coinpayments.net/index.php?chain=7>`__.
ar: `CoinPayments <https://www.coinpayments.net/>`__ يقدم `مستكشف بلوكشين داش <http://explorer.coinpayments.net/index.php?chain=7>`__.
es: `CoinPayments <https://www.coinpayments.net/>`__ ofrece un explorador simple de `Cadena de bloques de Dash <http://explorer.coinpayments.net/index.php?chain=7>`__.
fr: `CoinPayments <https://www.coinpayments.net/>`__ propose un `explorateur de blocs Dash <http://explorer.coinpayments.net/index.php?chain=7>`__ simple.

source: `Dash.org <https://www.dash.org/>`__ includes two blockchain explorers at `explorer.dash.org <http://explorer.dash.org/>`__ and `insight.dash.org <http://insight.dash.org/>`__.
ar: Dash.org <https://www.dash.org/>`__ يتضمن اثنين من المستكشفين بلوكشين في `explorer.dash.org <http://explorer.dash.org/>`__ و `insight.dash.org <http://insight.dash.org/>`__.
es: `Dash.org <https://www.dash.org/>`__ incluye dos exploradores de cadena de bloques en `explorer.dash.org <http://explorer.dash.org/>`__ y `insight.dash.org <http://insight.dash.org/>`__.
fr: `Dash.org <https://www.dash.org/>`__ propose deux explorateurs de blocs aux adresses `explorer.dash.org <http://explorer.dash.org/>`__ et `insight.dash.org <http://insight.dash.org/>`__.

source: `Trezor <https://trezor.io/>`__ operates a `blockchain explorer <https ://dash-bitcore1.trezor.io/>`__ powered by a `Dash fork <https://github.com/dashpay/insight-ui-dash>`__ of `insight <https://insight.is/>`__, an advanced blockchain API tool
ar: `Trezor <https://trezor.io/>`__ تعمل `مستكشف بلوكشين <https ://dash-bitcore1.trezor.io/>`__ من طرف `داش فورك <https://github.com/dashpay/insight-ui-dash>`__ على `نظرة <https://insight.is/>`__, أداة متقدمة API بلوكشين
es: `Trezor <https://trezor.io/>`__ opera un `explorador de cadena de bloques <https ://dash-bitcore1.trezor.io/>`__ impulsado por una `bifurcación de Dash <https://github.com/dashpay/insight-ui-dash>`__ de `visión <https://insight.is/>`__, una herramienta API avanzada de cadena de bloques
fr: `Trezor <https://trezor.io/>`__ gère un `explorateur de blocs <https ://dash-bitcore1.trezor.io/>`__ fonctionnant grâce à un `fork Dash <https://github.com/dashpay/insight-ui-dash>`__ d' `Insight <https://insight.is/>`__, un outil sophistiqué d'API blockchain.

source: Dash Masternode Tool
ar: ادوات ماسترنود داش
es: Herramienta Dash Masternode

source: Written and maintained by community member Bertrand256, Dash Masternode Tool (DMT) allows you to start a masternode from all major hardware wallets such as Trezor, Ledger and KeepKey. It also supports functions to vote on proposals and withdraw masternode payments without affecting the collateral transaction.
ar: يتيح لك ادوات ماسترنود داش (DMT) ، الذي قام بكتابته وصيانته من قبل عضو المجتمع Bertrand256 ، بدء تشغيل رمز حديث من جميع محافظ الأجهزة الرئيسية مثل Trezor و Ledger و KeepKey. كما يدعم الوظائف للتصويت على المقترحات وسحب المدفوعات ماسترنود دون التأثير على الصفقة الضمانات.
es: Escrito y mantenido por Bertrand256, miembro de la comunidad, la herramienta Dash Masternode (DMT) te permite iniciar un masternode desde todas los principales billeteras de hardware como Trezor, Ledger y KeepKey. También admite funciones para votar propuestas y retirar pagos de masternode sin afectar la transacción de garantía.
fr: Écrit et géré par Bertrand256, membre de la communauté, DashMasternodeTool (DMT) vous permet de démarrer un masternode depuis tous les principaux portefeuilles matériels, tels que Trezor, Ledger et KeepKey. Il permet également de voter sur les propositions budgétaires et de retirer des paiements de masternode sans affecter la transaction de caution.

source: DASH Ninja, operated by forum member and Dash Core developer elbereth, offers key statistics on the adoption of different versions of Dash across the masternode network. Several features to monitor governance of the Dash, the masternode payment schedule and the geographic distribution of masternodes are also available, as well as a simple blockchain explorer.
ar: يقدم داش نينجا ، الذي يديره عضو في المنتدى ومطور داش كور elbereth ، إحصائيات أساسية حول اعتماد إصدارات مختلفة من داش عبر شبكة ماسترنود. تتوفر أيضًا العديد من الميزات لمراقبة حوكمة داش والجدول الزمني للدفع في ماسترنود والتوزيع الجغرافي للغة ماسترنود ، بالإضافة إلى مستكشف بلوكشين بسيط.
es: DASH Ninja, operado por elbereth, miembro del foro y desarrollador Dash Core, ofrece estadísticas clave sobre la adopción de diferentes versiones de Dash en la red de masternodes. También están disponibles varias funciones para supervisar la governanza de Dash, el calendario de pagos de masternodes y la distribución geográfica de masternodes, así como un explorador simple de la cadena de bloques.
fr: Dash Ninja, géré par Elbereth, développeur Dash Core et membre du forum Dash, propose des statistiques clés sur l'adoption de différentes versions de Dash dans le réseau des masternodes. Plusieurs fonctions sont également disponibles pour suivre la gouvernance de Dash, le calendrier des paiements de masternode et leur distribution géographique, ainsi qu'un explorateur de blocs simple.

source: DashCentral, operated by forum member rango, offers an advanced service to monitor masternodes and vote on budget proposals through an advanced web interface. An `Android app <https://play.google.com/store/apps/detai ls?id=net.paregov.android.dashcentral>`_ is also available.
ar: يقدم داش سنترال ، الذي يديره عضو في المنتدى ، رنجو ، خدمة متطورة لرصد الألقاب والتصويت على مقترحات الميزانية من خلال واجهة ويب متقدمة. ل `تطبيق الأندرويد <https://play.google.com/store/apps/detai ls?id=net.paregov.android.dashcentral>`_ و هو متاح ايضا.
es: DashCentral, operado por rango, miembro del foro, ofrece un servicio avanzado para monitorear los masternodes y votar propuestas de presupuesto a través de una interfaz web avanzada. Una `aplicación Android <https://play.google.com/store/apps/detai ls?id=net.paregov.android.dashcentral>`_ también está disponible.
fr: DashCentral, géré par Rango, membre du forum, propose un service avancé de suivi des masternodes et de vote sur les propositions budgétaires au moyen d'une interface web. Une `application Android <https://play.google.com/store/apps/detai ls?id=net.paregov.android.dashcentral>`_ est également disponible.

source: Masternode.me, operated by forum member and Dash Core developer moocowmoo, offers sequential reports on the price, generation rate, blockchain information and some information on masternodes.
ar: Masternode.me ، يديرها عضو المنتدى و moocowmoo داش كور ، يقدم تقارير متسلسلة عن السعر ، معدل التوليد ، معلومات بلوكشين وبعض المعلومات عن ماسترنود.
es: Masternode.me, operado por el miembro del foro y desarrollador de Dash Core, moocowmoo, ofrece informes secuenciales sobre el precio, la tasa de generación, información sobre la cadena de bloques y algo de información sobre los masternodes.
fr: Masternode.me, géré par Moocowmoo, développeur Dash Core et membre du forum, génère des rapports récurrents sur le cours, le taux de génération, des informations sur la blockchain et sur les masternodes.

source: Dash Masternode Information
ar: معلومات عن ماسترنود داش
es: Información sobre masternodes

source: This site, operated by forum member and Dash Core developer crowning, offers a visual representation of many key statistics of the Dash masternode network, including graphs of the total masternode count over time, price information and network distribution.
ar: يقدم هذا الموقع ، الذي يديره عضو في المنتدى وتتويج مطور داش كور ، تمثيلًا مرئيًا للعديد من الإحصاءات الرئيسية لشبكة ماسترنود داش ، بما في ذلك الرسوم البيانية لإجمالي عدد ماسترنود مع مرور الوقت ، ومعلومات عن الأسعار وتوزيع الشبكة.
es: Este sitio, operado por crowning, miembro del foro y desarrollador de Dash Core, ofrece una representación visual de muchas estadísticas clave de la red de masternodes de Dash, incluyendo gráficos del recuento total de masternodes a lo largo del tiempo, información de precios y distribución de red.
fr: Ce site, géré par Crowning, développeur Dash Core et membre du forum, propose une représentation visuelle de beaucoup de statistiques clés du réseau des masternodes Dash, dont des graphiques du nombre total de masternodes à travers le temps, des informations sur le cours et sur la distribution du réseau.

source: DMT: https://github.com/Bertrand256/dash-masternode-tool
fr: DashMasternodeTool (DMT) : https://github.com/Bertrand256/dash-masternode-tool

source: DASH Ninja
ar: داش نينجا

source: DashCentral
ar: داش سنترال
