Repository: 12Gitcat/docs
Catalog: locale/*/LC_MESSAGES/masternodes/setup.po
Languages: ar, es, ru, zh_cn

source: First, we need to get a new, unused address from the wallet to serve as the owner address. This is different to the collateral address. It must also be used as the voting address if Spork 15 is not yet active. Generate a new address as follows::
ru: Для начала необходимо задать новый, не использовавшийся ранее адрес из кошелька, который будет считаться адресом владельца. Он должен отличаться от залогового адреса. Он так же должен использоваться в качестве адреса для голосования до тех пор, пока Спорк 15 ещё не активирован. Сгенерируйте новый адрес, как показно ниже::

source: Then either generate or choose an existing second address to receive the owner's masternode payouts. It is also possible to use an address external to the wallet::
ru: Затем либо сгенерируйте, либо выберите из существующих второй адрес для получения платежей от владельца мастерноды. Также возможно использовать адрес внешнего кошелька::

source: You can also optionally generate and fund a third address to pay the transaction fee. If you selected an external payout address, you must specify a fee source address. Either the payout address or fee source address must have enough balance to pay the transaction fee, or the final `register_submit` transaction will fail.
ru: Дополнительно можно также создать и пополнить третий адрес для оплаты комиссии за транзакцию. Если вы выбрали внешний адрес для выплаты, то необходимо указать адрес источника оплаты комиссии. Либо адрес для выплат, либо адрес источника комиссии должен иметь достаточный баланс для оплаты комиссии за транзакцию, в противном случае последняя транзакция `register_submit` завершится неудачно.

source: The private keys to the owner and fee source addresses must exist in the wallet submitting the transaction to the network. If your wallet is protected by a password, it must now be unlocked to perform the following commands. Unlock your wallet for 5 minutes::
ru: Приватные ключи владельца и адреса источника оплаты комиссии должны присутствовать в кошельке, отправляющем транзакцию в сеть. Если ваш кошелёк защищён паролем, то для выполнения указанных команд его необходимо разблокировать. Разблокируйте свой кошелёк на 5 минут::

source: We will now prepare an unsigned ProRegTx special transaction using the ``protx register_prepare`` command. This command has the following syntax::
ru: Сейчас мы подготовим неподписанную специальную ProRegTx-транзакцию, использовав команду ``protx register_prepare``. Эта команда имеет следующий синтаксис::

source: Open a text editor such as notepad to prepare this command. Replace each argument to the command as follows:
ru: Откройте текстовый редактор, например Блокнот и подготовьте эту команду. Замените каждый аргумент команды следующим образом:

source: ``collateralHash``: The txid of the 1000 Dash collateral funding transaction
ru: ``collateralHash``: txid транзакции залогового финасирования в размере 1000 DASH

source: ``collateralIndex``: The output index of the 1000 Dash funding transaction
ru: ``collateralIndex``: Индекс выхода транзакции финансирования на 1000 DASH

source: ``ipAndPort``: Masternode IP address and port, in the format ``x.x.x.x:yyyy``
ru: ``ipAndPort``: IP-адрес и порт мастерноды в формате ``x.x.x.x:yyyy``

source: ``ownerKeyAddr``: The new Dash address generated above for the owner/voting address
ru: ``ownerKeyAddr``: Сгенерированный выше новый адрес Dash для владельца/голосования

source: ``operatorPubKey``: The BLS public key generated above (or provided by your hosting service)
ru: ``operatorPubKey``: Публичный BLS-ключ, сгенерированный выше (или предоставленный хостинг-сервисом)

source: ``votingKeyAddr``: The new Dash address generated above, or the address of a delegate, used for proposal voting
ru: ``votingKeyAddr``: Новый адрес Dash, сгенерированный выше или адрес делегата, используемый для голосования по предложениям

source: ``operatorReward``: The percentage of the block reward allocated to the operator as payment
ru: ``operatorReward``: Процент блочной награды, который выделен оператору в качестве оплаты

source: ``payoutAddress``: A new or existing Dash address to receive the owner's masternode rewards
ru: ``payoutAddress``: Новый или существующий адрес Dash для получения платежей от владельца мастерноды

source: ``feeSourceAddress``: An (optional) address used to fund ProTx fee. ``payoutAddress`` will be used if not specified.
ru: ``feeSourceAddress``: (Необязательный) адрес, используемый для финансирования комиссий ProTx. Если не указан, то будет использоваться ``payoutAddress``.

source: Note that the operator is responsible for :ref:`specifying their own reward <dip3-update-service>` address in a separate ``update_service`` transaction if you specify a non-zero ``operatorReward``. The owner of the masternode collateral does not specify the operator's payout address.
ru: Обратите внимание, что оператор несёт ответственность за указание адреса, на который будет начисляться :ref:`его собственная награда <dip3-update-service>` в отдельной транзакции ``update_service`` в случае, если вы укажете отличную от нуля награду ``operatorReward``. Владелец залогового подтверждения не указывает адрес для выплаты оператору.

source: Example (remove line breaks if copying)::
ru: Пример (удалите разрывы строк при копировании)::

source: Output::
ru: Выход::

source: Next we will use the ``collateralAddress`` and ``signMessage`` fields to sign the transaction, and the output of the ``tx`` field to submit the transaction.
ru: Теперь используем поля ``collateralAddress`` и ``signMessage`` для подписания транзакции и поле выхода ``tx`` для отправления транзакции.

source: Sign the ProRegTx transaction
ru: Подписание транзакции ProRegTx

source: We will now sign the content of the ``signMessage`` field using the private key for the collateral address as specified in ``collateralAddress``. Note that no internet connection is required for this step, meaning that the wallet can remain disconnected from the internet in cold storage to sign the message. In this example we will again use Dash Core, but it is equally possible to use the signing function of a hardware wallet. The command takes the following syntax::
ru: Теперь подпишем содержимое поля ``signMessage`` используя приватный ключ для залогового адреса, указанный в ``collateralAddress``. Обратите внимание, что для выполнения этого шага не требуется интернет-соединение, что значит, что для подписи сообщения кошелёк может оставаться отключённым от интернета в состоянии холодного хранилища. В этом примере мы снова используем Dash Core, но в равной степени возможно использовать функцию подписи аппаратного кошелька. Команда имеет следующий синтаксис::

source: Example::
ru: Пример::

source: Submit the signed message
ru: Подтвердите подписанное сообщение

source: We will now submit the ProRegTx special transaction to the blockchain to register the masternode. This command must be sent from a Dash Core wallet holding a balance, since a standard transaction fee is involved. The command takes the following syntax::
ru: Теперь отправим специальную транзакцию ProRegTx для регистрации мастерноды на блокчейне. Данная команда должна быть отправлена из кошелька Dash Core, на котором хранится баланс, поскольку в данном случае взимается стандартная комиссия за транзакцию. Команда имеет следующий синтаксис::

source: Where:
ru: Где:

source: ``tx``: The serialized transaction previously returned in the ``tx`` output field from the ``protx register_prepare`` command
ru: ``tx``: Сериализованная транзакция, ранее возвращённая в поле выхода ``tx`` из ``protx register_prepare``

source: ``sig``: The message signed with the collateral key from the ``signmessage`` command
ru: ``sig``: Сообщение, подписанное залоговым ключом с помощью команды ``signmessage``

source: Your masternode is now registered and will appear on the Deterministic Masternode List after the transaction is mined to a block. You can view this list on the **Masternodes -> DIP3 Masternodes** tab of the Dash Core wallet, or in the console using the command ``protx list valid``, where the txid of the final ``protx register_submit`` transaction identifies your DIP003 masternode. Note again that all functions related to DIP003 will only take effect once Spork 15 is enabled on the network. You can view the spork status using the ``spork active`` command.
ru: Ваша мастернода теперь зарегистрирована и появится в детерминированном списке мастернод после того, как транзакция будет добавлена в блок. Этот список можно посмотреть, перейдя во вкладку **Masternodes -> DIP3 Masternodes** кошелька Dash Core или в консоли, использовав команду ``protx list valid``, где txid последней транзакции ``protx register_submit`` является идентификатором вашей мастерноды DIP003. Ещё раз обратите внимание, что все, относящиеся к DIP003 функции начнут работать только после активации в сети Спорка 15. Проверить статус спорка можно с помощью команды ``spork active``.

source: At this point you can go back to your terminal window and monitor your masternode using ``dashman/dashman status``, by entering ``~/.dashcore/dash-cli masternode status`` or using the **Get status** function in DMT. The final result should appear as follows:
ru: На этом этапе вы можете вернуться в окно терминала и наблюдать за своей мастернодой используя ``dashman/dashman status``, введя ``~/.dashcore/dash-cli masternode status`` или используя функцию **Get status** в DMT. Конечный результат должен быть таким, как показано ниже:

source: dashman status output showing successfully started masternode
ar: خرج حالة dashman تظهر بنجاح ماسترنود
es: salida de estado del dashman que muestra el masternode iniciado exitosamente
ru: Выведенный статус dashman, который сообщает об успешно запущенной мастерноде
zh_cn: dashman状态输出显示成功启动主节点

source: dash, guide, masternodes, trezor
ar: داش، دليل، ملسترنود، تريزور
es: dash, guía, masternodes, trezor
zh_cn: dash，指南，主节点，trezor

source: If you prefer to use a masternode hosting service, several community members provide hosting at `masternode.me <https://masternode.me/>`_, `node40.com <https://www.node40.com/hosting/>`_, `dashmasternode.io <http://dashmasternode.io/>`_ or `masternodehosting <https://masternodehosting.com/>`_. When using these hosting services, all you have to do is send a single transaction of 1000 DASH to a specific address and communicate the transaction ID to the hosting service. Simply follow the steps here.
ar: إذا كنت تفضل استخدام خدمة استضافة ماسترنود ، فإن العديد من أعضاء المجتمع يقدمون الاستضافة على `masternode.me <https://masternode.me/>`_, `node40.com <https://www.node40.com/hosting/>`_, `dashmasternode.io <http://dashmasternode.io/>`_ أو `masternodehosting <https://masternodehosting.com/>`_. عند استخدام خدمات الاستضافة هذه ، كل ما عليك فعله هو إرسال معاملة واحدة من 1000 داش إلى عنوان محدد وإبلاغ معرف المعاملة إلى خدمة الاستضافة. ببساطة اتبع الخطوات هنا.
es: Si prefieres usar un servicio de alojamiento de masternode, varios miembros de la comunidad ofrecen alojamiento en `masternode.me <https://masternode.me/>`_, `node40.com <https://www.node40.com/hosting/>`_, `dashmasternode.io <http://dashmasternode.io/>`_ o `masternodehosting <https://masternodehosting.com/>`_. Al usar estos servicios de alojamiento, todo lo que tienes que hacer es enviar una sola transacción de 1000 DASH a una dirección específica y comunicar la identificación de la transacción al servicio de alojamiento. Simplemente sigue los pasos aquí.
zh_cn: 如果您更喜欢使用主节点托管服务，则有几个社区成员提供主机服务，地址为\ `masternode.me <https://masternode.me/>`_\ 、\ `node40.com <https://www.node40.com/hosting/>`_\ 、\ `dashmasternode.io <http://dashmasternode.io/>`_\ 或\ `masternodehosting <https://masternodehosting.com/>`_\ 。当使用这些托管服务时，您所要做的就是发送1000个达世币的单笔交易到一个特定的地址，并将交易ID传递给托管服务。只要按照此处步骤执行就行了。

source: This guide is heavily based on previous guides written by `Bertrand256 <https://github.com/Bertrand256/dash-masternode- tool/blob/master/README.md>`_, `moocowmoo <https://github.com/moocowmoo/dashman/blob/master/README.md>`_, `tao <https://www.dash.org/forum/threads/taos-masternode-setup-guide-for- dummies-updated-for-12-1.2680/>`_, `BolehVPN <https://dashpay.atlassian.net/wiki/spaces/DOC/pages/24019061>`_ and tungfa. Tao's hugely popular original guide and support thread is available `here <https://www.dash.org/forum/threads/taos-masternode- setup-guide-for-dummies-updated-for-12-1.2680/>`__, as well many more guides for specific cases in this forum.
ar: يعتمد هذا الدليل بشكل كبير على الأدلة السابقة التي كتبتها `Bertrand256 <https://github.com/Bertrand256/dash-masternode- tool/blob/master/README.md>`_, `moocowmoo <https://github.com/moocowmoo/dashman/blob/master/README.md>`_, `tao <https://www.dash.org/forum/threads/taos-masternode-setup-guide-for- dummies-updated-for-12-1.2680/>`_, `BolehVPN <https://dashpay.atlassian.net/wiki/spaces/DOC/pages/24019061>`_ و tungfa. يتوفر دليل أصلي عالي الدعم وموضوع دعم Tao `هنا <https://www.dash.org/forum/threads/taos-masternode- setup-guide-for-dummies-updated-for-12-1.2680/>`__, وكذلك العديد من الأدلة لحالات معينة في هذا المنتدى.
es: Esta guía se basa en gran medida en guías anteriores escritas por `Bertrand256 <https://github.com/Bertrand256/dash-masternode- tool/blob/master/README.md>`_, `moocowmoo <https://github.com/moocowmoo/dashman/blob/master/README.md>`_, `tao <https://www.dash.org/forum/threads/taos-masternode-setup-guide-for- dummies-updated-for-12-1.2680/>`_, `BolehVPN <https://dashpay.atlassian.net/wiki/spaces/DOC/pages/24019061>`_ y tungfa. La popular guía de Tao y soporte están disponibles `aquí <https://www.dash.org/forum/threads/taos-masternode- setup-guide-for-dummies-updated-for-12-1.2680/>`__, así como muchas más guías para casos específicos en este foro.
zh_cn: 本指南主要以\ `Bertrand256 <https://github.com/Bertrand256/dash-masternode- tool/blob/master/README.md>`_\ 、\ `moocowmoo <https://github.com/moocowmoo/dashman/blob/master/README.md>`_\ 、\ `tao <https://www.dash.org/forum/threads/taos-masternode-setup-guide-for- dummies-updated-for-12-1.2680/>`_\ 、\ `BolehVPN <https://dashpay.atlassian.net/wiki/spaces/DOC/pages/24019061>`_\ 和Tungfa先前编写的指南为基础。Tao的非常受欢迎的原创指南和支持线程可在\ `此处 <https://www.dash.org/forum/threads/taos-masternode- setup-guide-for-dummies-updated-for-12-1.2680/>`__\ 浏览，在论坛中还有关于更多具体案例的指南。

source: This guide assumes you are setting up a single masternode for the first time. If you are updating a masternode, see :ref:`here <masternode-update>` instead. You will need:
ar: يفترض هذا الدليل أنك تقوم بإعداد ماسترنود واحد للمرة الأولى. إذا كنت تقوم بتحديث ماسترنود ، انظر :ref:`هنا <masternode-update>` سوف تحتاجه
es: Esta guía asume que esta configurando un masternode por primera vez. En cambio si esta actualizando un masternode, vea :ref:`aquí <masternode-update>`. Necesitara:
zh_cn: 本指南是假设您第一次设置单个主节点。如果您想要更新主节点，请参阅\ :ref:`此处 <masternode-update>`\ 。您将需要：

source: 1000 Dash
ar: 1000 داش
zh_cn: 1000个达世币

source: We also assume you will be working from a Windows computer. However, since most of the work is done on your Linux VPS, alternative steps for using macOS or Linux will be indicated where necessary.
ar: نحن نفترض أيضا أنك ستعمل من جهاز كمبيوتر يعمل بنظام ويندوز. ومع ذلك ، نظرًا لأن معظم العمل يتم على VPS الخاص بـ لينكس ، سيتم الإشارة إلى الخطوات البديلة لاستخدام ماك أو لينكس عند الضرورة.
es: Esta guía también asume que trabajarás desde una computadora con Windows. Sin embargo, dado que la mayor parte del trabajo se realiza en tu VPS de Linux, se indicarán pasos alternativos para usar macOS o Linux cuando sea necesario.
zh_cn: 我们还假设您将在Windows系统上工作。但是，由于大部分工作都会在Linux VPS上完成，因此将在必要时说明使用MacOS或Linux的其他步骤。

source: A VPS, more commonly known as a cloud server, is fully functional installation of an operating system (usually Linux) operating within a virtual machine. The virtual machine allows the VPS provider to run multiple systems on one physical server, making it more efficient and much cheaper than having a single operating system running on the "bare metal " of each server. A VPS is ideal for hosting a Dash masternode because they typically offer guaranteed uptime, redundancy in the case of hardware failure and a static IP address that is required to ensure you remain in the masternode payment queue. While running a masternode from home on a desktop computer is technically possible, it will most likely not work reliably because most ISPs allocate dynamic IP addresses to home users.
ar: إن VPS ، المعروف أكثر باسم خادم السحابة ، هو عبارة عن تثبيت وظيفي كامل لنظام تشغيل (عادة لينكس) يعمل داخل جهاز ظاهري. تسمح الماكينة الافتراضية لموفر VPS بتشغيل أنظمة متعددة على خادم واحد فعلي ، مما يجعله أكثر كفاءة وأرخص بكثير من وجود نظام تشغيل واحد يعمل على "المعدن العاري" لكل خادم. يعد VPS مثاليًا لاستضافة ماسترنود داش لأنها تقدم عادةً مدة تشغيل مضمونة ، وفائض في حالة فشل الأجهزة وعنوان IP ثابت مطلوب لضمان بقائك في قائمة انتظار الدفع في ماسترنود. على الرغم من أن تشغيل جهاز ماسترنود من المنزل على كمبيوتر سطح المكتب أمر ممكن تقنياً ، فإنه لن يعمل على الأرجح بشكل موثوق لأن معظم مزودي خدمات الإنترنت يخصصون عناوين IP ديناميكية للمستخدمين المنزليين
es: Un VPS, mejor conocido como servidor en la nube, es la instalación completamente funcional de un sistema operativo (generalmente Linux) que opera dentro de una máquina virtual. La máquina virtual permite al proveedor de VPS ejecutar múltiples sistemas en un servidor físico, haciéndolo más eficiente y mucho más económico que tener un solo sistema operativo ejecutándose en el "metal base" de cada servidor. Un VPS es ideal para alojar un masternode de Dash porque generalmente ofrecen tiempo de actividad garantizado, en caso de falla de hardware y una dirección IP estática que se requiere para garantizar que permanezca en la cola de pago de masternode. Si bien es técnicamente posible ejecutar un masternode desde tu casa en una computadora de escritorio, lo más probable es que no funcione de manera confiable porque la mayoría de los ISPs asignan direcciones IP dinámicas a los usuarios domésticos.
zh_cn: 通常被称为云服务器的VPS，是在虚拟机中运行的操作系统(通常是Linux)的全功能安装。虚拟机允许VPS提供程序在一台物理服务器上运行多个系统，这使得它比在每台服务器的 “裸金属” 上运行单个操作系统更高效、更便宜。VPS是托管达世币主节点的理想选择，因为它们通常提供有保证的正常运行时间、硬件故障时的冗余以及确保您保持在主节点支付队列中所需的静态IP地址。虽然在家中从桌面计算机上运行主节点在技术上是可能的，但它很可能无法可靠地工作，因为大多数ISPs为家庭用户分配动态IP地址。

source: We will use `Vultr <https://www.vultr.com/>`_ hosting as an example of a VPS, although `DigitalOcean <https://www.digitalocean.com/>`_, `Amazon EC2 <https://aws.amazon.com/ec2>`_, `Google Cloud <https://cloud.google.com/compute/>`_, `Choopa <https://www.choopa.com/>`_ and `OVH <https://www.ovh.com/>`_ are also popular choices. First create an account and add credit. Then go to the Servers menu item on the left and click **+** to add a new server. Select a location for your new server on the following screen:
ar: سوف تستخدم `Vultr <https://www.vultr.com/>`_ استضافة كمثال على VPS ، على الرغم من `DigitalOcean <https://www.digitalocean.com/>`_, `Amazon EC2 <https://aws.amazon.com/ec2>`_, `Google Cloud <https://cloud.google.com/compute/>`_, `Choopa <https://www.choopa.com/>`_ and `OVH <https://www.ovh.com/>`_ هي أيضا خيارات شعبية. قم أولاً بإنشاء حساب وإضافة رصيد. ثم انتقل إلى عنصر القائمة الخوادم على اليسار وانقر فوق **+** لإضافة خادم جديد. حدد موقعًا لخادمك الجديد على الشاشة التالية:
es: Usaremos un alojamiento `Vultr <https://www.vultr.com/>`_ como ejemplo de un VPS, aunque `DigitalOcean <https://www.digitalocean.com/>`_, `Amazon EC2 <https://aws.amazon.com/ec2>`_, `Google Cloud <https://cloud.google.com/compute/>`_, `Choopa <https://www.choopa.com/>`_ y `OVH <https://www.ovh.com/>`_ también son opciones populares. Primero crea una cuenta y agrega crédito. Luego ve al elemento del menú Servidores a la izquierda y haz clic en **+** para agregar un nuevo servidor. Selecciona una ubicación para tu nuevo servidor en la siguiente pantalla:
zh_cn: 我们将使用\ `Vultr <https://www.vultr.com/>`_\ 托管作为VPS的示例，尽管\ `DigitalOcean <https://www.digitalocean.com/>`_\ 、\ `Amazon EC2 <https://aws.amazon.com/ec2>`_\ 、\ `Google Cloud <https://cloud.google.com/compute/>`_\ 、\ `Choopa <https://www.choopa.com/>`_\ 以及\ `OVH <https://www.ovh.com/>`_\ 也都是流行的选择。首先，创建一个帐户并添加信用。然后转到左侧的服务器菜单并单击 **+** 以添加一个新的服务器。在以下屏幕上选择您的新服务器的位置：

source: Select Ubuntu 16.04 x64 as the server type. We use 16.04 instead of the latest version because 16.04 is an LTS release of Ubuntu, which will be supported with security updates for 5 years instead of the usual 9 months.
ar: حدد يوبنتو 16.04 x64 كنوع الخادم. نستخدم الإصدار 16.04 بدلاً من أحدث إصدار لأن 16.04 هو إصدار LTS من يوبنتو ، والذي سيتم دعمه مع تحديثات الأمان لمدة 5 سنوات بدلاً من 9 أشهر المعتادة.
es: Selecciona Ubuntu 16.04 x64 como el tipo de servidor. Usamos 16.04 en lugar de la última versión porque 16.04 es una versión LTS de Ubuntu, que será compatible con actualizaciones de seguridad durante 5 años en lugar de los 9 meses habituales.
zh_cn: 选择Ubuntu16.04x64作为服务器类型。我们使用的是16.04而不是最新版本，因为16.04是Ubuntu的LTS版本，它将支持5年的安全更新，而不是通常的9个月。

source: Finally, in order to prevent brute force password hacking attacks, open the SSH configuration file to disable root login over SSH::
ar: أخيرا ، من أجل منع هجمات القرصنة بكلمات القوة الغاشمة ، قم بفتح ملف إعدادات SSH لتعطيل دخول الجذر عبر SSH ::
es: Finalmente, en orden de prevenir ataques de hackeo de contraseñas por fuerza bruta, abra el archivo de configuración de SSH para deshabilitar el inicio de sesión de root en SSH::
zh_cn: 最后，为了防止暴力密码黑客攻击，请打开SSH配置文件以禁用SSH上的root登录::

source: Locate the line that reads ``PermitRootLogin yes`` and set it to ``PermitRootLogin no``. Directly below this, add a line which reads ``AllowUsers <username>``, replacing ``<username>`` with the username you selected above. The press **Ctrl + X** to close the editor, then **Y** and **Enter** save the file.
ar: حدد السطر الذي يقرأ ``PermitRootLogin yes`` وقم بتعيينه على ``PermitRootLogin no``. مباشرة أدناه ، إضافة خط ما يقرأ ``المستخدمين <username>``، تبديل ``<username>`` مع اسم المستخدم الذي حددته أعلاه. اضغط على **Ctrl + X** لإغلاق المحرر ، ثم **Y** و **ادخل** قم بحفظ الملف.
es: Localiza la linea que dice ``PermitRootLogin yes`` y configura a ``PermitRootLogin no``. Directamente debajo de esta, agregue una linea que diga ``AllowUsers <username>``, remplazando ``<username>`` con el nombre de usuario que seleccionaste. Presione **Ctrl + X** para cerrar el editor, luego **Y** y **Enter** para guardar el archivo.
zh_cn: 找到一行\ ``PermitRootLogin Yes``\ ，并将其设置为\ ``PermitRootLogin no``\ 。在此下面，添加一行内容为\ ``AllowUser <username>``\ ，将\ ``<username>``\ 替换为您在上面选择的用户名。按下\ **Ctrl + X**\ 来关闭编辑器，然后按\ **Y**\ 和\ **Enter**\ 保存该文件。

source: Then reboot the server:
ar: ثم أعد تشغيل الخادم:
es: Luego reinicia el servidor:
zh_cn: 然后重新启动服务器:
