Repository: 12Gitcat/docs
Catalog: locale/*/LC_MESSAGES/masternodes/setup.po
Languages: ar, es, ru, zh_cn

source: The system will show a list of upgradable packages. Press **Y** and **Enter** to install the packages. We will now install a firewall (and some other packages we will use later), add swap memory and reboot the server to apply any necessary kernel updates, and then login to our newly secured environment as the new user::
ar: سيعرض النظام قائمة الحزم القابلة للترقية. اضغط على **Y** و **اضغط** لتثبيت الحزم. سنقوم الآن بتثبيت جدار حماية (وبعض الحزم الأخرى التي سنستخدمها لاحقًا) ، وإضافة ذاكرة مبادلة وإعادة تشغيل الخادم لتطبيق أي تحديثات ضرورية للنواة ، ثم تسجيل الدخول إلى البيئة المؤمنة حديثًا لدينا كمستخدم جديد:
es: El sistema mostrará una lista de paquetes actualizables. Presiona **Y** y **Entrar** para instalar los paquetes. Ahora instalaremos un firewall (y algunos otros paquetes que utilizaremos más adelante), agregaremos memoria de intercambio y reiniciaremos el servidor para aplicar las actualizaciones necesarias del kernel, y luego nos conectaremos a nuestro nuevo entorno seguro como el nuevo usuario::
ru: Система покажет список обновляемых пакетов. Нажмите **Y** и **Enter**, чтобы установить пакеты. Теперь установим брандмауэр (и некоторые другие пакеты, которые будем использовать позже), добавим подкачку памяти и перезагрузим сервер, чтобы применить все необходимые обновления ядра, а затем войдём в нашу новую защищённую среду, как новый пользователь::
zh_cn: 系统将显示可升级软件包的列表。按\ **Y**\ 和\ **Enter**\ 来安装软件包。现在我们将安装防火墙(以及稍后使用的其他软件包)，添加交换内存和重新启动服务器以应用任何必要的内核更新，然后以新用户的身份登录到我们新的安全环境::

source: (press **Y** and **Enter** to confirm)
ar: (اضغط **Y** و **ادخل** للتأكيد)
es: (presiona **Y** y **Entrar** para confirmar)
ru: (нажмите **Y** и **Enter** для подтверждения)
zh_cn: (按\ **Y**\ 和\ **Enter**\ 以确认)

source: Add the following line at the end of the file (press tab to separate each word/number), then press **Ctrl + X** to close the editor, then **Y** and **Enter** save the file.
ar: أضف السطر التالي في نهاية الملف (اضغط على Tab لفصل كل كلمة / رقم) ، ثم اضغط **Ctrl + X** لإغلاق المحرر ، ثم **Y** و **ادخل** احفظ الملف .
es: Agregua la siguiente línea al final del archivo (presiona la pestaña para separar cada palabra/número), luego presiona **Ctrl + X** para cerrar el editor, luego presiona **Y** y **Entrar** para guardar el archivo .
ru: В конце файла добавьте следующую строку (чтобы разделить каждое слово/цифру, нажмите tab), затем нажмите **Ctrl + X**, чтобы закрыть редактор и потом **Y** и **Enter** для сохранения файла.
zh_cn: 在文件末尾添加以下行(按tab键来分隔每个单词/数字)，然后按\ **Ctrl + X**\ 来关闭编辑器，再按\ **Y**\ 和\ **Enter**\ 保存该文件。

source: Finally, in order to prevent brute force password hacking attacks, we will install fail2ban and disable root login over ssh. These steps are optional, but highly recommended. Start with fail2ban::
ru: Наконец, чтобы предотвратить атаки взлома паролей методом "грубой силы", установим fail2ban и отключим root-авторизацию через SSH. Эти шаги не являются обязательными, но выполнить их настоятельно рекомендуется. Начнём с установки fail2ban::

source: Create a new configuration file::
ru: Создайте новый файл конфигурации::

source: And paste in the following configuration::
ru: И вставьте в него следующую конфигурацию::

source: Then press **Ctrl + X** to close the editor, then **Y** and **Enter** save the file. Retart and enable the fail2ban service::
ru: Затем нажмите **Ctrl + X**, чтобы закрыть редактор, а затем **Y** и **Enter**, чтобы сохранить файл. Перезапуститесь и активируйте сервис fail2ban::

source: Next, open the SSH configuration file to disable root login over SSH::
ru: Далее откройте файл конфигурации SSH, чтобы отключить root-авторизацию через SSH::

source: Locate the line that reads ``PermitRootLogin yes`` and set it to ``PermitRootLogin no``. Directly below this, add a line which reads ``AllowUsers <username>``, replacing ``<username>`` with the username you selected above. Then press **Ctrl + X** to close the editor, then **Y** and **Enter** save the file.
ru: Найдите строку с надписью ``PermitRootLogin yes`` и измените её на ``PermitRootLogin no``. Прямо под ней добавьте строку с надписью ``AllowUsers <username>``, заменив ``<username>`` именем пользователя, которое вы задали выше. Затем нажмите **Ctrl + X**, чтобы закрыть редактор, далее **Y** и **Enter**, чтобы сохранить файл.

source: Then reboot the server::
ru: Затем перезагрузите сервер::

source: PuTTY will disconnect when the server reboots.
ar: سوف PuTTY فصل عند إعادة تمهيد الخادم.
es: PuTTY se desconectará cuando el servidor se reinicie.
ru: При перезагрузке сервера PuTTY отсоединится.
zh_cn: 当服务器重新启动时，PuTTY将断开连接。

source: While this setup includes basic steps to protect your server against attacks, much more can be done. In particular, `authenticating with a public key <https://help.ubuntu.com/community/SSH/OpenSSH/Keys>`_ instead of a username/password combination and `enabling automatic security updates <https://help.ubuntu.com/community/AutomaticSecurityUpdates>`_ is advisable. More tips are available `here <https://www.cyberciti.biz/tips/linux-security.html>`__. However, since the masternode does not actually store the keys to any Dash, these steps are considered beyond the scope of this guide.
ru: Несмотря на то, что данная настройка содержит только базовые шаги для защиты вашего сервера от атак, на самом деле можно сделать гораздо больше. В частности, `аутентификацию с публичным ключом <https://help.ubuntu.com/community/SSH/OpenSSH/Keys>`_ вместо комбинации имя пользователя/пароль, а также желательно `активировать автоматические обновления безопасности <https://help.ubuntu.com/community/AutomaticSecurityUpdates>`_. Больше советов доступно `здесь <https://www.cyberciti.biz/tips/linux-security.html>`__. Однако, поскольку мастернода не хранит ключи всех Dash, указанные способы защиты рассматриваются за рамками данного руководства.

source: Send the collateral
ar: أرسل الضمانات
es: Enviar garantía
ru: Отправьте залог
zh_cn: 发送保证金

source: A Dash address with a single unspent transaction output (UTXO) of exactly 1000 DASH is required to operate a masternode. Once it has been sent, various keys regarding the transaction must be extracted for later entry in a configuration file and registration transaction as proof to write the configuration to the blockchain so the masternode can be included in the deterministic list. A masternode can be started from a hardware wallet or the official Dash Core wallet, although a hardware wallet is highly recommended to enhance security and protect yourself against hacking. This guide will describe the steps for both hardware wallets and Dash Core.
ru: Для работы с мастернодой необходим адрес Dash с одним неизрасходованным транзакционным выходом (UTXO), равным ровно 1000 DASH. После того, как он был отправлен, необходимо извлечь различные ключи, касающиеся транзакции, для последующей записи в файл конфигурации и регистрации транзакции в качестве доказательства записи конфигурации в блокчейн, чтобы мастерноду можно было добавить в детерминированный список. Мастернода может быть запущена из аппаратного кошелька или официального кошелька Dash Core, хотя настоятельно рекомендуется использовать аппаратный кошелёк для повышения безопасности и защиты от взлома. В этом руководстве будут описаны шаги настройки запуска как с аппаратного кошелька, так и из кошелька Dash Core.

source: Option 1: Sending from a hardware wallet
ar: الخيار 1: الإرسال من محفظة الأجهزة
es: Opción 1: enviar desde una billetera de hardware
ru: Способ 1: Отправка из аппаратного кошелька
zh_cn: 选项1：从硬件钱包发送

source: Set up your Trezor using the Trezor wallet at https://wallet.trezor.io/ and send a test transaction to verify that it is working properly. For help on this, see :ref:`this guide <hardware-trezor>` - you may also choose to (carefully!) `add a passphrase <https://blog.trezor.io/hide-your-trezor-wallets-with-multiple-passphrases-f2e0834026eb>`_ to your Trezor to further protect your collateral. Create a new account in your Trezor wallet by clicking **Add account**. Then click the **Receive** tab and send exactly 1000 DASH to the address displayed. If you are setting up multiple masternodes, send 1000 DASH to consecutive addresses within the same new account. You should see the transaction as soon as the first confirmation arrives, usually within a few minutes.
ru: Установите и настройте кошелёк Trezor, скачав его с https://wallet.trezor.io/ и отправьте тестовую транзакцию, чтобы убедиться, что всё работает как следует. Для получения справки по этому вопросу смотрите :ref:`эту инструкцию <hardware-trezor>` - также можно (с осторожностью!) выбрать опцию `добавить фразу-пароль <https://blog.trezor.io/hide-your-trezor-wallets-with-multiple-passphrases-f2e0834026eb>`_ для Trezor, чтобы в дальнейшем защитить ваши залоговые средства. Создайте новый аккаунт в кошельке Trezor, кликнув на **Add account**. Затем кликните на вкладку **Receive** и отправьте ровно 1000 DASH на отображаемый адрес. Если хотите запустить несколько мастернод, отправьте 1000 DASH на последующие адреса в той же новой учётной записи. Вы увидите эту транзакцию после первых подтверждений, обычно это происходит в течение нескольких минут.

source: Trezor Wallet Receive tab showing successfully received collateral of 1000 DASH
ar: تريزور محفظة تلقي علامة التبويب تظهر بنجاح تلقى ضمانات من 1000 داش
es: Pestaña de recepción en la billetera Trezor que muestra la garantía recibida con éxito de 1000 DASH
ru: Вкладка Receive из кошелька Trezor, в которой отображается успешно переведённый залог в размере 1000 DASH
zh_cn: Trezor钱包接收选项卡显示成功接收到1000个达世币的保证金

source: Once the transaction appears, click the QR code on the right to view the transaction on the blockchain. Keep this window open as we complete the following steps, since we will soon need to confirm that 15 confirmations exist, as shown in the following screenshot.
ar: بمجرد ظهور المعاملة ، انقر فوق رمز QR الموجود على اليسار لعرض المعاملة على بلوكشين. أبقِ هذه النافذة مفتوحة عندما نكمل الخطوات التالية ، حيث سنحتاج قريبًا إلى تأكيد وجود 15 تأكيدًا ، كما هو موضح في الصورة التالية.
es: Una vez que aparece la transacción, haz click en el código QR a la derecha para ver la transacción en la cadena de bloques. Manten esta ventana abierta mientras completamos los siguientes pasos, ya que pronto necesitaremos confirmar que existen 15 confirmaciones, como se muestra en la siguiente captura de pantalla.
ru: Когда транзакция появится, кликните на QR-код справа, чтобы увидеть транзакцию в блокчейне. Не закрывайте это окно, пока выполняете дальнейшие шаги, поскольку скоро нам понадобится подтвердить, что существует 15 подтверждений транзакции, как показано на скриншоте ниже.
zh_cn: 交易出现后，单击右侧的QR代码，查看区块链上的交易。在我们完成以下步骤时，请保持此窗口打开，因为我们很快将需要确认是否存在如以下屏幕截图所示的15次确认。

source: Trezor blockchain explorer showing 15 confirmations for collateral transfer
ar: مستكشف Trezor بلوكشين يعرض 15 تأكيدًا لنقل الضمانات
es: El explorador Trezor de la cadena de bloques muestra 15 confirmaciones para la transferencia de garantías
ru: Обозреватель блокчейна Trezor показывает, что прошло 15 подтверждений залоговой транзакции
zh_cn: Trezor区块链浏览器为保证金转移显示了15次确认

source: While we are waiting for 15 confirmations, download the latest version of the Dash Masternode Tool (DMT) from the GitHub releases page `here <https://github.com/Bertrand256/dash-masternode-tool/releases>`__. Unzip and run the file. The following window appears.
ar: بينما ننتظر 15 تأكيدًا ، نزّل أحدث إصدار من أداة ماسترنود داش (DMT) من صفحة إصدارات GitHub `هنا <https://github.com/Bertrand256/dash-masternode-tool/releases>`__. بفك وتشغيل الملف. النافذة التالية تظهر.
es: Mientras esperamos 15 confirmaciones, descarga la última versión de la herramienta Dash Masternode (DMT) desde la página de lanzamientos de GitHub `aquí <https://github.com/Bertrand256/dash-masternode-tool/releases>`__. Descomprime y ejecuta el archivo. La siguiente ventana aparecerá.
ru: Во время ожидания завершения 15 подтверждений, загрузите последнюю версию Dash Masternode Tool (DMT) со страницы релизов GitHub `здесь <https://github.com/Bertrand256/dash-masternode-tool/releases>`__. Распакуйте и запустите файл. Появится следующее окно.
zh_cn: 在我们等待15次确认时，从GitHub发布\ `页面 <https://github.com/Bertrand256/dash-masternode-tool/releases>`__\ 下载达世币主节点工具(DMT)的最新版本。解压并运行该文件。以下窗口将出现。

source: Dash Masternode Tool startup screen
ar: شاشة بدء تشغيل أداة ماسترنود داش
es: Pantalla de inicio de la herramienta Dash Masternode
ru: Экран запуска Dash Masternode Tool
zh_cn: 达世币主节点工具启动屏幕

source: Click the third button from the left **Check Dash Network Connection** in the top left corner of the main window to verify that the connection is working. Then connect your Trezor device and click the next button **Test Hardware Wallet Connection** to verify the Trezor connection is working.
ru: Кликните третью кнопку слева **Check Dash Network Connection** в верхнем левом углу главного окна, чтобы убедиться, что соединение работает. Затем соединитесь с вашим устройством Trezor и кликните следующую кнопку **Test Hardware Wallet Connection**, чтобы убедиться, что соединение с Trezor работает.

source: Dash Masternode Tool successful connection confirmations
ar: ماسترنود داش أداة تأكيد الاتصال ناجحة
es: Herramienta Dash Masternode confirmaciones exitosas de conexión
ru: Подтверждения успешного соединения Dash Masternode Tool
zh_cn: 达世币主节点工具成功连接确认

source: We will now use DMT to extract the transaction ID and legacy masternode key (necessary for successful startup during the DIP003 transition period). Carry out the following sequence of steps as shown in this screenshot:
ru: Сейчас, чтобы извлечь ID транзакции и старый ключ мастерноды (который необходим для её успешного запуска во время периода перехода на DIP003), мы используем DMT. Следуйте описанным шагам, как показано на этом скриншоте:

source: Dash Masternode Tool configuration steps
ar: خطوات تهيئة أداة ماسترنود داش
es: Pasos de configuración de la Herramienta Dash Masternode
ru: Шаги настройки Dash Masternode Tool
zh_cn: 达世币工具配置步骤

source: Click the **New** button.
ru: Кликните на кнопку **New**.

source: Ensure you are on the settings page for a Non-deterministic masternode and click **Generate new** to generate a legacy masternode key. Copy this key into a text editor.
ru: Убедитесь, что вы находитесь на странице настроек недетерминированной мастерноды и кликните **Generate new**, чтобы сгенерировать старый ключ мастерноды. Скопируйте этот ключ в текстовый редактор.

source: Click **Alter configuration to deterministic**
ru: Кликните **Alter configuration to deterministic**

source: Enter a name for your masternode. The host name you specified for your VPS above is a good choice.
ru: Введите имя вашей мастерноды. Имя хоста, которое вы указали для VPS выше, является хорошим вариантом.

source: Enter the IP address of your masternode. This was given to you by the VPS provider when you set up the server.
ru: Введите IP-адрес вашей мастерноды. Его вы получили от вашего VPS-провайдера во время настройки сервера.

source: Enter the TCP port number. This should be 9999.
ar: أدخل رقم منفذ TCP. يجب أن يكون هذا 9999.
es: Ingresa el número del puerto TCP. Este debería ser 9999.
ru: Введите номер TCP порта. Он должен быть 9999.
zh_cn: 输入TCP端口号。该端口号应该是9999。

source: Click **Locate collateral** to view unused collateral funding transactions available on the connected hardware wallet. The **Collateral address**, **index** and **Collateral TX hash** fields should be filled automatically
ru: Кликните **Locate collateral** для просмотра неиспользованных транзакций залогового подтверждения, доступных на подключённом аппаратном кошельке. Следующие поля **Collateral address**, **index** и **Collateral TX hash** должны быть заполнены автоматически

source: Dash Masternode Tool with configuration ready to start masternode
ar: داش ماسترنود أداة مع التكوين على استعداد لبدء ماسترنود
es: Herramienta de masternode de Dash con la configuración lista para iniciar el masternode
ru: Теперь Dash Masternode Tool настроен и готов к запуску мастерноды.
zh_cn: 配置就绪的达世币主节点工具可以启动主节点

source: Leave DMT open and continue with the next step: :ref:`installing Dash Core on your VPS <masternode-setup-install-dashcore>`.
ru: Оставьте DMT открытым и далее выполните следующий шаг: :ref:`установка Dash Core на вашем VPS <masternode-setup-install-dashcore>`.

source: Option 2: Sending from Dash Core wallet
ar: الخيار 2: إرسال من محفظة داش كور
es: Opción 2: enviar desde la billetera Dash Core
ru: Способ 2: Отправка из кошелька Dash Core
zh_cn: 选项2：从Dash Core钱包发送

source: Open Dash Core wallet and wait for it to synchronize with the network. It should look like this when ready:
ar: افتح محفظة داش كور وانتظر حتى تتم مزامنتها مع الشبكة. يجب أن تبدو مثل هذه عندما تكون جاهزة:
es: Abre la billetera Dash Core y espera a que se sincronice con la red. Debería verse así esto cuando esté lista:
ru: Откройте кошелёк Dash Core и дождитесь пока он синхронизируется с сетью. По завершении это должно выглядеть вот так:
zh_cn: 打开Dash Core钱包，并等待它与网络同步。当Dash Core钱包准备好的时候应该是这样的:

source: Fully synchronized Dash Core wallet
ar: متزامن تماما داش كور المحفظة
es: Billetera Dash Core totalmente sincronizada
ru: Полностью синхрониируйте кошелёк Dash Core
zh_cn: 完全同步后的Dash Core钱包

source: Click **Tools > Debug console** to open the console. Type the following two commands into the console to generate a legacy masternode key (necessary for successful startup during the DIP003 transition period) and a new Dash address for the collateral::
ru: Кликните **Инструменты > Консоль отладки**, чтобы открыть консоль. В консоль введите следующие две команды для генерации старого ключа мастерноды (это необходимо для успешного запуска во время периода перехода на DIP003), а также новый адрес Dash для залога::

source: Take note of the legacy masternode private key and collateral address, since we will need it later. The next step is to secure your wallet (if you have not already done so). First, encrypt the wallet by selecting **Settings > Encrypt wallet**. You should use a strong, new password that you have never used somewhere else. Take note of your password and store it somewhere safe or you will be permanently locked out of your wallet and lose access to your funds. Next, back up your wallet file by selecting **File > Backup Wallet**. Save the file to a secure location physically separate to your computer, since this will be the only way you can access our funds if anything happens to your computer. For more details on these steps, see :ref:`here <dashcore-backup>`.
ru: Обратите внимание на старый приватный ключ мастерноды и залоговый адрес, так как позже они нам понадобятся. Следующим шагом является защита вашего кошелька (если вы до сих пор этого не сделали). Сначала зашифруйте кошелёк щёлкнув **Настройки > Зашифровать кошелёк**. Необходимо использовать новый и сильный пароль, который вы нигде не использовали ранее. Запишите свой пароль и сохраните его в безопасном месте, в противном случае доступ к кошельку окажется навсегда заблокированным и вы потеряете доступ к своим средствам. Следующим шагом сделайте резервную копию файла вашего кошелька выбрав **Файл > Сделать резервную копию кошелька**. Сохраните файл в безопасном месте, физически отдельном от вашего компьютера, так это будет единственный вариант доступа к вашим средствам, если с вашим компьютером что-то случится. Для получения деталей по этим шагам смотрите информацию :ref:`здесь <dashcore-backup>`.

source: Now send exactly 1000 DASH in a single transaction to the new address you generated in the previous step. This may be sent from another wallet, or from funds already held in your current wallet. Once the transaction is complete, view the transaction in a `blockchain explorer <http://insight.dash.org/insight/>`_ by searching for the address. You will need 15 confirmations before you can start the masternode, but you can continue with the next step at this point already: installing Dash Core on your VPS.
ru: Теперь одиночной транзакцией отправьте сумму, точно равную 1000 DASH на адрес учётной записи, который вы сгенерировали во время выполнения предыдущего шага. Эти деньги можно отправить как с другого кошелька, так и со средств, которые находятся на вашем текущем кошельке. Когда транзакция будет совершена, найдите её по адресу в `обозревателе блокчейна <http://insight.dash.org/insight/>`_ и наблюдайте за ней. Прежде чем вы сможете запустить мастерноду, понадобится 15 подтверждений этой транзакции, но настройку на этом этапе можно продолжать, перейдя на следующий шаг: установка Dash Core на вашем VPS.

source: Install Dash Core
ar: تتبيت داش كور
es: Instalar Dash Core
ru: Установка Dash Core
zh_cn: 安装Dash Core

source: Dash Core is the software behind both the Dash Core GUI wallet and Dash masternodes. If not displaying a GUI, it runs as a daemon on your VPS (dashd), controlled by a simple command interface (dash-cli).
ar: داش كور هو البرنامج وراء كل من محفظة و داش ماسترنود. إذا لم يتم عرض واجهة المستخدم الرسومية ، فإنه يعمل كخادم على (VPS (dashd ، يتم التحكم فيه بواسطة واجهة أوامر بسيطة (dash-cli).
es: Dash Core es el software que está detrás de la billetera Dash Core GUI y Dash masternodes. Si no muestra una GUI, se ejecuta como un daemon en tu VPS (dashd), controlado por una interfaz de comando simple (dash-cli).
ru: Dash Core это ПО, которое объединяет в себе кошелёк с графическим интерфейсом Dash Core и мастерноды Dash. Если графический интерфейс не отображается, то приложение запущено, как демон на VPS (dashd) и контролируется простым командным интерфейсом (dash-cli).
zh_cn: Dash Core是Dash Core GUI钱包和达世币主节点工具后的软件。如果不显示GUI，它将在您的VPS上作为守护进程运行(dashd)，由一个简单的命令接口(dash-cli)控制。

source: Open PuTTY or a console again and connect using the username and password you just created for your new, non-root user. There are two options to install Dash Core, an automated option using a script utility called dashman by Dash Core Team member moocowmoo, and a more complicated option which will allow you to understand all of the key steps involved in preparing your masternode.
ar: افتح PuTTY أو وحدة تحكم مرة أخرى وتواصل باستخدام اسم المستخدم وكلمة المرور اللذين أنشأتهما للتو لمستخدمك الجديد غير الأساسي. هناك خياران لتثبيت داش كور ، وهو خيار تلقائي باستخدام أداة مساعدة نصية تسمى dashman من قِبل moocowmoo من أعضاء فريق داش كور ، وخيار أكثر تعقيدًا يسمح لك بفهم جميع الخطوات الأساسية المتضمنة في إعداد ماسترنود الخاص بك.
es: Abre PuTTY o una consola nuevamente y conéctate utilizando el nombre de usuario y la contraseña que acabas de crear para tu nuevo usuario que no sea raíz. Hay dos opciones para instalar Dash Core, una opción automatizada que utiliza una herramienta de guía llamada dashman por moocowmoo, miembro del equipo Dash Core, y una opción más complicada que te permitirá comprender todos los pasos de llave involucrados en la preparación de tu masternode.
ru: Снова откройте PuTTY или консоль и подключитесь, используя имя пользователя и пароль, которые вы только что создали для своего нового пользователя без root-прав. Существует два варианта установки Dash Core: автоматический вариант с использованием утилиты сценариев dashman от участника команды Dash Core moocowmoo и более сложный вариант, который позволит вам понять все ключевые шаги подготовки вашей мастерноды.
zh_cn: 再次打开PuTTY或控制台，并使用您刚刚为您的新的、non-root用户创建的用户名和密码进行连接。有两种选项可以安装Dash Core，一种是使用脚本实用工具的自动选项，它被Dash Core团队成员moocowmoo称为dashman，另一种选项更复杂，该选项将允许您理解在准备您的主节点过程中所涉及的所有关键步骤。

source: Option 1: Automated installation using dashman
ar: الخيار 1: التثبيت التلقائي باستخدام dashman
es: Opción 1: instalación automatizada usando dashman
ru: Способ 1: Автоматическая инсталляция с использованием dashman
zh_cn: 选项1：使用dashman自动安装
