Repository: 12Gitcat/docs
Catalog: locale/*/LC_MESSAGES/masternodes/setup.po
Languages: ar, es, ru, zh_cn

source: To manually download and install the components of your Dash masternode, visit https://www.dash.org/wallets on your computer to find the link to the latest Dash Core wallet. Click **Linux**, then right-click on **Download TGZ** for **Dash Core Linux 64 Bit** and select **Copy link address**. Go back to your terminal window and enter the following command, pasting in the address to the latest version of Dash Core by right clicking or pressing **Ctrl + V**::
ar: لتنزيل مكونات ماسترنود داش وتثبيتها يدويًا ، تفضل بزيارة https://www.dash.org/wallets على جهاز الكمبيوتر الخاص بك للعثور على رابط لأحدث محفظة داش كور. انقر فوق **لينكس** ، ثم انقر بزر الماوس الأيمن فوق **تنزيل TGZ** لـ ** داش كور في لينكي 64 Bit** وحدد **نسخ رابط العنوان**. ارجع إلى نافذة طرفك وأدخل الأمر التالي ، وقم بلصق العنوان إلى أحدث إصدار من داش كور عن طريق النقر بزر الماوس الأيمن أو الضغط على **Ctrl + V** ::
es: Para descargar manualmente e instalar los componentes de tu masternode Dash, visita https://www.dash.org/wallets en tu computador para encontrar el enlace a la billetera Dash Core mas reciente. Haga clic en **Linux**, luego clic derecho en **Descargar TGZ** para **Dash Core Linux 64 Bit** y selecciona **Copiar dirección de enlace**. Vaya de regreso a la ventana terminal e ingrese el siguiente comando, pegando la dirección a la ultima version de la Dash Core haciendo clic derecho o presionando **Ctrl + V**::
zh_cn: 要手动下载和安装您的主节点组件，请在您的计算机上访问\ https://www.dash.org/wallets \ ，以查找到最新版本Dash Core钱包的链接。单击\ **Linux**\ ，然后右键单击\ **Dash Core Linux 64 Bit**\ 中的\ **下载TGZ**\ ，并选择\ **复制链接地址**\ 。返回到您的终端窗口并输入以下命令，右键单击或按\ **Ctrl + V**\ 将地址粘贴到最新版本的Dash Core上::

source: You can optionally verify the integrity of your download by running the following command and comparing the output against the value for the file as shown on the Dash website under **Hash File**::
ar: يمكنك بشكل اختياري التحقق من سلامة التنزيل عن طريق تشغيل الأمر التالي ومقارنة الإخراج مقابل قيمة الملف كما هو موضح في موقع ويب داش ضمن **Hash ملف** ::
es: Opcionalmente, puedes verificar la integridad de la descarga ejecutando el siguiente comando y comparando la salida con el valor del archivo como se muestra en el sitio web de Dash en **Archivo Hash**::
zh_cn: 您可以通过运行以下程序，并将输出与如在\ **Hash文件**\ 下的Dash网站所示的文件值作比较来选择验证您的下载的完整性::

source: Link to the hash file to verify download integrity
ar: اربط بملف تجزئة للتحقق من سلامة التنزيل
es: Enlaza el archivo hash para verificar la integridad de la descarga
zh_cn: 链接到Hash文件以验证下载完整性

source: You can also optionally verify the authenticity of your download as an official release by Dash Core Team. All releases of Dash are signed using GPG by UdjinM6 with the key ``8359 2BD1 400D 58D9``, `verifiable here on Keybase <https://keybase.io/udjinm6>`_. Import the key, download the ASC file for the current release of Dash and verify the signature as follows::
ar: يمكنك أيضًا بشكل اختياري التحقق من صحة تنزيلك كإصدار رسمي من فريق داش كور. يتم توقيع جميع إصدارات داش باستخدام GPG بواسطة UdjinM6 مع المفتاح ``8359 2BD1 400D 58D9`` ، `يمكن التحقق منها هنا <https://keybase.io/udjinm6>`_. استيراد المفتاح ، قم بتنزيل ملف ASC للإصدار الحالي من داش وتحقق من التوقيع كما يلي ::
es: También puedes verificar opcionalmente la autenticidad de tu descarga como versión oficial del equipo Dash Core. Todos los lanzamientos de Dash están firmados usando GPG por UdjinM6 con la clave ``8359 2BD1 400D 58D9``, `verificables aquí en Keybase <https://keybase.io/udjinm6>`_. Importa la llave, descarga el archivo ASC para la versión actual de Dash y verifica la firma de la siguiente manera::
zh_cn: 您还可以选择验证您的下载作为Dash Core团队发布官方版本的真实性。所有达世币版本的发布都由UdjinM6使用GPG签署，密钥为\ ``8359 2BD1 400D 58D9``\ ，`可以在这里Keybase <https://keybase.io/udjinm6>`_\ 验证。按如下所示导入密钥，下载达世币当前版本的ASC文件并验证签名::

source: Create a working directory for Dash, extract the compressed archive, copy the necessary files to the directory and set them as executable::
ar: قم بإنشاء دليل عمل لـ داش واستخرج الأرشيف المضغوط ونسخ الملفات الضرورية إلى الدليل وتعيينها كملف قابل للتنفيذ::
es: Crea un directorio de trabajo para Dash, extrae el archivo comprimido, copia los archivos necesarios en el directorio y configúralos como ejecutables::
zh_cn: 为达世币创建一个工作目录，解压压缩的归档文件，将必要的文件复制到目录中，并将它们设置为可执行文件::

source: Clean up unneeded files::
ar: تنظيف الملفات غير الضرورية ::
es: Elimina los archivos innecesarios::
zh_cn: 清理不需要的文件::

source: ``masternodeprivkey``: this is the private key you generated in the previous step
ar: ``masternodeprivkey``: هذا هو المفتاح الخاص الذي أنشأته في الخطوة السابقة
es: ``llave privada del masternode``: esta es la llave privada que generaste en el paso anterior
zh_cn: ``masternodeprivkey``\ ：这是您在上一步中生成的私钥

source: Continue with the next step to start your masternode.
ar: تواصل مع الخطوة التالية لبدء ماسترنود الخاص بك.
es: Continuar con el siguiente paso para iniciar tu masternode.
zh_cn: 继续下一步来启动您的主节点。

source: Start your masternode
ar: بدا ماسترنود الخاصة بك
es: Iniciar tu masternode
zh_cn: 启动您的主节点

source: Depending on how you sent your masternode collateral, you will need to start your masternode with a command sent either by your hardware wallet or by Dash Core wallet. Before you continue, you must ensure that your 1000 DASH collateral transaction has at least 15 confirmation, and that dashd is running and fully synchronized with the blockchain on your masternode. See the previous step for details on how to do this. During the startup process, your masternode may pass through the following states:
ar: اعتمادًا على الطريقة التي أرسلت بها ضماناتك على ماسترنود ، ستحتاج إلى بدء ماسترنود باستخدام أمر مرسلة إما عن طريق محفظة الأجهزة أو من خلال محفظة داش كور. قبل المتابعة ، يجب أن تتأكد من أن معاملة ضمانات داش 1000 لديها 15 تأكيدًا على الأقل ، وأن dashd قيد التشغيل ومزامنة كاملة مع بلوكشين على ماسترنود الخاص بك. انظر الخطوة السابقة للحصول على تفاصيل حول كيفية القيام بذلك. أثناء عملية بدء التشغيل ، قد يمرر ماسترنود الخاص بك خلال الحالات التالية:
es: Dependiendo de cómo hayas enviado la garantía de masternode, tendrás que comenzar tu masternode con un comando enviado por tu billetera de hardware o por la billetera Dash Core. Antes de continuar, debes asegurarte de que tu transacción de garantía de 1000 DASH tenga al menos 15 confirmaciones, y ese dashd se esté ejecutando y esté completamente sincronizado con la cadena de bloques en tu masternode. Revisa el paso anterior para detalles sobre cómo hacer esto. Durante el proceso de inicio, tu masternode puede pasar por los siguientes estados:
zh_cn: 根据您发送主节点保证金的方式，您需要使用由您的硬件钱包或Dash Core钱包发送的命令来启动您的主节点。在您继续之前，您必须确保您的1000个达世币交易至少有15次确认，并且该dashd正在运行，并与您的主节点上的区块链完全同步。有关此步骤的详细信息，请参阅上一步。在启动主节点过程中，您的主节点可能经过以下状态:

source: MASTERNODE_SYNC: This indicates the data currently being synchronised in the masternode
ar: MASTERNODE_SYNC: يشير هذا إلى البيانات المتزامنة حاليًا في ماسترنود
es: MASTERNODE_SYNC: Esto indica los datos que se están sincronizando actualmente en el masternode
zh_cn: MASTERNODE_SYNC: 这表示当前正在主节点中被同步的数据

source: MASTERNODE_SYNC_FAILED: Synchronisation could not complete, check your firewall and restart dashd
ar: MASTERNODE_SYNC_FAILED: تعذر إكمال المزامنة ، تحقق من جدار الحماية وأعد تشغيل dashd
es: MASTERNODE_SYNC_FAILED: la sincronización no pudo completarse, verifica su firewall y reinicie dashd
zh_cn: MASTERNODE_SYNC_FAILED: 同步无法完成，请检查您的防火墙并重新启动dashd

source: WATCHDOG_EXPIRED: Waiting for sentinel to restart, make sure it is entered in crontab
ar: WATCHDOG_EXPIRED: في انتظار إعادة تشغيل الحماية ، تأكد من إدخاله في crontab
es: WATCHDOG_EXPIRED: en espera de que sentinel se reinicie, asegúrese de que se ingrese en crontab
zh_cn: WATCHDOG_EXPIRED: 等待sentinel重新启动，确保它被输入到crontab中。

source: NEW_START_REQUIRED: Start command must be sent from wallet
ar: NEW_START_REQUIRED: يجب إرسال أمر البدء من المحفظة
es: NEW_START_REQUIRED: el comando de inicio debe enviarse desde la billetera
zh_cn: NEW_START_REQUIRED: 启动命令必须从钱包中发送

source: PRE_ENABLED: Waiting for network to recognize started masternode
ar: PRE_ENABLED: انتظار الشبكة للتعرف على بدء ماسترنود
es: PRE_ENABLED: Esperando a que la red reconozca el masternode iniciado
zh_cn: PRE_ENABLED: 等待网络识别已启动的主节点

source: ENABLED: Masternode successfully started
ar: تم التمكين: بدأ ماسترنود بنجاح
es: ENABLED: Masternode iniciado exitosamente
zh_cn: ENABLED: 成功启动主节点

source: If you masternode does not seem to start immediately, do not arbitrarily issue more start commands. Each time you do so, you will reset your position in the payment queue.
ar: إذا لم يظهر لك ماسترنود للبدء على الفور ، فلا تصدر أوامر بدء أكثر عشوائية. في كل مرة تفعل ذلك ، ستقوم بإعادة تعيين موقعك في قائمة انتظار الدفع.
es: Si el masternode no parece comenzar inmediatamente, no ejecutes arbitrariamente más comandos de inicio. Cada vez que lo hagas, reiniciarás tu posición en la cola de pagos.
zh_cn: 如果您的主节点似乎没有立即启动，不要任意地发出更多的启动命令。因为每次这样做时，您将重置您在支付队列中的位置。

source: Option 1: Starting from a hardware wallet
ar: الخيار 1: بدء من محفظة الأجهزة
es: Opción 1: Comenzar desde una billetera de hardware
zh_cn: 选项1：从硬件钱包中启动

source: Go back to DMT and ensure that all fields are filled out correctly. Click **Lookup** to find the collateral TX ID for the transaction which transferred the collateral to the address if you were not able to do so earlier. Then click **Start Masternode using Hardware Wallet** and confirm the following two messages:
ar: ارجع إلى DMT وتأكد من ملء جميع الحقول بشكل صحيح. انقر فوق **بحث** للعثور على كود TX المقابل للمعاملة التي نقلت الضمان إلى العنوان إذا لم تكن قادرًا على القيام بذلك في وقت سابق. ثم انقر فوق **بدء ماسترنود باستخدام اجهزة المحفظة** وقم بتأكيد الرسالتين التاليتين:
es: Regresa a DMT y asegúrate de que todos los campos estén completos correctamente. Haz click en **Buscar** para buscar la identificación TX de la garantía para la transacción que transfirió la garantía a la dirección si no fuiste capaz de hacerlo antes. A continuación, haz click en **Iniciar Masternode usando una billetera de hardware** y confirma los dos mensajes siguientes:
zh_cn: 返回DMT并确保所有字段都被正确填写。如果您之前没有能找到保证金交易ID，此时单击\ **查找**\ 以找到转移保证金到入账地址的交易ID。然后单击\ **使用硬件钱包启动主节点**\ ，并确认以下两条消息:

source: Dash Masternode Tool confirmation dialogs to start a masternode
ar: مربعات حوار تأكيد أداة داش ماسترنود لبدء تشغيلها
es: Cuadros de diálogo de confirmación de la Herramienta de masternode de Dash para iniciar un masternode
zh_cn: 启动主节点工具确认对话框

source: At this point you can monitor your masternode using ``dashman/dashman status``, by entering ``~/.dashcore/dash-cli masternode status`` or using the **Get status** function in DMT. You will probably need to wait around 30 minutes as the node passes through the PRE_ENABLED stage and finally reaches ENABLED. Give it some time, the final result should appear as follows:
ar: عند هذه النقطة يمكنك مراقبة ماسترنود الخاص بك باستخدام ``dashman/dashman status`` ، عن طريق إدخال ``~/.dashcore/dash-cli masternode status`` أو باستخدام في DMT. قد تحتاج إلى الانتظار لمدة 30 دقيقة تقريبًا حيث تمر العقدة خلال مرحلة PRE_ENABLED وتصل في النهاية إلى متاح. اعطائها بعض الوقت ، يجب أن تظهر النتيجة النهائية على النحو التالي:
es: En este punto, puedes monitorear tu masternode usando ``dashman/dashman status``, ingresando ``~/.dashcore/dash-cli masternode status`` o usando la función **Obtener estado** en DMT. Probablemente necesites esperar unos 30 minutos a medida que el nodo pasa a través de la etapa PRE_ENABLED y finalmente alcanza ENABLED. Dale algo de tiempo, el resultado final debería aparecer de la siguiente manera:
zh_cn: 此时，您可以通过输入\ ``~/.dashcore/dash-cli masternode status``\ 使用\ ``dashman/dashman status``\ ，或者使用DMT中的\ **获取状态**\ 功能来监测您的主节点。在主节点经过PRE_ENABLED阶段并最终到达 ENABLED阶段，您可能需要等待大约30分钟。一段时间之后，最终结果应显示如下:

source: At this point you can safely log out of your server by typing exit. Congratulations! Your masternode is now running.
ar: في هذه المرحلة ، يمكنك الخروج من الخادم بأمان عن طريق كتابة الخروج. تهانينا! الخاص بك ماسترنود قيد التشغيل الآن.
zh_cn: 此时，您可以通过键入\ ``exit``\ 来安全地注销您的服务器。祝贺您！您的主节点现在正在运行。

source: Option 2: Starting from Dash Core wallet
ar: الخيار 2: ابتداء من محفظة داش كور
es: Opción 2: Comenzar desde la billetera Dash Core
zh_cn: 选项2：从Dash Core钱包启动

source: The first long string is your transaction hash, while the last number is the index. We now need to create a file called *masternode.conf* for this wallet in order to be able to use it to issue the command to start your masternode on the network. Open a new text file in Notepad (or TextEdit on macOS, gedit on Linux) and enter the following information:
ar: السلسلة الطويلة الأولى هي تجزئة المعاملة ، بينما الرقم الأخير هو الفهرس. نحتاج الآن إلى إنشاء ملف يسمى * masternode.conf * لهذه المحفظة حتى تتمكن من استخدامه لإصدار الأمر لبدء الرمز الصوتي الخاص بك على الشبكة. قم بفتح ملف نصي جديد في ملاحظة (أو TextEdit على ماك ، gedit على لينكيس) وأدخل المعلومات التالية:
es: La primera cadena larga es tu hash de transacción, mientras que el último número es el índice. Ahora necesitamos crear un archivo llamado *masternode.conf* para esta billetera a fin de poder usarla para emitir el comando para iniciar tu masternode en la red. Abre un nuevo archivo de texto en el Bloc de notas (o TextEdit en macOS, gedit en Linux) e ingresa la siguiente información:
zh_cn: 第一个长字符串是您的交易hash，而最后一个数字是索引。我们现在需要为这个钱包创建一个名为\ *masternode.conf*\ 的文件，以便能够使用它发出命令，从而启动您在网络上的主节点。在记事本（或macOS上的TextEdit，Linux上的gedit）中打开一个新的文本文件，并输入以下信息:

source: **Label**: Any single word used to identify your masternode, e.g. MN1
ar: **Label**: أي كلمة مفردة تُستخدم لتحديد رمزك الرئيسي ، على سبيل المثال ، MN1
es: **Etiqueta**: cualquier palabra que se use para identificar tu masternode, por Ejemplo MN1
zh_cn: **标签**\ ：用于识别您的主节点的任何单个单词，例如，MN1

source: **IP and port**: The IP address and port (usually 9999) configured in the dash.conf file, separated by a colon (:)
ar: **IP والمنفذ**: عنوان IP والمنفذ (عادة 9999) تم تكوينهما في ملف dash.conf ، مفصولين بنقطتين (:)
es: **IP y puerto**: la dirección IP y el puerto (generalmente 9999) configurados en el archivo dash.conf, separados por dos puntos (:)
zh_cn: **IP和端口**\ ：在dash.conf文件中的IP地址和端口（通常为9999），由冒号（:）分隔

source: **Masternode private key**: This is the result of your masternode genkey command earlier, also the same as configured in the dash.conf file
ar: **المفتاح الخاص ماسترنود**: هذا هو نتيجة الأمر genkey masternode الخاص بك سابقًا ، وهو نفس الشيء الذي تم تكوينه في ملف dash.conf
zh_cn: **主节点私钥**\ ：这是之前主节点genkey命令的结果，也是在dash.conf配置的内容

source: **Transaction hash**: The txid we just identified using masternode outputs
ar: **تجزئة المعاملة**: الرقم الذي حددناه للتو باستخدام مخرجات ماسترنود
zh_cn: **交易hash**\ ：我们刚才使用主节点outputs标识的txid

source: **Index**: The index we just identified using masternode outputs
ar: **انديكس**: المؤشر الذي حددناه للتو باستخدام مخرجات ماسترنود
zh_cn: **索引**\ ：我们刚才使用主节点outputs标识的索引

source: Enter all of this information on a single line with each item separated by a space, for example::
ar: أدخل جميع هذه المعلومات في سطر واحد مع كل عنصر مفصولة بمسافة ، على سبيل المثال ::
es: Ingresa toda esta información en una sola línea con cada elemento separado por un espacio, por ejemplo::
zh_cn: 在单行中输入这些信息的所有内容，每个条目用空格分隔，例如::

source: Save this file in the **DashCore** data folder on the PC running the Dash Core wallet using the filename *masternode.conf*. You may need to enable **View hidden items** to view this folder. Be sure to select **All files** if using Notepad so you don't end up with a *.conf.txt* file extension by mistake. For different operating systems, the DashCore folder can be found in the following locations (copy and paste the shortcut text into the **Save** dialog to find it quickly):
ar: احفظ هذا الملف في مجلد البيانات **داش كور** على جهاز الكمبيوتر الذي يشغل محفظة داش كور باستخدام اسم الملف * masternode.conf*. قد تحتاج إلى تمكين **عرض العناصر المخفية** لعرض هذا المجلد. تأكد من تحديد **جميع الملفات** إذا كنت تستخدم دفتر الملاحظات حتى لا ينتهي الأمر بامتداد الملف * .conf.txt* عن طريق الخطأ. بالنسبة لأنظمة التشغيل المختلفة ، يمكن العثور على مجلد داش كور في المواقع التالية (قم بنسخ نص الاختصار ولصقه في مربع الحوار ** حفظ ** للعثور عليه بسرعة)
es: Guarda este archivo en la carpeta de datos **DashCore** en la PC que ejecuta la billetera Dash Core usando el nombre de archivo *masternode.conf*. Es posible que debas habilitar **Ver elementos ocultos** para ver esta carpeta. Asegúrate de seleccionar **Todos los archivos** si usa el Bloc de notas para que no termines por error con una extensión de archivo *.conf.txt *. Para diferentes sistemas operativos, la carpeta DashCore se puede encontrar en las siguientes ubicaciones (copia y pega el texto de acceso directo en el cuadro de diálogo **Guardar** para encontrarlo rápidamente):
zh_cn: 将此文件保存在PC上的\ **Dash Core**\ 数据文件夹中，使用文件名\ *masternode.conf*\ ，运行Dash Core钱包。您可能需要启用 **查看隐藏项** 来查看此文件夹。如果使用记事本，请确保选择\ **所有文件**\ ，这样就不会出现\ *.conf.txt*\ 文件扩展名错误。对于不同的操作系统，可以在以下位置找到DashCore文件夹（复制并粘贴快捷文本到\ **保存**\ 对话框以快速找到Dash Core文件夹）:

source: Platform
ar: المنصة
es: Plataforma
zh_cn: 平台

source: Path
ar: مسار
es: Ruta
zh_cn: 路径

source: Shortcut
ar: الاختصار
es: Atajo
zh_cn: 快捷方式

source: Linux
ar: لينكس

source: macOS
ar: ماك

source: Windows
ar: ويندوز

source: Now close your text editor and also shut down and restart Dash Core wallet. Dash Core will recognize masternode.conf during startup, and is now ready to activate your masternode. Go to **Settings > Unlock Wallet** and enter your wallet passphrase. Then click **Tools > Debug console** again and enter the following command to start your masternode (replace MN1 with the label for your masternode)::
ar: الآن أغلق محرر النص الخاص بك وأيضا اغلاق وإعادة تشغيل داش كور المحفظة. ستتعرف داش كور على masternode.conf أثناء بدء التشغيل ، وهي جاهزة الآن لتنشيط ماسترنود الخاص بك. انتقل إلى **الإعدادات> فتح المحفظة** وأدخل عبارة المرور الخاصة بك. ثم انقر فوق **الأدوات> تصحيح الأخطاء وحدة التحكم** مرة أخرى وأدخل الأمر التالي لبدء ماسترنود الخاص بك (استبدال MN1 مع التسمية ل ماسترنود الخاص بك) ::
es: Ahora cierra tu editor de texto y también cierra y reinicia la billetera Dash Core. Dash Core reconocerá masternode.conf durante el inicio, y ahora está lista para activar tu masternode. Ve a **Configuración > Desbloquear billetera** e ingresa tu contraseña de la billetera. A continuación, haz click nuevamente en **Herramientas > Consola de depuración** e ingresa el siguiente comando para iniciar tu masternode (reemplaza MN1 con la etiqueta de tu masternode)::
zh_cn: 现在关闭您的文本编辑器，而且关闭并重新启动Dash Core钱包。Dash Core将在启动过程中识别masternode.conf，并在此时准备激活您的主节点。转到\ **设置 > 解锁钱包**\ 并输入您的钱包密码。然后再次单击\ **工具 > 调试控制台**\ ，并输入以下命令来启动您的主节点(用您的主节点的标签替换MN1)::

source: At this point you can go back to your terminal window and monitor your masternode using ``dashman/dashman status``, by entering ``~/.dashcore/dash- cli masternode status`` or using the **Get status** function in DMT. You will probably need to wait around 30 minutes as the node passes through the PRE_ENABLED stage and finally reaches ENABLED. Give it some time, the final result should appear as follows:
ar: في هذه المرحلة ، يمكنك الرجوع إلى نافذة طرفك ومراقبة الرمز الخاص بك باستخدام ``dashman/dashman status`` ، عن طريق إدخال ``~/.dashcore/dash- cli masternode status`` أو باستخدام **الحصول على الحالة** وظيفة في DMT. قد تحتاج إلى الانتظار لمدة 30 دقيقة تقريبًا حيث تمر العقدة خلال مرحلة PRE_ENABLED وتصل في النهاية إلى متاح. اعطائها بعض الوقت ، يجب أن تظهر النتيجة النهائية على النحو التالي:
zh_cn: 此时，您可以返回到您的终端窗口，并通过输入\ ``~/.dashcore/dash- cli masternode status``\ 使用\ ``dashman/dashman status``\ ，或者使用DMT上的\ **获取状态**\ 功能来监测您的主节点。在节点经过PRE_ENABLED阶段并最终到达ENABLED阶段时，您可能需要等待大约30分钟。一段时间之后，最终的结果应显示如下:

source: **Masternode private key**: This is the result of your ``masternode genkey`` command earlier, also the same as configured in the dash.conf file
es: **Llave privada de masternode**: Este es el resultado de tu comando ``masternode genkey`` que utilizaste anteriormente, también el mismo que se configuró en el archivo dash.conf

source: **Transaction hash**: The txid we just identified using ``masternode outputs``
es: **Hash de transacción**: el txid que acabamos de identificar usando ``masternode outputs``

source: **Index**: The index we just identified using ``masternode outputs``
es: **Índice**: el índice que acabamos de identificar usando ``masternode outputs``

source: At this point you can go back to your terminal window and monitor your masternode using ``dashman/dashman status``, by entering ``~/.dashcore/dash-cli masternode status`` or using the **Get status** function in DMT. You will probably need to wait around 30 minutes as the node passes through the PRE_ENABLED stage and finally reaches ENABLED. Give it some time, the final result should appear as follows:
es: En este punto, puedes regresar a la ventana de tu terminal y monitorear tu masternode usando ``dashman/dashman status``, ingresando ``~/.dashcore/dash-cli masternode status`` o usando la función **Obtener estado** en DMT. Probablemente necesitarás esperar unos 30 minutos a medida que el nodo pasa a través de la etapa PRE_ENABLED y finalmente alcanza ENABLED. Dale algo de tiempo, el resultado final debería aparecer de la siguiente manera:
