Repository: 12Gitcat/docs
Catalog: locale/*/LC_MESSAGES/masternodes/setup.po
Languages: ar, es, ru, zh_cn

source: While this setup includes basic steps to protect your server against attacks, much more can be done. In particular, `authenticating with a public key <https://help.ubuntu.com/community/SSH/OpenSSH/Keys>`_ instead of a username/password combination, `installing fail2ban <https://www.linode.com/docs/security/using-fail2ban-for-security>`_ to block login brute force attacks and `enabling automatic security updates <https://help.ubuntu.com/community/AutomaticSecurityUpdates>`_ is advisable. More tips are available `here <https://www.cyberciti.biz/tips /linux-security.html>`__. However, since the masternode does not actually store the keys to any Dash, these steps are considered beyond the scope of this guide.
ar: بينما يتضمن هذا الإعداد الخطوات الأساسية لحماية الخادم الخاص بك من الهجمات ، يمكن القيام بالكثير. خاصه، `هنا <https://help.ubuntu.com/community/SSH/OpenSSH/Keys>`_ بدلاً من تركيبة اسم المستخدم / كلمة المرور ، `تتبيث <https://www.linode.com/docs/security/using-fail2ban-for-security>`_
es: Mientras esta configuración incluye pasos básicos para proteger tu servidor contra ataques, mucho mas puede hacerse. En particular, `autenticando con una llave publica <https://help.ubuntu.com/community/SSH/OpenSSH/Keys>`_ en ves de una combinación nombre de usuario/contraseña, `instalando fail2ban <https://www.linode.com/docs/security/using-fail2ban-for-security>`_ para bloquear ataques de inicio de sesión por fuerza bruta y `habilitando las actualizaciones de seguridad automáticas <https://help.ubuntu.com/community/AutomaticSecurityUpdates>`_ es recomendado. Mas tips están disponibles `aquí <https://www.cyberciti.biz/tips /linux-security.html>`__. Sin embargo, desde que los masternodes actualmente no almacenan las llaves de ningún Dash, estos pasos son considerados mas allá del alcance de esta guía.
zh_cn: 虽然此设置包括保护您的服务器免受攻击的基本步骤，但还可以做更多的工作。特别是\ `使用公钥 <https://help.ubuntu.com/community/SSH/OpenSSH/Keys>`_\ 而不是用户名/密码组合来进行身份验证，\ `安装Fail2ban <https://www.linode.com/docs/security/using-fail2ban-for-security>`_\ 来阻止登录暴力攻击，且可以\ `启动自动安全升级 <https://help.ubuntu.com/community/AutomaticSecurityUpdates>`_\ 。更多提示可以在\ `此处 <https://www.cyberciti.biz/tips /linux-security.html>`__\ 获得。但是，由于主节点实际上并不存储任何Dash的密钥，这些步骤被认为超出了本指南的范围。

source: A Dash address with a single unspent transaction output (UTXO) of exactly 1000 DASH is required to operate a masternode. Once it has been sent, various keys regarding the transaction must be extracted for later entry in a configuration file as proof that the transaction was completed successfully. A masternode can be started from a hardware wallet or the official Dash Core wallet, although a hardware wallet is highly recommended to enhance security and protect yourself against hacking. This guide will describe the steps for both hardware wallets and Dash Core.
ar: مطلوب عنوان داش مع إخراج معاملة غير منفقة (UTXO) لـ داش 1000 بالضبط لتشغيل ماسترنود. بمجرد إرسالها ، يجب استخراج المفاتيح المختلفة المتعلقة بالصفقة للإدخال لاحقًا في ملف تهيئة كدليل على اكتمال المعاملة بنجاح. يمكن بدء تشغيل ماسترنود من محفظتك أو محفظة داش كور الرسمية ، على الرغم من أنه يُنصح بشدة باستخدام حافظة للأجهزة لتعزيز الأمان وحماية نفسك من الاختراق. سيصف هذا الدليل الخطوات لكل من محفظات الأجهزة و داش كور.
es: Se requiere una dirección de Dash con una única salida de transacción no gastada (UTXO) de exactamente 1000 DASH para operar un masternode. Una vez que se ha enviado, se deben extraer varias llaves con respecto a la transacción para su posterior ingreso en un archivo de configuración como prueba de que la transacción se completó con éxito. Se puede iniciar un masternode desde una billetera de hardware o desde la billetera oficial de Dash Core, aunque se recomienda encarecidamente una billetera de hardware para mejorar la seguridad y protegerse contra los hackers. Esta guía describirá los pasos para las billeteras de hardware y las billeteras Dash Core.
zh_cn: 要操作一个主节点，需要一个带有单个未花费的交易输出(UTXO)为1000个达世币的钱包地址。一旦交易被发送，必须提取有关交易的各种密钥，以便稍后在配置文件中输入，来证明交易已经被成功完成。一个主节点可以从硬件钱包或官方的Dash Core钱包开始，尽管强烈推荐使用硬件钱包来增强安全性和保护自己免受黑客攻击。该指南将描述硬件钱包和Dash Core钱包的步骤。

source: Set up your Trezor using the Trezor wallet at https://wallet.trezor.io/ and send a test transaction to verify that it is working properly. For help on this, see :ref:`this guide <hardware-trezor>` - you may also choose to (carefully!) `add a passphrase <https://blog.trezor.io/hide- your-trezor-wallets-with-multiple-passphrases-f2e0834026eb>`_ to your Trezor to further protect your collateral. Create a new account in your Trezor wallet by clicking **Add account**. Then click the **Receive** tab and send exactly 1000 DASH to the address displayed. If you are setting up multiple masternodes, send 1000 DASH to consecutive addresses within the same new account. You should see the transaction as soon as the first confirmation arrives, usually within a few minutes.
ar: قم بإعداد Trezor باستخدام محفظة Trezor على https://wallet.trezor.io/ وأرسل معاملة تجريبية للتحقق من أنها تعمل بشكل صحيح. للمساعدة في هذا ، انظر :ref:`هنا <hardware-trezor>` يمكنك أيضًا اختيار (بعناية!) `إضافة هده الجملة <https://blog.trezor.io/hide- your-trezor-wallets-with-multiple-passphrases-f2e0834026eb>`_ إلى Trezor الخاص بك لمزيد من حماية ضماناتك. قم بإنشاء حساب جديد في محفظة Trezor الخاصة بك من خلال النقر على **اضافة حساب**. ثم انقر فوق علامة التبويب **استقبال** وأرسل بالضبط 1000 داش إلى العنوان المعروض. إذا كنت تقوم بإعداد ماسترنود متعددة ، فأرسل 1000 داش إلى عناوين متتالية داخل نفس الحساب الجديد. يجب أن تشاهد المعاملة بمجرد وصول التأكيد الأول ، عادة في غضون بضع دقائق.
es: Configura tu Trezor usando la billetera Trezor en https://wallet.trezor.io/ y envía una transacción de prueba para verificar que esta funcionando apropiadamente. Para ayuda con esto, vea :ref:`esta guía<hardware-trezor>` - también puedes elegir (¡cuidadosamente!) `agregar una contraseña <https://blog.trezor.io/hide- your-trezor-wallets-with-multiple-passphrases-f2e0834026eb>`_ a su Trezor para proteger aun mas su garantía. Crea una cuenta nueva en tu billetera Trezor haciendo clic en **Agregar cuenta**. Entonces haz clic en la pestaña **Recibir** y envía exactamente 1000 DASH a la dirección que se muestra. Si estas configurando múltiples masternodes, envía 1000 DASH a direcciones consecutivas con la misma cuenta nueva. Deberías ver la transacción tan pronto como la primera confirmación llegue, usualmente en unos minutos.
zh_cn: 使用\ https://wallet.trezor.io/\ 上的Trezor钱包设置您的Trezor，并发送一个测试交易以验证它是否正常工作。有关此方面的帮助，请参阅\ :ref:`此处 <hardware-trezor>`\ 。您也可以（小心）选择\ `在Trezor中添加一个密码 <https://blog.trezor.io/hide- your-trezor-wallets-with-multiple-passphrases-f2e0834026eb>`_\ 以进一步保护您的保证金。单击\ **添加账户**\ 以在您的Trezor钱包中添加一个新的账户。然后单击\ **接收**\ 选项卡，并准确地向所显示的地址发送1000个达世币。如果您正在设置多个主节点，则向同一新帐户内的连续地址发送1000个达世币。您应该在第一笔确认到达时立即查看交易，通常需要几分钟。

source: Click **Check RPC connection** in the top left corner of the main window to verify that the connection is working. Then connect your Trezor device and click **Test HW** to verify the Trezor connection is working.
ar: انقر فوق **تحقق من اتصال RPC** في الزاوية العلوية اليمنى من النافذة الرئيسية للتحقق من عمل الاتصال. ثم قم بتوصيل جهاز Trezor الخاص بك وانقر فوق **تجربت HW** للتحقق من عمل اتصال Trezor.
es: Haz clic en **Comprobar conexión RPC** en la esquina superior izquierda de la ventana principal para verificar que la conexión funciona. Luego, conecta tu dispositivo Trezor y haz click en **Probar HW** para verificar que la conexión Trezor esté funcionando.
zh_cn: 在主窗口的左上角单击\ **检查RPC连接**\ ，以验证连接是否正常。然后连接您的Trezor设备，并单击\ **测试 HW**\ 来验证Trezor连接是否正常。

source: We will now use DMT to extract the transaction ID. Carry out the following sequence of steps as shown in this screenshot from DMT developer Bertrand256:
ar: سنستخدم الآن DMT لاستخراج معرّف المعاملة. قم بتنفيذ التسلسل التالي من الخطوات كما هو موضح في لقطة الشاشة هذه من مطور Bertrand256:
es: Ahora usaremos DMT para extraer la identificación de la transacción. Realiza la siguiente secuencia de pasos como se muestra en esta captura de pantalla del desarrollador de DMT Bertrand256:
zh_cn: 现在我们将使用DMT提取交易ID。按DMT开发人员Bertrand 256的屏幕截图所示执行以下步骤顺序：

source: Enter the name of your masternode here. This should match the hostname as defined when setting up your server, dashmn1 in this case. You can view this in the first line of the output of dashman/dashman status.
ar: أدخل اسم ماسترنود الخاص بك هنا. يجب أن يتطابق هذا مع اسم المضيف كما هو محدد عند إعداد الخادم الخاص بك ، dashmn1 في هذه الحالة. يمكنك عرض هذا في السطر الأول من إخراج حالة dashman / dashman.
es: Ingresa el nombre de tu masternode aquí. Esto debería coincidir con el nombre de alojamiento como se define al configurar tu servidor, dashmn1 en este caso. Puedes ver esto en la primera línea de la salida del estado de dashman/dashman.
zh_cn: 在此处输入您的主节点名称。在本例中，该名称应该与您设置服务器dashmn1时定义的主机名相匹配。您可以在dashman/dashman状态输出的第一行中查看这该名称。

source: Enter the IP address of your masternode here. This was given to you by the VPS provider when you set up the server.
ar: أدخل عنوان IP الخاص بك من ماسترنود هنا. تم إعطاؤك هذا بواسطة موفر VPS عند إعداد الخادم.
es: Ingresa la dirección IP de tu masternode aquí. Esto te fue entregado por el proveedor de VPS cuando configuraste el servidor.
zh_cn: 在此处输入您主节点的IP地址。该IP地址是由VPS提供程序在您设置服务器时提供给您的。

source: Click Generate new to generate a new masternode private key.
ar: انقر فوق إنشاء جديدة لإنشاء مفتاح خاص ماسترنود جديد.
es: Haz click en Generar nueva para generar una nueva llave privada de masternode.
zh_cn: 单击Generate new以生成新的主节点私钥。

source: Copy the collateral address where you sent the 1000 DASH collateral from your Trezor Wallet and paste it in this field.
ar: قم بنسخ عنوان الضمانات حيث أرسلت الضمانة 1000 داش من محفظة Trezor الخاصة بك وقم بلصقه في هذا الحقل.
es: Copia la dirección de la garantía a donde enviaste la garantía de 1000 DASH desde tu billetera Trezor y pégala en este campo.
zh_cn: 复制您从Trezor钱包发送1000个达世币的钱包地址，并将其粘贴到此字段中。

source: Click the arrow → to derive the BIP32 path from your collateral address. You can verify this against the BIP32 path shown on the receive tab in your Trezor Wallet for the transaction.
ar: انقر فوق السهم → لاشتقاق مسار BIP32 من عنوان الضمان الخاص بك. يمكنك التحقق من ذلك مقابل مسار BIP32 الموضح في علامة التلقي في محفظة Trezor الخاصة بك لإجراء المعاملة.
es: Haz click en la flecha → para derivar la ruta BIP32 de tu dirección de garantía. Puedes verificar esto contra la ruta BIP32 que se muestra en la pestaña de recepción en tu billetera Trezor para la transacción.
zh_cn: 单击箭头 → 以从您的保证金地址派生BIP32路径。您可以通过您Trezor钱包的接收选项卡中显示的BIP 32路径来验证这一点，以获取交易。

source: Click Lookup to find the collateral TX ID for the transaction which transferred the collateral to the address. You can verify this against the TX ID shown on the confirmation page of the blockchain explorer for your collateral address.
ar: انقر فوق "بحث" للعثور على كود TX المقابل للمعاملة التي نقلت الضمانات إلى العنوان. يمكنك التحقق من ذلك مقابل معرف TX الظاهر في صفحة التأكيد الخاصة بمستكشف بلوكشين لعنوانك الضمني.
es: Haz clic en Buscar para encontrar la identificación de la garantía de TX para la transacción que transfirió la garantía a la dirección. Puedes verificar esto con la identificación de TX que se muestra en la página de confirmación del explorador de la cadena de bloques para tu dirección de garantía.
zh_cn: 单击查找以找到交易的保证金交易 ID，也就是存有保证金的钱包地址。您可以根据区块链浏览器的确认页面上显示的交易 ID来验证这一点，以获取您的保证金地址。

source: Leave DMT open, take note of the masternode private key and collateral address and continue with the next step: :ref:`installing Dash Core on your VPS <masternode-setup-install-dashcore>`.
ar: اترك DMT مفتوحًا ، واحفظ عنوان المفتاح الخاص والعنوان الضمني للماسترنود واستمر في الخطوة التالية :ref:`هتا <masternode-setup-install-dashcore>`.
es: Deja abierto el DMT, toma nota de la llave privada de masternode y la dirección de la garantía y continúa con el siguiente paso :ref:`instalar Dash Core en tu VPS <masternode-setup-install-dashcore>`.
zh_cn: 保持DMT打开，记录主节点私钥和保证金地址，然后继续下一步：\ :ref:`在您的VPS上安装Dash Core钱包 <masternode-setup-install-dashcore>`\ 。

source: Click **Tools > Debug console** to open the console. Type the following two commands into the console to generate a masternode key and get a fresh address::
ar: انقر فوق **الأدوات> وحدة تحكم التصحيح** لفتح وحدة التحكم. اكتب الأمرين التاليين في وحدة التحكم لإنشاء مفتاح ماسترنود والحصول على عنوان جديد ::
es: Haz click en **Herramientas > Consola de depuración** para abrir la consola. Escribe los siguientes dos comandos en la consola para generar una llave de masternode y obtener una nueva dirección::
zh_cn: 单击\ **工具 > 调试控制台**\ 以打开控制台。在控制台中键入以下两个命令以生成一个主节点密钥，并获得一个新地址::

source: Generating a masternode private key in Dash Core wallet
ar: توليد مفتاح خاص ماسترنود في محفظة داش كور
es: Generar una llave privada de masternode en la billetera Dash Core
zh_cn: 在Dash Core钱包中生成主节点私钥

source: Take note of the masternode private key and collateral address, since we will need it later. The next step is to secure your wallet (if you have not already done so). First, encrypt the wallet by selecting **Settings > Encrypt wallet**. You should use a strong, new password that you have never used somewhere else. Take note of your password and store it somewhere safe or you will be permanently locked out of your wallet and lose access to your funds. Next, back up your wallet file by selecting **File > Backup Wallet**. Save the file to a secure location physically separate to your computer, since this will be the only way you can access our funds if anything happens to your computer. For more details on these steps, see :ref:`here <dashcore-backup>`.
ar: يحيط علما المفتاح الخاص ورمز الماسترنادي ، لأننا سنحتاج لاحقا. الخطوة التالية هي تأمين محفظتك (إذا لم تكن قد قمت بذلك بالفعل). أولاً ، قم بتشفير المحفظة من خلال تحديد **الإعدادات> تشفير المحفظة**. يجب عليك استخدام كلمة مرور قوية وجديدة لم تستخدمها من قبل في مكان آخر. خذ علما بكلمة المرور الخاصة بك وقم بتخزينها في مكان آمن أو سيتم إقفالها نهائيًا من محفظتك وفقدان إمكانية الوصول إلى أموالك. بعد ذلك ، قم بعمل نسخة احتياطية من ملف المحفظة الخاص بك بتحديد **ملف> استراد المحفظة**. قم بحفظ الملف إلى مكان آمن منفصل فعليًا عن الكمبيوتر الخاص بك ، لأن هذه ستكون الطريقة الوحيدة التي يمكنك من خلالها الوصول إلى أموالك إذا حدث أي شيء لجهاز الكمبيوتر الخاص بك. لمزيد من التفاصيل حول هذه الخطوات ، راجع :ref:`هنا <dashcore-backup>`.
es: Toma nota de la llave privada de masternode y la dirección de la garantía, ya que las necesitaremos más adelante. El siguiente paso es asegurar tu billetera (si aún no lo has hecho). Primero, encripta la billetera seleccionando **Configuración > Encriptar billetera**. Deberías usar una nueva contraseña segura que nunca hayas utilizado en otro lugar. Toma nota de tu contraseña y guárdala en un lugar seguro o de lo contrario, tu billetera quedará bloqueada permanentemente y perderás el acceso a tus fondos. A continuación, realiza un respaldo de tu archivo de billetera seleccionando **Archivo > Billetera de respaldo**. Guarda el archivo en una ubicación segura, físicamente separada de tu computadora, ya que esta será la única forma en que puedes acceder a nuestros fondos si le ocurre algo a tu computadora. Para más detalles sobre estos pasos, consulta :ref:`aquí <dashcore-backup>`.
zh_cn: 请记录主节点私钥和保证金地址，因为我们稍后将需要它。下一步是确保您的钱包安全（如果您还没有这样做的话）。首先，通过选择\ **设置 > 加密钱包**\ 来给钱包加密。您应该使用一个您从未在其他地方使用过的强而新的密码。记下您的密码，并把它存放在安全的地方，否则您将永远被锁在您的钱包之外，且无法使用您的资金。接下来，通过选择\ **文件 > 备份钱包**\ 来备份您的钱包文件。将文件保存到物理上独立于计算机的安全位置，因为如果您的电脑出了什么问题，这将是您获得我们资金的唯一途径。有关这些步骤的更多详细信息，请参考\ :ref:`此处 <dashcore-backup>`\ 。

source: Now send exactly 1000 DASH in a single transaction to the account address you generated in the previous step. This may be sent from another wallet, or from funds already held in your current wallet. Once the transaction is complete, view the transaction in a `blockchain explorer <http://insight.dash.org/insight/>`_ by searching for the address. You will need 15 confirmations before you can start the masternode, but you can continue with the next step at this point already: installing Dash Core on your VPS.
ar: أرسل الآن 1000 داش بالضبط في معاملة واحدة إلى عنوان الحساب الذي أنشأته في الخطوة السابقة. قد يتم إرسال هذا من محفظة أخرى ، أو من أموال موجودة بالفعل في محفظتك الحالية. بمجرد اكتمال المعاملة ، قم بعرض المعاملة في `مستكشف بلوكشين <http://insight.dash.org/insight/>`_ عن طريق البحث عن العنوان. ستحتاج إلى 15 تأكيدًا قبل أن تتمكن من بدء تشغيل ماسترنود ، ولكن يمكنك المتابعة مع الخطوة التالية في هذه المرحلة بالفعل: تثبيت داش كور على VPS لديك.
es: Ahora envía exactamente 1000 DASH en una sola transacción a la dirección de cuenta que generaste en el paso anterior. Esto puede ser enviado desde otra billetera, o desde fondos que ya están en tu billetera actual. Una vez que la transacción se haya completado, visualiza la transacción buscando la dirección en un `explorador de cadena de bloques <http://insight.dash.org/insight/>` _. Necesitarás 15 confirmaciones antes de poder comenzar el masternode, pero puedes continuar con el siguiente paso en este punto: instalar Dash Core en tu VPS.
zh_cn: 现在，将单个交易中的1000个达世币准确地发送到您在上一步中生成的帐户地址中。这1000个达世币可能是从另一个钱包，或是从您当前钱包已持有的资金中发送的。交易完成后，通过搜索地址来查看在\ `区块链浏览器 <http://insight.dash.org/insight/>`_\ 中的交易。在您能够启动主节点之前，您将需要15次确认，但您现在可以继续下一步：在您的VPS上安装Dash Core。

source: dashman will download the latest version of Dash Core for your system, as well as an initial snapshot of the blockchain to speed up the bootstrapping process. Next download and install sentinel, which is required for masternodes at version 12.1 or higher::
ar: سيقوم dashman بتنزيل أحدث إصدار من داش كور لنظامك ، بالإضافة إلى لقطة أولية لـ بلوكشين لتسريع عملية bootstrapping. التالي تحميل وتثبيت حارس ، وهو مطلوب لل ماسترنود في الإصدار 12.1 أو أعلى::
es: dashman descargará la última versión de Dash Core para tu sistema, así como una captura inicial de la cadena de bloques para acelerar el proceso de arranque. Luego descargua e instala sentinel, que se requiere para los masternodes en la versión 12.1 o superior::
zh_cn: Dashman将为您的系统下载最新版本的Dash Core，以及区块链的初始情况说明，以加快引导过程。下一次下载并安装sentinel时，需要12.1版本或更高版本的主节点::

source: Your system is now running as a standard Dash node, and is busy completing synchronisation with the blockchain. We now need to enter the masternode private key generated in the previous step. Edit the configuration file using the following command::
ar: يعمل النظام الآن كعقدة داش قياسية ، وهو مشغول بإكمال المزامنة مع بلوكشين. نحتاج الآن إلى إدخال المفتاح الخاص ماسترنود الذي تم إنشاؤه في الخطوة السابقة. تحرير ملف التكوين باستخدام الأمر التالي
es: Tu sistema ahora se está ejecutando como un nodo Dash estándar, y está ocupado completando la sincronización con la cadena de bloques. Ahora necesitamos ingresar la llave privada de masternode generada en el paso anterior. Edita el archivo de configuración usando el siguiente comando::
zh_cn: 您的系统现在正在作为标准主节点节点运行，并且正忙于完成与区块链的同步。我们现在需要输入在上一步中生成的主节点私钥。使用以下命令编辑配置文件::

source: Uncomment the last two lines by deleting the # symbol at the start of the line, then paste the masternode private key you generated after ``masternodeprivkey=``. You can simply click the right mouse button to paste into the terminal window. Press **Ctrl + X** to close the editor and **Y** and **Enter** save the file.
ar: قم بحذف السطرين الماضيين عن طريق حذف الرمز # في بداية السطر ، ثم قم بلصق المفتاح الخاص ماسترنود الذي قمت بتكوينه بعد ``masternodeprivkey=``. يمكنك ببساطة النقر على زر الفأرة الأيمن للصق في نافذة طرفية. اضغط على **Ctrl X** لإغلاق المحرر و **Y** و **ادخل** احفظ الملف.
es: Descomenta las últimas dos líneas borrando el símbolo # al comienzo de la línea, luego pega la llave privada del masternode que generaste después de ``masternodeprivkey=``. Simplemente puedes hacer click con el botón derecho del mouse para pegarlo en la ventana del terminal. Presiona **Ctrl + X** para cerrar el editor y **Y** y **Entrar** para guardar el archivo.
zh_cn: 删除行首的 # 符号，取消对最后两行的注释，然后粘贴您在\ ``masternodeprivkey=``\ 之后生成的主节点私钥。您只需单击鼠标右键将其粘贴到终端窗口即可。按\ **Ctrl + X**\ 来关闭编辑器，并按\ **Y**\ 和\ **Enter**\ 保存文件。

source: Entering masternodeprivkey in dash.conf on the masternode
ar: دخول masternodeprivkey في dash.conf على ماسترنود
es: Ingresar la llave privada del masternode en dash.conf en el masternode
zh_cn: 在主节点的dash.conf 中输入masternodeprivkey

source: At this point you should restart dashd to load the new configuration file by typing the following::
ar: عند هذه النقطة ، يجب إعادة تشغيل dashd لتحميل ملف التكوين الجديد بكتابة ما يلي ::
es: En este punto, debes reiniciar dashd para cargar el nuevo archivo de configuración escribiendo lo siguiente::
zh_cn: 此时，您应该重新启动dashd，通过键入以下命令加载新的配置文件::

source: Press **Y** and **Enter** to confirm. Then check the sync status and wait until all blockchain synchronisation and the 15 confirmations for the collateral transaction are complete::
ar: اضغط على **Y** و **ادخل** للتأكيد. ثم تحقق من حالة المزامنة وانتظر حتى تكتمل جميع مزامنة بلوكشين والتأكيدات الـ 15 الخاصة بمعاملات الضمانات ::
es: Presione **Y** y **Entrar** para confirmar. Luego, verifica el estado de sincronización y espera hasta que se completen todas las sincronizaciones de la cadena de bloques y las 15 confirmaciones de la transacción de la garantía:
zh_cn: 按\ **Y**\ 和\ **Enter**\ 以确认。然后检查同步状态并等待，直到完成所有区块链同步和保证金交易的15次确认为止::

source: dashman does not automatically restart your masternode in the event of a system error. Add a check function to crontab to make sure it checks every minute to ensure your masternode is still running::
ar: لا يقوم dashman بإعادة تشغيل ماسترنود تلقائيًا في حالة حدوث خطأ في النظام. إضافة وظيفة فحص إلى crontab للتأكد من أنه يتحقق كل دقيقة لضمان استمرار تشغيل ماسترنود الخاص بك ::
es: dashman no reinicia automáticamente tu masternode en caso de un error del sistema. Agrega una función de verificación a crontab para asegurarte de que compruebe cada minuto para asegurarse de que tu masternode todavía se está ejecutando::
zh_cn: 如果发生系统错误，dashman不会自动重新启动您的主节点。向crontab添加一个检查功能，以确保它每分钟检查一次，从而确保主节点仍在运行::

source: Press enter to make sure there is a blank line at the end of the file, then press **Ctrl + X** to close the editor and **Y** and **Enter** save the file.
ar: اضغط على ادخل لتتأكد من وجود سطر فارغ في نهاية الملف ، ثم اضغط **Ctrl + X** لإغلاق المحرر و **Y** و **اادخل** احفظ الملف.
es: Presiona enter para asegurar que hay una linea en blanco al final del archivo, luego presione **Ctrl + X** para cerrar el editor y **Y** y **Enter** para guardar el archivo.
zh_cn: 按Enter键以确保文件末尾有空行，然后按\ **Ctrl + X**\ 来关闭编辑器，并按\ **Y**\ 和\ **Enter**\ 保存该文件。

source: Continue with the :ref:`next step to start your masternode <masternode-setup-start>`.
ar: اكمل مع :ref:`الخطوة التالية لبدأ ماسترنود <masternode-setup-start>`.
es: Continua con el :ref:`siguiente paso para iniciar tu masternode <masternode-setup-start>`.
zh_cn: 继续使用\ :ref:`启动您的主节点 <masternode-setup-start>的下一个步骤`\ 。
