Repository: 12Gitcat/docs
Catalog: locale/*/LC_MESSAGES/masternodes/setup.po
Languages: ar, es, ru, zh_cn

source: This guide describes how to set up a Dash masternode. It also describes various options for hosting and different wallets
ar: يصف هذا الدليل كيفية إعداد ماسترنود داش. كما يصف خيارات مختلفة للاستضافة ومحافظ مختلفة
es: Esta guía describe como configurar un masternode de Dash. También describe varias opciones para alojamiento y diferentes billeteras
ru: В этом руководстве описывается настройка мастерноды Dash. Также в нём описаны различные варианты для хостинга и различные кошельки
zh_cn: 本指南描述了如何架设达世币主节点。还介绍了各种托管服务和不同的钱包选择

source: dash, guide, masternodes, trezor, dip3, setup, bls
ru: dash, руководство, мастерноды, trezor, dip3, настройка, bls

source: Setup
ar: التنصيب
es: Configuración
ru: Настройка
zh_cn: 架设

source: Setting up a masternode requires a basic understanding of Linux and blockchain technology, as well as an ability to follow instructions closely. It also requires regular maintenance and careful security, particularly if you are not storing your Dash on a hardware wallet. There are some decisions to be made along the way, and optional extra steps to take for increased security.
ar: يتطلب إعداد ماسترنود فهمًا أساسيًا لتكنولوجيا لينكس و بلوكشين ، بالإضافة إلى القدرة على اتباع الإرشادات عن كثب. كما يتطلب صيانة دورية وأمنًا دقيقًا ، خاصةً إذا كنت لا تقوم بتخزين داش على محفظة الأجهزة. هناك بعض القرارات التي يجب اتخاذها على طول الطريق ، والخطوات الإضافية الاختيارية التي يجب اتخاذها لزيادة الأمان.
es: La configuración de un masternode requiere una comprensión básica de Linux y la tecnología de la cadena de bloques, así como la capacidad de seguir las instrucciones de cerca. También requiere un mantenimiento regular y una seguridad cuidadosa, especialmente si no estás almacenando tus Dash en una billetera de hardware. Hay algunas decisiones que se tomarán en el camino, y pasos adicionales opcionales que tomar para una mayor seguridad.
ru: Настройка и запуск мастерноды подразумевают наличие базового понимания Linux и технологии блокчейн, а также способности внимательно следовать инструкциям. Этот процесс также требует регулярного обслуживания и тщательной защиты, особенно если вы не храните DASH на аппаратном кошельке. Во время настройки необходимо будет принять некоторые решения и дополнительные меры для повышения безопасности.
zh_cn: 架设一个主节点需要对Linux和区块链技术有基本的理解，并且需要能够严格遵循指令。主节点也需要定期的维护和谨慎的安全部署，特别是当您没有把您的达世币存储在硬件钱包上的时候。在此过程中，需要做出一些选择，并采取可选的额外步骤来提高安全性。

source: Commercial :ref:`masternode hosting services <masternode-hosting>` are available if you prefer to delegate day-to-day operation of your masternode to a professional operator. When using these hosting services, you retain full control of the 1000 DASH collateral and pay an agreed percentage of your reward to the operator. It is also possible to delegate your voting keys to a representative, see the :ref:`governance documentation <delegating-votes>` for more information.
ru: Если вы предпочитаете делегировать повседневную работу вашей мастерноды профессиональному оператору, то для этого существуют коммерческие :ref:`сервисы хостинга мастернод <masternode-hosting>`. Используя такие сервисы хостинга, вы сохраняете полный контроль над залогом в 1000 DASH и выплачиваете согласованный процент от вашего вознаграждения оператору. Также можно делегировать представителю ваши ключи для голосования, для получения дополнительной информации смотрите :ref:`документацию по управлению: <delegating-votes>`.

source: Before you begin
ar: قبل البدأ
es: Antes de comenzar
ru: Прежде чем начать
zh_cn: 在您开始之前

source: This guide assumes you are setting up a single masternode for the first time. If you are updating a masternode, see :ref:`here <masternode-update>` instead. If Spork 15 is not yet enabled, it is not possible to directly set up a DIP003 masternode. You will need to set up the masternode following the `old process <https://docs.dash.org/en/0.12.3/masternodes/setup.html>`_ and then work through the :ref:`upgrade procedure <dip3-upgrade>`. You will need:
ru: В этом руководстве предполагается, что вы хотите настроить одну мастерноду и делаете это впервые. Если вы обновляете мастерноду, то вместо этого руководства перейдите :ref:`сюда <masternode-update>`. Если Спорк 15 ещё не был активирован, то непосредственная настройка мастерноды DIP003 невозможна. Вам потребуется настраивать мастерноду следуя `старому процессу <https://docs.dash.org/en/0.12.3/masternodes/setup.html>`_, а затем пройти через :ref:`процедуру обновления <dip3-upgrade>`. Вам понадобятся:

source: A wallet to store your Dash, preferably a hardware wallet, although Dash Core wallet is also supported
ar: محفظة لتخزين داش الخاص بك ، ويفضل أن تكون محفظة الأجهزة ، على الرغم من أن محفظة داش كور تدعم أيضا
es: Una billetera para guardar tus Dash, preferiblemente una billetera de hardware, aunque la billetera Dash Core también es compatible
ru: Кошелёк для хранения DASH, предпочтительно аппаратный кошелёк, хотя кошелёк Dash Core также поддерживается
zh_cn: 存储您达世币的钱包，最好是硬件钱包，当然也支持Dash Core钱包

source: A Linux server, preferably a Virtual Private Server (VPS)
ar: خادم لينكس ، يفضل أن يكون خادمًا خاصًا افتراضيًا (VPS)
es: Un servidor Linux, preferiblemente un Servidor Privado Virtual (VPS)
ru: Сервер Linux, предпочтительно виртуальный выделенный сервер (VPS)
zh_cn: Linux服务器，最好是虚拟专用服务器(VPS)

source: Dash 0.13.0 implements DIP003, which introduces several changes to how a Dash masternode is set up and operated. A list of available documentation appears below:
ru: В версии Dash 0.13.0 реализовано предложение по улучшению DIP003, в которое внесены несколько изменений по настройке и управлению мастернодой Dash. Список имеющейся документации приведён ниже:

source: `DIP003 Deterministic Masternode Lists <https://github.com/dashpay/dips/blob/master/dip-0003.md>`__
ru: `Детерминированные списки мастернод DIP003 <https://github.com/dashpay/dips/blob/master/dip-0003.md>`__

source: :ref:`dip3-changes`
ru: :ref:`изменения dip3`

source: :ref:`Dash 0.13 Upgrade Procedure for Masternodes <dip3-upgrade>`
ru: :ref:`Процедура обновления Dash 0.13 для мастернод <dip3-upgrade>`

source: :ref:`Full masternode setup guide <masternode-setup>` (you are here)
ru: :ref:`Полное руководство по настройке мастерноды <masternode-setup>` (вы сейчас на этом этапе)

source: :ref:`Information for users of hosted masternodes <hosted-setup>`
ru: :ref:`Информация для пользователей мастернод на хостинге <hosted-setup>`

source: :ref:`Information for operators of hosted masternodes <operator-transactions>`
ru: :ref:`Информация для операторов мастернод на хостинге <operator-transactions>`

source: It is highly recommended to first read at least the list of changes before continuing in order to familiarize yourself with the new concepts in DIP003. This documentation describes the commands as if they were entered in the Dash Core GUI by opening the console from **Tools > Debug console**, but the same result can be achieved on a masternode by entering the same commands and adding the prefix ``~/.dashcore/dash-cli`` to each command.
ru: Настоятельно рекомендуется перед продолжением для начала ознакомиться хотя бы со списком изменений, чтобы узнать о новых концепциях в DIP003. В этой документации описываются команды в формате, в котором они вводятся в графическом интерфейсе кошелька Dash Core в открытой из меню **Инструменты > Консоль отладки** консоли, но аналогичного результата можно достичь и на мастерноде, вводя те же команды с добавлением к каждой из них префикса ``~/.dashcore/dash-cli``.

source: Set up your VPS
ar: تتبيث VPS الخاصة بك
es: Configurar tu VPS
ru: Настройка VPS
zh_cn: 设置您的VPS

source: A VPS, more commonly known as a cloud server, is fully functional installation of an operating system (usually Linux) operating within a virtual machine. The virtual machine allows the VPS provider to run multiple systems on one physical server, making it more efficient and much cheaper than having a single operating system running on the "bare metal" of each server. A VPS is ideal for hosting a Dash masternode because they typically offer guaranteed uptime, redundancy in the case of hardware failure and a static IP address that is required to ensure you remain in the masternode payment queue. While running a masternode from home on a desktop computer is technically possible, it will most likely not work reliably because most ISPs allocate dynamic IP addresses to home users.
ru: VPS, более известный как облачный сервер, является полнофункциональной установкой операционной системы (обычно Linux), работающей на виртуальной машине. Виртуальная машина позволяет провайдеру VPS запускать несколько систем на одном физическом сервере, что делает её более эффективной и намного более дешёвой, чем использование одной операционной системы на "голом железе" каждого сервера. VPS идеально подходит для размещения мастерноды Dash, поскольку он обычно обеспечивает гарантированное время безотказной работы, дублирование в случае аппаратного сбоя и статический IP-адрес, необходимый для того, чтобы вы оставались в очереди получения платежей за работу мастерноды. Хотя технически возможно запустить мастерноду из дома на настольном компьютере, она, скорее всего, не будет работать надёжно, поскольку большинство интернет-провайдеров выделяют динамические IP-адреса домашним пользователям.

source: We will use `Vultr <https://www.vultr.com/>`_ hosting as an example of a VPS, although `DigitalOcean <https://www.digitalocean.com/>`_, `Amazon EC2 <https://aws.amazon.com/ec2>`_, `Google Cloud <https://cloud.google.com/compute/>`_, `Choopa <https://www.choopa.com/>`_ and `OVH <https://www.ovh.com/>`_ are also popular choices. First create an account and add credit. Then go to the **Servers** menu item on the left and click **+** to add a new server. Select a location for your new server on the following screen:
ru: Мы будем использовать хостинг `Vultr <https://www.vultr.com/>`_ в качестве примера VPS, хотя `DigitalOcean <https://www.digitalocean.com/>`_, `Amazon EC2 <https://aws.amazon.com/ec2>`_, `Google Cloud <https://cloud.google.com/compute/>`_, `Choopa <https://www.choopa.com/>`_ и `OVH <https://www.ovh.com/>`_ также являются популярными вариантами. Для начала создайте учётную запись и добавьте на неё средства. Затем отправляйтесь в пункт меню **Servers** слева и кликните **+**, чтобы добавить новый сервер. Выберите расположение для нового сервера, как показано на экране далее:

source: Vultr server location selection screen
ar: شاشة اختيار موقع خادم Vultr
es: Pantalla de selección de ubicación del servidor Vultr
ru: Экран выбора расположения Vultr-сервера
zh_cn: Vultr服务器位置选择屏幕

source: Select Ubuntu 18.04 x64 as the server type. We use this LTS release of Ubuntu instead of the latest version because LTS releases are supported with security updates for 5 years, instead of the usual 9 months.
ru: В качестве типа сервера выберите Ubuntu 18.04 x64. Вместо последней версии мы используем этот LTS-релиз Ubuntu, потому что LTS-релизы Ubuntu на протяжении 5 лет, вместо обычных 9 месяцев, будут поддерживаться обновлениями безопасности.

source: Vultr server type selection screen
ar: شاشة اختيار نوع الخادم Vultr
es: Pantalla de selección del tipo de servidor Vultr
ru: Экран выбора типа Vultr-сервера
zh_cn: Vultr服务器类型选择屏幕

source: Select a server size offering at least 2GB of memory.
ar: حدد حجم خادم يوفر ذاكرة 2 غيغابايت على الأقل.
es: Selecciona un tamaño de servidor que ofrezca al menos 2 GB de memoria.
ru: Выберите размер сервера, в котором имеется как минимум 2ГБ памяти.
zh_cn: 选择至少提供2GB内存的服务器。

source: Vultr server size selection screen
ar: شاشة اختيار حجم الخادم Vultr
es: Pantalla de selección del tamaño del servidor Vultr
ru: Экран выбора размера Vultr-сервера
zh_cn: Vultr服务器大小选择屏幕

source: Enter a hostname and label for your server. In this example we will use ``dashmn1`` as the hostname.
ar: أدخل اسم المضيف وتسمية الخادم الخاص بك. في هذا المثال ، سنستخدم ``dashmn1`` كاسم مضيف.
es: Ingresa un nombre de alojamiento y una etiqueta para tu servidor. En este ejemplo usaremos ``dashmn1`` como nombre de alojamiento.
ru: Введите имя хоста и метку для вашего сервера. В данном примере в качестве имени хоста мы будем использовать ``dashmn1``.
zh_cn: 为您的服务器输入主机名和标签。在本例中，我们将使用\ ``dashmn1``\ 作为主机名。

source: Vultr server hostname & label selection screen
ar: شاشة اختيار تسمية مضيف خادم Vultr
es: Nombre dealojamiento del servidor de Vultr & pantalla de selección de etiqueta
ru: Экран выбора имени хоста и метки для Vultr-сервера
zh_cn: Vultr服务器主机名和标签选择屏幕

source: Vultr will now install your server. This process may take a few minutes.
ar: سوف Vultr الآن تثبيت الخادم الخاص بك. قد تستغرق هذه العملية بضع دقائق.
es: Vultr ahora instalará tu servidor. Este proceso puede tardar unos minutos.
ru: Vultr теперь выполнит установку вашего сервера. Этот процесс может занять несколько минут.
zh_cn: Vultr现在将安装您的服务器。这个过程可能需要几分钟。

source: Vultr server installation screen
ar: شاشة تثبيت خادم Vultr
es: Pantalla de instalación del servidor Vultr
ru: Экран инсталляции Vultr-сервера
zh_cn: Vultr服务器安装屏幕

source: Click **Manage** when installation is complete and take note of the IP address, username and password.
ar: انقر فوق **ادارة** عند اكتمال التثبيت وتحيط علما بعنوان IP واسم المستخدم وكلمة المرور.
es: Haz click en **Administrar** cuando la instalación esté completa y toma nota de la dirección IP, el nombre de usuario y la contraseña.
ru: Когда инсталляция будет завершена, кликните **Manage** и обратите внимание на IP-адрес, имя пользователя и пароль.
zh_cn: 在安装完成后，单击 **Manage** ，并记下IP地址、用户名和密码。

source: Vultr server management screen
ar: شاشة إدارة خادم Vultr
es: Pantalla de administración del servidor Vultr
ru: Экран управления Vultr-сервера
zh_cn: Vultr服务器管理屏幕

source: Set up your operating system
ar: قم بإعداد نظام التشغيل الخاص بك
es: Configurar tu sistema operativo
ru: Настройте вашу операционную систему
zh_cn: 设置您的操作系统

source: We will begin by connecting to your newly provisioned server. On Windows, we will first download an app called PuTTY to connect to the server. Go to the `PuTTY download page <https://www.chiark.greenend.org.uk/~sgtatham/putty/latest.html>`_ and select the appropriate MSI installer for your system. On Mac or Linux you can ssh directly from the terminal - simply type ``ssh root@<server_ip>`` and enter your password when prompted.
ar: سنبدأ بالاتصال بخادمك الجديد الذي تم توفيره. على ويندوز ، سنقوم أولاً بتنزيل تطبيق يسمى PuTTY للاتصال بالخادم. اذهب الى `تحميل <https://www.chiark.greenend.org.uk/~sgtatham/putty/latest.html>`_ وحدد مثبت MSI المناسب لنظامك. على ماك أو لينكس يمكنك ssh مباشرة من المحطة - ببساطة اكتب ``ssh root@ <server_ip>`` و ادخل الرقم السري للإنتهاء.
es: Comenzaremos por conectarnos a tu servidor recién provisto. En Windows, primero descargaremos una aplicación llamada PuTTY para conectarnos al servidor. Ve a la `Página de descargas de PuTTY <https://www.chiark.greenend.org.uk/~sgtatham/putty/latest.html>`_ y selecciona el instalador MSI apropiado para tu sistema. En Mac o Linux puedes escribir ssh directamente desde el terminal - simplemente escribe ``ssh root@<server_ip>`` e ingresa tu contraseña cuando se le solicite.
ru: Начнём с подключения к вашему вновь подготовленному серверу. На Windows для начала скачаем приложение для соединения с сервером, которое называется PuTTY. Отправляйтесь на `страницу загрузки PuTTY <https://www.chiark.greenend.org.uk/~sgtatham/putty/latest.html>`_ и выберите там соответствующий вашей системе MSI-установщик. Для Mac или Linux вы можете использовать команду ssh прямо из терминала - просто набрав ``ssh root@<server_ip>`` после чего по запросу ввести пароль.
zh_cn: 我们将从连接到您新提供的服务器开始。在Windows上，我们将首先下载一个名为PuTTY的应用程序来连接到服务器。转到\ `PuTTY 下载页面 <https://www.chiark.greenend.org.uk/~sgtatham/putty/latest.html>`_\ 并为您的系统选择适当的MSI安装程序。在Mac或Linux上，您可以直接从终端中 -只需键入\ ``ssh root@<server_ip>`` ，然后在提示时输入密码。

source: PuTTY download page
ar: صفحة التحميل PuTTY
es: Página de descargas de PuTTY
ru: Страница загрузки PuTTY
zh_cn: PuTTY下载页面

source: Double-click the downloaded file to install PuTTY, then run the app from your Start menu. Enter the IP address of the server in the **Host Name** field and click **Open**. You may see a certificate warning, since this is the first time you are connecting to this server. You can safely click **Yes** to trust this server in the future.
ar: انقر نقرًا مزدوجًا فوق الملف الذي تم تنزيله لتثبيت PuTTY ، ثم قم بتشغيل التطبيق من قائمة بدأ ادخل عنوان IP الخاص بالخادم في الحقل **اسم المضيف** وانقر فوق **فتح**. قد تشاهد تحذيرًا بوجود شهادة ، نظرًا لأن هذه هي المرة الأولى التي تتصل فيها بهذا الخادم. يمكنك النقر بأمان **نعم** للوثوق بهذا الخادم في المستقبل.
es: Haz doble click en el archivo descargado para instalar PuTTY, luego ejecuta la aplicación desde tu menú de Inicio. Ingresa la dirección IP del servidor en el campo **Nombre de alojamiento** y haz click en **Abrir**. Puedes ver una advertencia de certificado, ya que esta es la primera vez que te conectas a este servidor. Puedes hacer click con seguridad en **Si** para confiar en este servidor en el futuro.
ru: Выполните двойной щелчок по скачанному файлу и установите PuTTY, затем запустите приложение из меню Пуск. Введите IP-адрес сервера в поле **Host Name** и кликните **Open**. Вы увидите свидетельство, предупреждающее о том, что к этому серверу вы подсоединяетесь впервые. Будет вполне безопасно, если вы кликните **Yes**, этим вы доверите соединение с этим сервером в будущем.
zh_cn: 双击下载的文件安装PuTTY，然后从您的开始菜单中运行该应用程序。在\ **主机名**\ 字段中输入服务器的IP地址，然后单击\ **打开**\ 。您可能会看到证书警告，因为这是您第一次连接到此服务器。之后您可以安全地单击\ **是**\ 来信任服务器。

source: PuTTY security alert when connecting to a new server
ar: تنبيه الأمان PuTTY عند الاتصال بخادم جديد
es: Alerta de seguridad de PuTTY cuando te conectas a un nuevo servidor
ru: Оповещение безопасности PuTTY при подсоединении к новому серверу
zh_cn: 连接到新服务器时的PuTTY安全警告

source: You are now connected to your server and should see a terminal window. Begin by logging in to your server with the user ``root`` and password supplied by your hosting provider.
ar: أنت الآن متصل بخادمك ويجب أن تشاهد نافذة طرفية. قم بتسجيل الدخول إلى الخادم الخاص بك باستخدام المستخدم ``root`` وكلمة المرور التي قدمها مزود خدمة الاستضافة الخاص بك.
es: Ahora estás conectado a tu servidor y deberías ver una ventana de terminal. Comienza por iniciar sesión en tu servidor con el usuario ``root`` y la contraseña proporcionada por tu proveedor de alojamiento.
ru: Теперь вы подсоединены к серверу и должны увидеть окно терминала. Начните с авторизации на сервере с правами администратора, введите логин и пароль, предложенные вашим хостинг-провайдером.
zh_cn: 您现在已连接到您的服务器，并且应该会看到一个终端窗口。 首先，使用您的主机提供商提供的用户\ ``root``\ 和密码登录到您的服务器。

source: Password challenge when connecting to your VPS for the first time
ar: تحديت كلمة المرور عند الاتصال بـ VPS الخاص بك لأول مرة
es: Desafío de contraseña al conectarte a tu VPS por primera vez
ru: Проверка пароля при первом соединении с VPS
zh_cn: 第一次连接到您的VPS时会遇到密码问题

source: You should immediately change the root password and store it in a safe place for security. You can copy and paste any of the following commands by selecting them in your browser, pressing **Ctrl + C**, then switching to the PuTTY window and right-clicking in the window. The text will paste at the current cursor location::
ar: يجب تغيير كلمة مرور الجذر فوراً وتخزينها في مكان آمن للأمان. يمكنك نسخ أي من الأوامر التالية ولصقها من خلال تحديدها في المستعرض الخاص بك ، بالضغط على **Ctrl + C** ، ثم التبديل إلى نافذة PuTTY والنقر بزر الماوس الأيمن في النافذة. سيتم لصق النص في موقع المؤشر الحالي ::
es: Deberías cambiar inmediatamente la contraseña de raíz y almacenarla en un lugar seguro para mayor seguridad. Puedes copiar y pegar cualquiera de los siguientes comandos seleccionándolos en tu navegador, presionando **Ctrl + C**, luego cambiando a la ventana PuTTY y haciendo click derecho en la ventana. El texto se pegará en la ubicación actual del cursor::
ru: Вам необходимо немедленно сменить свой root-пароль и в целях безопасности сохранить его в надёжном месте. Можно скопировать и вставить любую из следующих команд, выбрав её в браузере и нажав **Ctrl + C**, затем перейти в окно PuTTY и кликнуть правой кнопкой мыши в этом окне. Текст будет вставлен на текущем месте расположения курсора::
zh_cn: 为了确保安全，您应该立即更改root密码，并将其存储在安全的地方。您可以复制和粘贴以下任何命令，方法是在您的浏览器中选择这些命令，按下\ **Ctrl + C**\ ，然后切换到PuTTY窗口，并在窗口中右键单击。文本将粘贴在当前光标位置::

source: Enter and confirm a new password (preferably long and randomly generated). Next we will create a new user with the following command, replacing ``<username>`` with a username of your choice::
ar: أدخل كلمة مرور جديدة وقم بتأكيدها (يفضل أن تكون طويلة ومولدة بشكل عشوائي). بعد ذلك سننشئ مستخدمًا جديدًا باستخدام الأمر التالي ، مع استبداله ``<username>`` مع اسم مستخدم من اختيارك ::
es: Ingresa y confirma una nueva contraseña (preferiblemente larga y aleatoriamente generada). A continuación crearemos un nuevo usuario con el siguiente comando, reemplazando ``<username>`` con un nombre de usario de tu elección::
ru: Введите и подтвердите новый пароль (предпочтительно, чтобы он был длинным и сгенерированным случайным образом). Далее произойдёт создание нового пользователя с использованием следующей команды, заменяющей ``<username>`` выбранное вами имя пользователя::
zh_cn: 输入并确认一个新密码(最好是长的和随机生成的)。接下来，我们将使用以下命令，将\ ``<username>``\ 替换为您喜欢的用户名来创建一个新用户::

source: You will be prompted for a password. Enter and confirm using a new password (different to your root password) and store it in a safe place. You will also see prompts for user information, but this can be left blank. Once the user has been created, we will add them to the sudo group so they can perform commands as root::
ar: ستتم مطالبتك بكلمة مرور. أدخل وتأكد باستخدام كلمة مرور جديدة (مختلفة عن كلمة مرور الجذر) وقم بتخزينها في مكان آمن. سترى أيضًا مطالبات بمعلومات المستخدم ، ولكن يمكن ترك هذا فارغًا. بمجرد أن يتم إنشاء المستخدم ، سنقوم بإضافتهم إلى المجموعة sudo بحيث يمكنهم تنفيذ الأوامر كجذر
es: Se te solicitará una contraseña. Ingresa y confirma usando una nueva contraseña (diferente a tu contraseña de raíz) y guárdala en un lugar seguro. También verás solicitudes de información del usuario, pero esto se puede dejar en blanco. Una vez que el usuario ha sido creado, lo agregaremos al grupo sudo para que puedan ejecutar comandos como raíz::
ru: Вам будет предложено задать пароль. Введите и подтвердите новый пароль (он должен отличаться от вашего root-пароля) и сохраните его в безопасном месте. Также вы можете ввести информацию о пользователе, но эти поля можно не заполнять. После создания пользователя, мы добавим их в sudo-группу, чтобы они могли выполнять команды в качестве root-пользователей:
zh_cn: 您将被提示输入密码。输入并确认使用新密码(与您的root密码不同)，并将其存储在安全的地方。您还将看到有关用户信息的提示，但可以将其保留为空白。一旦创建了用户，我们将把它们添加到sudo组中，这样它们就能以root用户的身份执行命令::

source: Now, while still as root, we will update the system from the Ubuntu package repository::
ar: الآن ، بينما لا يزال الجذر ، سنقوم بتحديث النظام من مستودع حزمة أوبونتو ::
es: Ahora, aunque todavía como raíz, actualizaremos el sistema desde el repositorio de paquetes de Ubuntu::
ru: Теперь, пока мы все ещё с правами администратора, обновим систему с помощью пакета репозитория Ubuntu::
zh_cn: 现在，在仍是root用户时，我们将从Ubuntu软件包存储库更新系统::
