Repository: 12Gitcat/docs
Catalog: locale/*/LC_MESSAGES/masternodes/setup.po
Languages: ar, es, ru, zh_cn

source: To install Dash using dashman, enter the following commands after logging in::
ar: لتثبيت داش باستخدام dashman ، أدخل الأوامر التالية بعد تسجيل الدخول ::
es: Para instalar Dash usando dashman, ingresa los siguientes comandos después de iniciar sesión::
ru: Чтобы установить Dash, используя dashman, после входа в систему введите следующие команды::
zh_cn: 若要使用dashman安装Dash，请在登录后输入以下命令::

source: dashman will download the latest version of Dash Core for your system, as well as an initial snapshot of the blockchain to speed up the bootstrapping process. Next download and install Sentinel, which is required for masternodes at version 0.12.1 or higher::
ru: dashman скачает последнюю для вашей системы версию Dash Core, а также сделает начальный снимок блокчейна для ускорения процесса начальной загрузки. Далее скачайте и установите Sentinel, он требуется для мастернод начиная с версии 0.12.1 и выше::

source: Your system is now running as a standard Dash node, and is busy completing synchronisation with the blockchain. Since dashman does not automatically restart your masternode in the event of a system error, add a check function to crontab to make sure it checks every minute to ensure your masternode is still running::
ru: Ваша система теперь работает как стандартная нода Dash и занята завершением синхронизации с блокчейном. Так как dashman не перезапускает мастерноду автоматически в случае системной ошибки, добавьте функцию проверки в файл задач crontab, чтобы каждую минуту проверять работу мастерноды и убеждаться, что она всё ещё работает::

source: Choose nano as your editor and enter the following line at the end of the file, after the line for sentinel::
ar: اختر nano كمحرر وأدخل السطر التالي في نهاية الملف ، بعد السطر للحماية ::
es: Elije nano como tu editor e ingresa la siguiente linea al final del archivo, después de la linea para sentinel::
ru: В качестве редактора выберите nano и в конце файла введите следующую строку, после строки Sentinel::
zh_cn: 选择nano作为编辑器，并在 sentinel行后面的文件末尾输入以下行::

source: Press enter to make sure there is a blank line at the end of the file, then press **Ctrl + X** to close the editor and **Y** and **Enter** save the file. Check the sync status and wait until all blockchain synchronisation and the 15 confirmations for the collateral transaction are complete::
ru: Нажмите Enter, чтобы убедиться, что в конце файла есть пустая строка, затем нажмите **Ctrl + X**, чтобы закрыть редактор, а затем **Y** и **Enter**, чтобы сохранить файл. Проверьте статус синхронизации, дождитесь полной синхронизации с блокчейном и 15 подтверждений для того, чтобы залоговая транзакция считалась завершённой::

source: dashman status output showing masternode ready to be started
ar: خرج حالة dashman تظهر ماسترنود جاهزة للبدء
es: Salidas de estado de dashman que muestran el masternode listo para ser iniciado
ru: Выведенный статус dashman, который показывает, что мастернода готова к запуску
zh_cn: Dashman状态输出显示即将被启动的主节点

source: Continue with the :ref:`next step to register your masternode <register-masternode>`.
ru: Для продолжения перейдите по ссылке :ref:`следующий шаг для регистрации мастерноды <register-masternode>`.

source: Option 2: Manual installation
ar: الخيار 2: التثبيت اليدوي
es: Opción 2: Manual de instalación
ru: Способ 2: Установка вручную
zh_cn: 选项2：手动安装

source: To manually download and install the components of your Dash masternode, visit the `GitHub releases page <https://github.com/dashpay/dash/releases>`_ and copy the link to the latest ``x86_64-linux-gnu`` version. Go back to your terminal window and enter the following command, pasting in the address to the latest version of Dash Core by right clicking or pressing **Ctrl + V**::
ru: Для того, чтобы вручную загрузить и установить компоненты мастерноды Dash, посетите `страницу релизов GitHub <https://github.com/dashpay/dash/releases>`_ и скопируйте ссылку на последнюю версию x86_64-linux-gnu. Вернитесь в окно терминала и введите следующую команду, вставив адрес последней версии Dash Core, кликнув правой кнопкой мыши или нажав **Ctrl + V**::

source: Verify the integrity of your download by running the following command and comparing the output against the value for the file as shown in the ``SHA256SUMS.asc`` file::
ru: Проверьте целостность вашей загрузки, выполнив следующую команду и сравнив выходные данные со значением для файла, как показано в файле ``SHA256SUMS.asc``::

source: You can also optionally verify the authenticity of your download as an official release by Dash Core Team. All releases of Dash are signed using GPG by Alexander Block (codablock) with the key ``63A9 6B40 6102 E091``, `verifiable here on Keybase <https://keybase.io/codablock>`_. Import the key, download the ASC file for the current release of Dash and verify the signature as follows::
ru: При желании вы также можете сверить подлинность загруженного файла с официальным релизом команды Dash Core. Все релизы Dash подписаны с использованием GPG пользователя Alexander Block (codablock) с ключом ``63A9 6B40 6102 E091``, `поддаются проверке на Keybase <https://keybase.io/codablock>`_. Импортируйте ключ и скачайте файл ASC для текущего релиза Dash и проверьте подпись, как показано ниже::

source: Downloading the PGP key and verifying the signed binary
ar: تحميل مفتاح PGP والتحقق من الثنائي الموقع
es: Descargar la llave PGP y verificar el binario firmado
ru: Скачивание PGP-ключа и верификация подписанных двоичных файлов
zh_cn: 下载PGP密钥并验证已签名的二进制文件

source: Create a working directory for Dash, extract the compressed archive and copy the necessary files to the directory::
ru: Создайте рабочую папку для Dash, извлеките туда архив и скопируйте необходимые файлы в эту папку::

source: Create a configuration file using the following command::
ar: قم بإنشاء ملف تكوين باستخدام الأمر التالي:
es: Crea un archivo de configuración usando el siguiente comando::
ru: С помощью следующей команды создайте файл настроек::
zh_cn: 使用以下命令创建配置文件::

source: An editor window will appear. We now need to create a configuration file specifying several variables. Copy and paste the following text to get started, then replace the variables specific to your configuration as follows::
ar: سوف تظهر نافذة المحرر. نحتاج الآن إلى إنشاء ملف تكوين يحدد عدة متغيرات. قم بنسخ النص التالي ولصقه للبدء ، ثم استبدل المتغيرات الخاصة بالتكوين كما يلي:
es: Aparecerá una ventana del editor. Ahora necesitamos crear un archivo de configuración que especifique varias variables. Copia y pega el siguiente texto para comenzar, luego reemplaza las variables específicas a tu configuración de la siguiente manera::
ru: Появится окно редактора. Теперь нам нужно создать конфигурационный файл, в котором будут описаны некоторые параметры. Для начала, скопируйте и вставьте в него следующий текст, а затем замените параметры на те, которые удовлетвоярют вашей конфигурации::
zh_cn: 一个编辑器窗口将会出现。现在我们需要指定几个变量来创建一个配置文件。复制并粘贴以下文本以开始创建，然后按如下所示替换您配置中的具体变量::

source: Replace the fields marked with ``XXXXXXX`` as follows:
ar: استبدل الحقول التي تحمل علامة ``XXXXXXX`` كما يلي:
es: Reemplaza los campos marcados con ``XXXXXXX`` de la siguiente manera:
ru: Замените все поля с ``XXXXXXX`` следующим образом::
zh_cn: 按如下所示替换标记为\ ``XXXXXXX``\ 的字段:

source: ``rpcuser``: enter any string of numbers or letters, no special characters allowed
ar: ``rpcuser``: أدخل أي سلسلة من الأرقام أو الحروف ، لا يسمح بالحروف الخاصة
es: ``rpcuser``: ingresa cualquier cadena de números o letras, no se permiten caracteres especiales
ru: ``rpcuser``: введите любой набор цифр или букв, без специальных символов
zh_cn: ``rpcuser``\ ：输入任何数字或字母字符串，不允许有特殊字符

source: ``rpcpassword``: enter any string of numbers or letters, no special characters allowed
ar: ``rpcpassword``: أدخل أي سلسلة من الأرقام أو الحروف ، لا يسمح بالحروف الخاصة
es: ``rpcpassword``: ingresa cualquier cadena de números o letras, no se permiten caracteres especiales
ru: ``rpcpassword``: введите любой набор цифр или букв, без специальных символов
zh_cn: ``rpcpassword``\ ：输入任何数字或字母字符串，不允许有特殊字符

source: ``masternodeprivkey``: this is the legacy masternode private key you generated in the previous step
ru: ``masternodeprivkey``: это старый приватный ключ мастерноды, который вы сгенерировали в предыдущем шаге

source: ``externalip``: this is the IP address of your VPS
ar: ``externalip``: هذا هو عنوان IP الخاص بـ VPS الخاص بك
es: ``externalip``: esta es la dirección IP de tu VPS
ru: ``externalip``: это IP-адрес вашего VPS
zh_cn: ``externalip``\ ：这是您VPS的IP地址

source: The result should look something like this:
ar: يجب أن تبدو النتيجة شيء من هذا القبيل:
es: El resultado debería verse más o menos así:
ru: В результате должно получиться что-то похожее:
zh_cn: 结果应该是这样的:

source: Entering key data in dash.conf on the masternode
ar: إدخال بيانات المفتاح في dash.conf على ماسترنود
es: Introducción de datos de llave en dash.conf en el masternode
ru: Ввод ключевых данных в dash.conf для мастерноды
zh_cn: 在主节点上的dash.conf中输入主要数据

source: Press **Ctrl + X** to close the editor and **Y** and **Enter** save the file. You can now start running Dash on the masternode to begin synchronization with the blockchain::
ar: اضغط على **Ctrl + X** لإغلاق المحرر و **Y** و **ادخل** احفظ الملف. يمكنك الآن بدء تشغيل داش على ماسترنود لتبدأ التزامن مع بلوكشين ::
es: Presiona **Ctrl + X** para cerrar el editor y **Y** y **Entrar** para guardar el archivo. Ahora puedes comenzar a ejecutar Dash en el masternode para comenzar la sincronización con la cadena de bloques::
ru: Нажмите **Ctrl + X** и закройте редактор, а затем нажмите **Y** и **Enter**, чтобы сохранить файл. Теперь вы можете запустить Dash в режиме мастерноды и начать синхронизацию с блокчейном::
zh_cn: 按\ **Ctrl + X**\ 以关闭编辑器，并按\ **Y**\ 和\ **Enter**\ 保存该文件。您现在可以开始在主节点上运行达世币，以便开始与区块链同步::

source: You will see a message reading **Dash Core server starting**. We will now install Sentinel, a piece of software which operates as a watchdog to communicate to the network that your node is working properly::
ar: سترى رسالة تقرأ **خوادم داش كور تبدأ**. سنقوم الآن بتركيب الحماية ، وهو عبارة عن برنامج يعمل كجهاز مراقبة للاتصال بالشبكة التي تعمل بها العقدة بشكل صحيح ::
es: Verás un mensaje que dice **Servidor de Dash Core comenzando**. Ahora instalaremos Sentinel, un software que funciona como un perro guardián para comunicar a la red que tu nodo funciona correctamente::
ru: Появится сообщение с текстом **Dash Core server starting**. Теперь установим Sentinel, ту часть ПО, которая работает в режиме сторожевого таймера общаясь с сетью и сообщая ей, что ваша нода работает нормально::
zh_cn: 您将看到一条显示\ **Dash Core server starting**\ 的消息。我们现在将安装Sentinel，这是一个以看门狗的方式运行的软件，以和网络进行通信，从而说明您的节点正在正常工作::

source: You will see a message reading **dashd not synced with network! Awaiting full sync before running Sentinel.** Add dashd and sentinel to crontab to make sure it runs every minute to check on your masternode::
ar: سترى رسالة تقرأ **dashd لم تتم مزامنتها مع الشبكة! في انتظار المزامنة الكاملة قبل تشغيل Sentinel** أضف dashd إلى crontab للتأكد من أنه يعمل كل دقيقة للتحقق من ماسترنود الخاص بك ::
es: Veras un mensaje que dice **dashd no esta sincronizada con la red! Espere que este completa la sincronización antes de ejecutar Sentinel.** Agrega dashd y sentinel a crontab para asegurar que se ejecuten cada minuto para verificar su masternode::
ru: Появится сообщение с текстом **dashd not synced with network! Awaiting full sync before running Sentinel.** Добавьте dashd и Sentinel в файл crontab, чтобы иметь возможность получать ежеминутные подтверждения того, что ваша мастернода запущена и работает::
zh_cn: 您将看到一条显示\ **dashd not synced with network! Awaiting full sync before running Sentinel.**\ 的消息。将dashd和sentinel添加到crontab以确保它每分钟运行一次，来对您的主节点进行检查::

source: Choose nano as your editor and enter the following lines at the end of the file::
ar: اختر nano كمحرر وأدخل الأسطر التالية في نهاية الملف ::
es: Elije nano como tu editor e ingresa las siguientes lineas al final del archivo::
ru: В качестве редактора выберите nano и в конце файла введите следующие строки::
zh_cn: 选择nano作为您的编辑器，并在文件末尾输入以下行::

source: Press enter to make sure there is a blank line at the end of the file, then press **Ctrl + X** to close the editor and **Y** and **Enter** save the file. We now need to wait for 15 confirmations of the collateral transaction to complete, and wait for the blockchain to finish synchronizing on the masternode. You can use the following commands to monitor progress::
ar: اضغط على ادخل لتتأكد من وجود سطر فارغ في نهاية الملف ، ثم اضغط **Ctrl + X** لإغلاق المحرر و **Y** و **ادخل** احفظ الملف. نحتاج الآن إلى الانتظار للحصول على 15 تأكيدًا لمعاملة الضمانات لإكمالها ، والانتظار حتى تنتهي عملية بلوكشين من المزامنة على ماسترنود. يمكنك استخدام الأوامر التالية لمراقبة التقدم ::
es: Presiona entrar para asegurarte de que haya una línea en blanco al final del archivo, luego presiona **Ctrl + X** para cerrar el editor y **Y** y **Entrar** para guardar el archivo. Ahora debemos esperar a que se completen 15 confirmaciones de la transacción de garantía, y esperar a que la cadena de bloques termine de sincronizarse en el masternode. Puedes usar los siguientes comandos para monitorear el progreso::
ru: Нажмите Enter, чтобы убедиться, что в конце файла есть пустая строка, затем нажмите **Ctrl + X**, чтобы закрыть редактор, а затем **Y** и **Enter**, чтобы сохранить файл. Теперь для залоговой транзакции, чтобы она считалась завершённой, следует дождаться 15 подтверждений сети, а также дождаться пока мастернода завершит процес синхронизации с блокчейном. Для мониторинга за процессом можно использовать следующие команды::
zh_cn: 按enter键以确保文件末尾有空行，然后按\ **Ctrl + X**\ 关闭编辑器，并按\ **Y**\ 和\ **Enter**\ 保存该文件。现在，我们需要等待要完成的15次保证金交易的确认，并等待区块链在主节点上完成同步。您可以使用以下命令来监测进度::

source: When synchronisation is complete, you should see the following response::
ar: عند اكتمال المزامنة ، سترى الاستجابة التالية:
es: Cuando se completa la sincronización, deberías ver la siguiente respuesta::
ru: По завершении синхронизации вы увидите следующий ответ::
zh_cn: 完成同步后，您应该看到以下响应::

source: Continue with the next step to construct the ProTx transaction required to enable your masternode.
ru: Выполните следующий шаг, в котором необходимо создать транзакцию ProTx, она требуется для активации мастерноды.

source: Register your masternode
ru: Зарегистрируйте вашу мастерноду

source: DIP003 introduces several changes to how a masternode is set up and operated. These are described briefly under :ref:`dip3-changes` in this documentation, or in full detail in `DIP003 <https://github.com/dashpay/dips/blob/master/dip-0003.md>`_ itself. It is highly recommended to first read at least the brief documentation before continuing in order to familiarize yourself with the new concepts in DIP003.
ru: В предложение по улучшению DIP003 внесены несколько изменений по настройке и управлению мастернодой Dash. Они кратко описаны в документации :ref:`изменения dip3`, а полностью в деталях в самой документации `DIP003 <https://github.com/dashpay/dips/blob/master/dip-0003.md>`_. Настоятельно рекомендуется перед продолжением для начала ознакомиться хотя бы с краткой документацией, чтобы узнать о новых концепциях в DIP003.

source: Option 1: Registering from a hardware wallet
ru: Способ 1: Регистрация из аппаратного кошелька

source: Go back to DMT and ensure that all fields from the previous step are still filled out correctly. Click **Generate new** for the three private keys required for a DIP003 deterministic masternode:
ru: Возвращайтесь назад в DMT и убедитесь, что все поля из предыдущего шага остались заполнены правильно. Кликните **Generate new**, чтобы сгенерировать три приватных ключа, которые необходимы для детерминированной мастерноды DIP003:

source: Owner private key
ru: Приватный ключ владельца

source: Operator private key
ru: Приватный ключ оператора

source: Voting private key
ru: Приватный ключ голосования

source: Dash Masternode Tool ready to register a new masternode
ru: Dash Masternode Tool готов к регистрации новой мастерноды

source: Then click **Send ProRegTx** and confirm the following two messages:
ru: Затем кликните **Send ProRegTx** и подтвердите следующие два сообщения:

source: Dash Masternode Tool confirmation dialogs to register a masternode
ru: Запрашивающие подтверждение диалоги в Dash Masternode Tool для регистрации мастерноды

source: The BLS secret key must be entered in the ``dash.conf`` file on the masternode. This allows the masternode to watch the blockchain for relevant Pro*Tx transactions, and will cause it to start serving as a masternode when the signed ProRegTx is broadcast by the owner, as we just did above. Edit the configuration file on your masternode as follows::
ru: Секретный BLS-ключ необходимо внести в файл ``dash.conf`` мастерноды. Это позволит мастерноде следить за блокчейном и выявлять в нём релевантные транзакции Pro*Tx, а также заставит ноду начать выполнять функции мастерноды, после того, как подписанная владельцем транзакция ProRegTx начнёт транслироваться в сеть, что мы только что сделали выше. Отредактируйте конфигурационный файл мастерноды, как показано ниже::

source: The editor appears with the existing masternode configuration. Add this line to the end of the file, replacing the key with your BLS secret key generated above::
ru: При открытии существующей конфигурации мастерноды откроется редактор. В конце файла добавьте следующую строку, заменив ключ на секретный BLS-ключ, который был сгенерирован выше::

source: Press enter to make sure there is a blank line at the end of the file, then press **Ctrl + X** to close the editor and **Y** and **Enter** save the file. We now need to restart the masternode for this change to take effect. Enter the following commands, waiting a few seconds in between to give Dash Core time to shut down::
ru: Нажмите Enter, чтобы убедиться, что в конце файла существует пустая строка, затем нажмите **Ctrl + X**, чтобы закрыть редактор, а затем **Y** и **Enter**, чтобы сохранить файл. Теперь необходимо перезапустить мастерноду, чтобы внесённые изменения вступили в силу. Выждав несколько секунд, чтобы дать время для Dash Core закрыться, введите следующие команды::

source: At this point you can monitor your masternode using ``dashman/dashman status``, by entering ``~/.dashcore/dash-cli masternode status`` or using the **Get status** function in DMT. The final result should appear as follows:
ru: На этом этапе вы можете наблюдать за своей мастернодой используя ``dashman/dashman status``, введя ``~/.dashcore/dash-cli masternode status`` или используя функцию **Get status** в DMT. Конечный результат должен быть таким, как показано ниже:

source: dash-cli masternode status output showing successfully started masternode
ru: Статус мастерноды dash-cli, который сообщает об успешно запущенной мастерноде

source: At this point you can safely log out of your server by typing ``exit``. Congratulations! Your masternode is now running.
ar: في هذه المرحلة ، يمكنك الخروج من الخادم بأمان عن طريق كتابة ``خروج`` . تهانينا! الخاص بك ماسترنود قيد التشغيل الآن.
es: En este punto, puedes cerrar la sesión de tu servidor de manera segura escribiendo ``salir``. ¡Felicitaciones! Tu masternode ahora se está ejecutando.
ru: На этом этапе можно безопасно совершить выход из сервера, набрав ``exit``. Поздравляем! Ваша мастернода теперь работает.
zh_cn: 此时，您可以通过键入\ ``exit``\ 来安全地注销您的服务器。祝贺您！您的主节点现在正在运行。

source: Option 2: Registering from Dash Core wallet
ru: Способ 2: Регистрация из кошелька Dash Core

source: Identify the funding transaction
ru: Идентификация транзакции финансирования

source: If you used an address in Dash Core wallet for your collateral transaction, you now need to find the txid of the transaction. Click **Tools > Debug console** and enter the following command::
ar: إذا استخدمت عنوانًا في محفظة داش كور للمعاملات الضمانية ، فستحتاج الآن إلى العثور على txid في المعاملة. انقر على **الأدوات > وحدة تحكم التصحيح** وأدخل الأمر التالي:
es: Si utilizaste una dirección en la billetera Dash Core para tu transacción de garantía, ahora necesitas encontrar el txid de la transacción. Haz click en **Herramientas > Consola de depuración** e ingresa el siguiente comando::
ru: Если для совершения залоговой транзакции вы использовали адрес кошелька Dash Core, то теперь необходимо найти txid этой транзакции. Кликните **Инструменты > Консоль отладки** и введите следующую команду::
zh_cn: 如果您使用Dash Core钱包中的地址用于您的保证金交易，现在您则需要找到该交易的txid。单击\ **工具 > 调试控制台**\ 并输入以下命令::

source: This should return a string of characters similar to this::
ar: هذا يجب إرجاع سلسلة من الأحرف مشابهة لهذه ::
es: Esto debería devolver una cadena de caracteres similar a esto::
ru: Консоль должна вернуть строку символов, аналогичную этой::
zh_cn: 这时应该返回类似于以下内容的字符串::

source: The first long string is your transaction hash, while the last number is the index.
ru: Первая длинная строка - это хеш вашей транзакции, последние цифры в ней - это индекс.

source: Generate a BLS key pair
ru: Генерация пары BLS-ключей

source: A public/private BLS key pair is required for the operator of the masternode. If you are using a hosting service, they may provide you with their public key, and you can skip this step. If you are hosting your own masternode or have agreed to provide your host with the BLS private key, generate a BLS public/private keypair as follows::
ru: Оператору мастерноды требуется пара BLS-ключей публичный/приватный. При использовании хостинг сервиса вам могут предоставить их публичный ключ и этот шаг можно пропустить. Если вы разместили на хостинге собственную мастерноду или согласились предоставить вашему хосту приватный BLS-ключ, сгенерируйте пару BLS-ключей публичный/приватный, как показано ниже::

source: **These keys are NOT stored by the wallet and must be kept secure, similar to the value provided in the past by the** ``masternode genkey`` **command.**
ru: **Эти ключи НЕ сохраняются в кошельке и должны храниться в безопасном месте, как и значение, предоставленное в одном из предыдущих шагов после выполнения** ``masternode genkey`` **команды.**

source: Add the private key to your masternode configuration
ru: Добавьте приватный ключ в конфигурацию вашей мастерноды

source: The public key will be used in following steps. The private key must be entered in the ``dash.conf`` file on the masternode. This allows the masternode to watch the network for relevant Pro*Tx transactions, and will cause it to start serving as a masternode when the signed ProRegTx is broadcast by the owner (final step below). Log in to your masternode using ``ssh`` or PuTTY and edit the configuration file on your masternode as follows::
ru: Публичный ключ будет использоваться в следующих шагах. Приватный BLS-ключ необходимо внести в файл ``dash.conf`` мастерноды. Это позволит мастерноде следить за блокчейном и выявлять в нём релевантные транзакции Pro*Tx, а также заставит ноду начать выполнять функции мастерноды, после того, как подписанная владельцем транзакция ProRegTx начнёт транслироваться в сеть (последний шаг ниже). Войдите в учётную запись своей мастерноды, используя ``ssh`` или PuTTY и отредактируйте конфигурационный файл мастерноды, как показано ниже::

source: We will now prepare the transaction used to register a DIP003 masternode on the network.
ru: Теперь подготовим транзакцию, которая используется для регистрации в сети мастерноды DIP003.

source: Prepare a ProRegTx transaction
ru: Подготовка транзакции ProRegTx
