Repository: 12Gitcat/docs
Catalog: locale/*/LC_MESSAGES/wallets/electrum/installation.po
Languages: fr

source: How to install and create a new Dash Electrum wallet on Windows, Linux, macOS and Android
fr: Comment télécharger et créer un nouveau portefeuille Dash Electrum sous Windows, Linux, macOS et Android

source: dash, mobile, wallet, electrum, android, linux, windows, macos, installation, compile
fr: dash, mobile, portefeuille, electrum, android, linux, windows, macos, installation, compilation

source: Download
fr: Téléchargement

source: You can download Dash Electrum from the official Dash website or the Dash Electrum minisite.
fr: Dash Electrum peut être téléchargé depuis le site officiel Dash ou depuis le mini-site Dash Electrum.

source: https://www.dash.org/downloads
fr: https://www.dash.org/fr/telechargements

source: Dash Electrum is developed by community member **akhavr** and is released through his GitHub account.
fr: Dash Electrum est conçu par **Akhavr**, membre de la communauté, et est diffusé via son compte GitHub.

source: You can optionally verify the integrity of your download by running the following commands (example for Linux)::
fr: Vous pouvez, si vous le souhaitez, vérifier l'intégrité de votre téléchargement avec les commandes suivantes (l'exemple est pour Linux) :

source: You can also optionally verify the authenticity of your download as an official release by akhavr. All releases of Dash Electrum are signed by akhavr using GPG with the key ``64A3 BA82 2F44 9D50``, `verifiable here on Keybase <https://keybase.io/akhavr>`_. Import the key, download the ASC file for the current release of Dash Electrum and verify the signature as follows::
fr: Vous pouvez aussi, de manière facultative, vérifier l'authenticité de votre téléchargement en tant que publication officielle d'Akhavr. Toutes les versions de Dash Electrum ont une signature GPG émise par Akhavr avec la clé ``64A3 BA82 2F44 9D50``, `qu'on peut vérifier ici sur Keybase <https://keybase.io/akhavr>`_. Importez la clé, téléchargez le fichier ASC pour la version la plus récente de Dash Electrum et vérifiez la signature comme ceci :

source: Dash Electrum for Linux is available from a PPA for Ubuntu and Linux Mint, and as a source tarball for other systems. As of version 3.0.6, it requires Python 3 to run. Enter the following commands to install from PPA::
fr: Dash Electrum pour Linux est disponible depuis un PPA pour Ubuntu et Linux Mint, et en tant qu'archive source Tar pour les autres distributions. Depuis la version 3.0.6, il nécessite Python 3 pour être exécuté. Saisissez les commande suivantes pour l'installer depuis PPA :

source: Enter the following commands (changing the version number to match the current version as necessary) in the terminal to install Dash Electrum from the source tarball::
fr: Saisissez les commandes suivantes dans le Terminal (en changeant le numéro de version pour coïncider avec la version actuelle, si nécessaire) pour installer Dash Electrum depuis l'archive source Tar :

source: You can then run ``electrum-dash`` from the terminal.
fr: Vous pouvez alors lancer la commande ``electrum-dash`` dans le terminal.

source: Simply download and run the DMG file. You may need to grant permission to install, depending on your security settings. Click through the installation wizard and run Dash Electrum from your Applications folder when complete.
fr: Téléchargez simplement le fichier DMG puis lancez-le. Il est possible que vous deviez accorder une autorisation à l'installeur, en fonction de vos réglages de sécurité. Cliquez tout au long de l'assistant d'installation puis, une fois terminée, lancez Dash Electrum depuis votre dossier Applications.

source: Simply download and run the installer file to set up Dash Electrum. You may need to grant permission to install, depending on your security settings. Click through the installation wizard and run Dash Electrum from the Start menu when complete.
fr: Téléchargez simplement l'installeur puis lancez-le. Il est possible que vous deviez accorder une autorisation à l'installeur, en fonction de vos réglages de sécurité. Cliquez tout au long de l'assistant d'installation puis, une fois terminée, lancez Dash Electrum depuis votre menu Démarrer.

source: Download and run the APK file from https://electrum.dash.org to set up Dash Electrum. You may need to grant permission to install from unknown sources, depending on your security settings. Click through the installation wizard and run Dash Electrum when complete.
fr: Téléchargez et exécutez le fichier APK depuis https://electrum.dash.org pour installer Dash Electrum. Il est possible que vous deviez accorder une autorisation d'installer depuis des sources inconnues, en fonction de vos réglages de sécurité. Cliquez tout au long de l'assistant d'installation puis, une fois terminée, lancez Dash Electrum.

source: Creating a New Wallet
fr: Création d'un nouveau portefeuille

source: Dash Electrum gathers configuration data when run for the first time. For more on the concepts behind this process, skip to the later sections of this guide discussing backups, security, and addresses. When setting up Dash Electrum for the first time, a wizard will guide you through the process of creating your first wallet. The first screen asks how you would like to connect to the remote server. Select **Auto connect** and click **Next** to continue. You will see a notice that no wallet currently exists. Enter a name for your wallet (or accept the default name) and click **Next** to create your wallet.
fr: Dash Electrum réunit des données de configuration quand il est lancé pour la première fois. Pour en savoir plus sur cette procédure, consultez les derniers paragraphes de ce guide à propos des sauvegardes, de la sécurité et des adresses. Au premier lancement de Dash Electrum, un assistant vous guidera pour la création de votre premier portefeuille. Le premier écran demande comment vous souhaitez vous connecter au serveur distant. Choisissez **Connexion automatique** et cliquez sur **Suivant** pour continuer. Vous verrez un avertissement selon lequel aucun portefeuille n'existe encore. Indiquez un nom pour le portefeuille (ou acceptez le nom par défaut) et cliquez sur **Suivant** pour créer votre portefeuille.

source: Selecting the server and naming your first wallet
fr: Choix du serveur et du nom de votre premier portefeuille

source: You will be asked what kind of wallet you want to create. Choose between **Standard wallet**, **Multi-signature wallet** and **Watch Dash addresses**. If you are unsure, select **Standard wallet** and click **Next** to continue. You will then be asked how you want to store/recover the seed. If stored safely, a seed can be used to restore a lost wallet on another computer. Choose between **Create a new seed**, **I already have a seed**, **Use public or private keys** or **Use a hardware device**. If you are using Electrum Dash for the first time and not restoring an existing wallet, choose **Create a new seed** and click **Next** to continue.
fr: Il vous sera demandé le type de portefeuille que vous souhaitez créer. Choisissez entre **Portefeuille standard**, **Portefeuille multi-signatures** et **Surveillance d'adresses Dash**. Si vous êtes incertain, choisissez **Portefeuille standard** et cliquez sur **Suivant** pour continuer. Il vous sera alors demandé comment vous voulez stocker/récupérer la graine. Si stockée dans un lieu sûr, une graine peut être utilisée pour restaurer un portefeuille perdu sur un autre ordinateur. Choisissez entre **Créer une nouvelle graine**, **Je dispose déjà d'une graine**, **Utiliser des clés publiques ou privées** ou **Utiliser un portefeuille matériel**. Si vous utilisez Electrum Dash pour la première fois et ne restaurez pas un portefeuille existant, choisissez **Créer une nouvelle graine** et cliquez sur **Suivant** pour continuer.

source: Selecting the wallet type and keystore
fr: Choix du type de portefeuille et du stockage de clés

source: Electrum Dash will generate your wallet and display the recovery seed. Write this seed down, ideally on paper and not in an electronic format, and store it somewhere safe. This seed is the only way you can recover your wallet if you lose access for any reason. To make sure you have properly saved your seed, Electrum Dash will ask you to type it in as a confirmation. Type the words in the correct order and click **Next** to continue.
fr: Electrum Dash génère votre portefeuille et affiche la graine de récupération. Écrivez cette graine quelque part, idéalement sur papier et pas sous forme électronique, et stockez-la dans un endroit sûr. Cette graine est la seule façon de récupérer votre portefeuille si vous en perdez l'accès pour une raison quelconque. Pour être certain que vous avez correctement pris note de la graine, Electrum Dash vous demandera de la retaper, à titre de confirmation. Tapez les mots dans le bon ordre puis cliquez sur **Suivant** pour continuer.

source: Generating and confirming the recovery seed
fr: Génération et confirmation de la graine de récupération

source: A password optionally secures your wallet against unauthorized access. Adding a memorable, strong password now improves the security of your wallet by encrypting your seed from the beginning. Skipping encryption at this point by not selecting a password risks potential theft of funds later, however unlikely the threat may be. Enter and confirm a password, ensure the **Encrypt wallet file** checkbox is ticked and click **Next** to continue.
fr: Un mot de passe facultatif améliore la sécurité de votre portefeuille contre les accès non souhaités. Ajouter un mot de passe fort et simple à mémoriser améliore la sécurité du portefeuille en chiffrant la graine dès le départ. Sauter l'étape de chiffrage et ne pas choisir de mot de passe augmente les risques de vol ultérieur des fonds, même si la menace peut paraître improbable. Saisissez puis confirmez un mot de passe, assurez-vous que la case **Chiffrer le fichier de portefeuille** soit cochée, puis cliquez sur **Suivant** pour continuer.

source: Entering and confirming a wallet encryption password
fr: Saisie et confirmation d'un mot de passe pour chiffrage de portefeuille

source: Your Dash Electrum wallet is now set up and ready for use.
fr: Votre portefeuille Dash Electrum est désormais configuré et prêt à l'utilisation.

source: Dash Electrum after setup is complete
fr: Dash Electrum une fois la configuration terminée
