Repository: 12Gitcat/docs
Catalog: locale/*/LC_MESSAGES/wallets/electrum/security.po
Languages: ar, es, fr, pt, zh_cn

source: Security, backup and safety when using the Dash Electrum wallet
ar: الأمان والنسخ الاحتياطي والسلامة عند استخدام محفظة داش ألكتروم
es: Seguridad, respaldo y protección cuando se utiliza la billetera Dash Electrum
fr: Sécurité et sauvegardes dans l'utilisation du portefeuille logiciel Dash Electrum
pt: Segurança, backup e segurança ao usar a carteira Dash Electrum
zh_cn: 使用达世币轻钱包时的安全和备份事宜

source: dash, wallet, electrum, safety, password, backup, security, restore
ar: داش، محفظة، ألكتروم، السلامة، الرقم السري، إسترداد، الحماية، إسترجاع
es: dash, billetera, electrum, protección, contraseña, respaldo, seguridad, restaurar
fr: dash, wallet, electrum, sécurité, mot de passe, sauvegarde, restauration
pt: Segurança, backup e segurança ao usar a carteira Dash Electrum
zh_cn: 达世币，钱包，轻钱包，安全，密码，备份，安全，恢复

source: Wallet security
ar: آمان المحفظة
es: Seguridad de la billetera
fr: Sécurité du portefeuille
pt: Carteira Segura
zh_cn: 钱包的安全

source: Change password
ar: تغير الرقم السري
es: Cambiar contraseña
fr: Modifier le mot de passe
pt: Alterar senha
zh_cn: 更改密码

source: To change the wallet's password, select the **Wallet > Password** option from the main menu, or click on the lock icon in the lower right of the main window. Enter and confirm a new secure password. Should you forget your wallets' password, all is not lost. Your wallet can be restored in its entirety using the backup procedure described here.
ar: لتغيير كلمة المرور الخاصة بالمحفظة ، حدد الخيار **محفظة> الرقم السري** من القائمة الرئيسية ، أو انقر فوق رمز القفل الموجود في أسفل يمين النافذة الرئيسية. أدخل وتأكد من كلمة مرور جديدة آمنة. يجب أن تنسى كلمة المرور الخاصة بك محافظ ، لا تضيع كل شيء. يمكن استعادة محفظتك بالكامل باستخدام إجراء النسخ الاحتياطي الموضح هنا.
es: Para cambiar la contraseña de el monedero, selecciona la opción **Billetera > Contraseña** en el menú principal, o haz clic en el icono de candado en la esquina inferior derecha de la ventana principal. Ingresa y confirma una nueva contraseña segura. Si olvidas la contraseña de tu billetera, no todo estará perdido. Tu billetera se puede restaurar en su totalidad utilizando el procedimiento de respaldo que se describe aquí.
fr: Pour modifier le mot de passe, choisissez l'option **Portefeuille > Mot de passe** du menu principal, ou cliquez sur l'icône en forme de cadenas au coin inférieur droit de la fenêtre principale. Saisissez puis confirmez un nouveau mot de passe sûr. Si vous veniez à perdre le mot de passe de votre portefeuille, tout ne serait pas perdu. Votre portefeuille pourrait être restauré dans son intégralité en utilisant la procédure de sauvegarde décrite ici.
pt: Para alterar a senha da carteira, selecione a opção **Carteira > Senha** no menu principal ou clique no ícone de bloqueio no canto inferior direito da janela principal. Digite e confirme uma nova senha segura. Se você esquecer a senha de sua carteira, nem tudo está perdido. Sua carteira pode ser restaurada em sua totalidade usando o procedimento de backup descrito aqui.
zh_cn: 如需修改密码，用户需要从主菜单中选择 **钱包 > 密码** ，或单击主窗口右下角的锁定图标。随后，用户需要输入并确认新的安全密码。需要牢记的是，如果用户忘记密码，那么相关数据和资金并不会丢失，用户还能通过本文档中介绍的备份程序的恢复步骤来复原钱包。

source: Backup
ar: إسترجاع
es: Respaldo
fr: Sauvegarde
zh_cn: 备份

source: In Dash Electrum, a seed is a complete backup of all addresses and transactions. Access your wallet's seed through the seed icon in the lower right of the main screen, or the **Wallet > Seed** main menu option. When prompted, enter the secure password you chose when setting up the Dash Electrum wallet.
ar: في داش ألكتروم ، تعد البذور نسخة احتياطية كاملة من جميع العناوين والمعاملات. يمكنك الوصول إلى بذور محفظتك من خلال رمز البذور الموجود في أسفل يمين الشاشة الرئيسية ، أو خيار القائمة الرئيسية **محفظة> تلصنف**. عند المطالبة ، أدخل كلمة المرور الآمنة التي اخترتها عند إعداد محفظة داش ألكتروم.
es: En Dash Electrum, una semilla es un respaldo completo de todas las direcciones y transacciones. Accede a la semilla de tu billetera a través del icono de la semilla en la esquina inferior derecha de la pantalla principal, o la opción del menú principal **Billetera > Semilla**. Cuando se te solicite, ingresa la contraseña segura que elegiste al configurar la billetera Dash Electrum.
fr: Dans Dash Electrum, une graine représente une sauvegarde complète de toutes les adresses et transactions. Accédez à la graine de votre portefeuille en cliquant sur l'icône graine au coin inférieur droit de l'écran principal, ou bien par le menu **Portefeuille > Graine**. Quand il vous est demandé, saisissez le mot de passe sûr que vous aviez choisi au moment de l'installation du portefeuille Dash Electrum.
pt: No Dash Electrum, uma semente é um backup completo de todos os endereços e transações. Acesse a semente da sua carteira através do ícone de semente no canto inferior direito da tela principal, ou a opção do menu principal **Carteira > Semente**. Quando solicitado, digite a senha segura que você escolheu ao configurar a carteira do Dash Electrum.
zh_cn: 在达世币轻钱包中，种子指的是所有地址和交易数据的完整备份。用户可以通过主屏右下方的种子图标或主菜单选项 **钱包 > 种子** 来获取种子。一旦界面弹出提示，用户可在安装达世币轻钱包的时候设置安全密码。

source: Displaying the wallet recovery seed in Dash Electrum
ar: عرض بذور استرداد المحفظة في داش ألكتروم
es: Mostrar la semilla de recuperación de la billetera en Dash Electrum
fr: Affichage de la graine de récupération de portefeuille dans Dash Electrum
pt: Exibindo a semente de recuperação de carteira no Dash Electrum
zh_cn: 在达世币轻钱包中显示的钱包恢复种子

source: Hand-copy the twelve words found in the box to a piece of paper and store it in a safe location. Remember, anyone who finds your seed can spend all of the funds in your wallet.
ar: قم بنسخ اثنتي عشر كلمة موجودة في الصندوق إلى قطعة من الورق وتخزينها في مكان آمن. تذكر ، يمكن لأي شخص يجد بذورك أن ينفق كل الأموال في محفظتك.
es: Copia a mano las doce palabras que se encuentran en el cuadro a una hoja de papel y guárdalo en un lugar seguro. Recuerda, cualquiera que encuentre tu semilla puede gastar todos los fondos en tu billetera.
fr: Recopiez les douze mots affichés sur une feuille de papier, et conservez-la dans un endroit sûr. N'oubliez pas que toute personne qui trouve votre graine peut dépenser tous les fonds de votre portefeuille.
pt: Faça uma cópia manual das doze palavras encontradas na caixa em um pedaço de papel e armazene-a em um local seguro. Lembre-se, qualquer um que encontrar sua semente pode gastar todos os fundos em sua carteira.
zh_cn: 将密码框中的十二个字符密码记录到纸上并妥善保管。请牢记，任何拥有这个种子的个人都可以花费相应钱包中的所有资金。

source: Viewing the recovery seed
ar: رؤية كلمات الإسترداد
es: Ver la semilla de recuperación
fr: Affichage de la graine de récupération
pt: Visualizando a semente de recuperação
zh_cn: 查看恢复种子

source: Alternatively, a backup file can be saved using the **File > Save Copy** main menu option. This file stores the wallet's encrypted seed along with any imported addresses. Restoring this backup will require the wallet password.
ar: بدلاً من ذلك ، يمكن حفظ ملف النسخ الاحتياطي باستخدام الخيار **ملف> حفظ نسخة**. يخزن هذا الملف البذور المشفرة في المحفظة إلى جانب أي عناوين مستوردة. ستحتاج استعادة هذه النسخة الاحتياطية إلى كلمة مرور الحافظة.
es: Alternativamente, se puede guardar un archivo de respaldo usando la opción del menú principal **Archivo > Guardar copia**. Este archivo almacena la semilla encriptada de la billetera junto con las direcciones importadas. La restauración de este respaldo requerirá la contraseña de la billetera.
fr: Autre méthode : un fichier de sauvegarde peut être obtenu par le menu **Fichier > Enregistrer une copie**. Ce fichier contient la graine du portefeuille, chiffrée, ainsi que toutes les adresses éventuellement importées. Restaurer cette sauvegarde demandera la connaissance du mot de passe du portefeuille.
pt: Como alternativa, um arquivo de backup pode ser salvo usando a opção do menu principal **Arquivo > Salvar cópia**. Este arquivo armazena a semente criptografada da carteira junto com os endereços importados. Restaurar este backup exigirá a senha da carteira.
zh_cn: 此外，用户还可以通过主菜单选项 **文件 > 保存副本** 来进行存储。这个备份文件包含钱包的加密种子和所有的导入地址。如需恢复备份，用户则需要用到钱包密码。

source: Restore
ar: إسترجاع
es: Restaurar
fr: Restauration
pt: Restaurar
zh_cn: 恢复

source: The only thing needed to recover a Dash Electrum wallet on another computer is its seed. You can test wallet recovery with your current installation of Dash Electrum by removing the wallet data from the application data folder. This optional procedure is described below. Before continuing, verify that your seed is written down clearly and correctly on paper.
ar: الشيء الوحيد المطلوب لاسترداد محفظة داش الكتروم على جهاز كمبيوتر آخر هو بذوره. يمكنك اختبار استرداد المحفظة من خلال التثبيت الحالي لـ داش الكتروم عن طريق إزالة بيانات المحفظة من مجلد بيانات التطبيق. يتم وصف هذا الإجراء الاختياري أدناه. قبل المتابعة ، تحقق من كتابة بطاقتك بشكل واضح وصحيح على الورق.
es: Lo único que se necesita para recuperar una billetera Dash Electrum en otra computadora es la semilla. Puedes probar la recuperación de la billetera con tu instalación actual de Dash Electrum quitando los datos de la billetera de la carpeta de datos de la aplicación. Este procedimiento opcional se describe a continuación. Antes de continuar, verifica que tu semilla esté escrita clara y correctamente en papel.
fr: La seule chose indispensable pour récupérer un portefeuille Dash Electrum sur un autre ordinateur, c'est la graine. Vous pouvez tester la récupération de portefeuille avec votre installation actuelle de Dash Electrum ; il suffit d'enlever les données de portefeuille du répertoire de données. Cette procédure facultative est décrite ci-dessous. Avant de continuer, veuillez vérifier que votre graine est écrite clairement et correctement sur une feuille de papier.
pt: A única coisa necessária para recuperar uma carteira Dash Electrum em outro computador é a sua semente. Você pode testar a recuperação da carteira com a sua instalação atual do Dash Electrum removendo os dados da carteira da pasta de dados do aplicativo. Este procedimento opcional é descrito abaixo. Antes de continuar, verifique se a sua semente está escrita de forma clara e correta no papel.
zh_cn: 如需在另一台计算机上恢复达世币轻钱包，用户唯一需要用到的就是种子。用户可以从应用程序数据文件夹中删除钱包数据，以此测试当前安装的达世币轻钱包的恢复情况，具体步骤如下所示。在进行后续操作之前，请用户务必确认种子已经清晰无误地记录下来了。

source: To get Dash Electrum to generate a new wallet, the old wallet data needs to be deleted. Begin by closing Dash Electrum. Next, locate the application data folder according to your operating system:
ar: للحصول على داش الكتروم لإنشاء محفظة جديدة ، يجب حذف بيانات المحفظة القديمة. ابدأ بإغلاق داش الكتروم. بعد ذلك ، حدد موقع مجلد بيانات التطبيق وفقًا لنظام التشغيل الخاص بك:
es: Para que Dash Electrum genere una nueva billetera, es necesario eliminar los datos de la billetera anterior. Comienza cerrando Dash Electrum. A continuación, busca la carpeta de datos de la aplicación de acuerdo con tu sistema operativo:
fr: Pour que Dash Electrum crée un nouveau portefeuille, les données de l'ancien portefeuille doivent être supprimées. Commencez par quitter l'application Dash Electrum. Puis repérer le répertoire de données de l'application, selon votre système d'exploitation :
pt: Para que a Dash Electrum gere uma nova carteira, os dados antigos da carteira precisam ser excluídos. Comece fechando o Dash Electrum. Em seguida, localize a pasta de dados do aplicativo de acordo com o seu sistema operacional:
zh_cn: 如需生成达世币轻钱包的新钱包，用户需要删除旧的钱包数据。用户首先需要关闭达世币轻钱包，然后再根据个人的操作系统找到应用程序的数据文件夹：

source: **Linux:**
ar: **لينكس**

source: Open Files, select **Go > Go to folder**, copy the path ``~/.electrum`` and paste it into the dialog box
ar: افتح ملفات ، حدد **انتقال> اذهب إلى المجلد** ، انسخ المسار ``~/.electrum`` وقم بلصقه في مربع الحوار
es: Abrir archivos, selecciona **Ir > Ir a la carpeta**, copia la ruta ``~/.electrum`` y pégala en el cuadro de diálogo
fr: Ouvrez Fichiers, choisissez **Aller > Aller au dossier**, copiez le chemin ``~/.electrum`` et collez-le dans la boîte de dialogue
pt: Abra Arquivos, selecione **Ir> Ir para pasta**, copie o caminho ``~/.electrum`` e cole-o na caixa de diálogo
zh_cn: 打开文件夹，选择 **访问 > 访问文件夹** ，然后将路径 ``~/.electrum`` 复制粘贴到对话框中

source: Delete all files in the folder
ar: احذف جميع الملفات الموجودة في المجلد
es: Borrar todos los archivos en la carpeta
fr: Effacez tous les fichiers contenus dans le répertoire
pt: Excluir todos os arquivos da pasta
zh_cn: 删除文件夹中的所有文件

source: **macOS:**
ar: **ماك**

source: Open Finder, select **Go > Go to Folder**, copy the path ``~/.electrum`` and paste it into the dialog box
ar: افتح Finder ، حدد **اذهب> الى المجلد** ، انسخ المسار ``~/.electrum`` والصقه في مربع الحوار
es: Abrir buscador, selecciona **Ir > Ir a la carpeta**, copia la ruta ``~/.electrum`` y pégala en el cuadro de diálogo
fr: Ouvrez le Finder, choisissez **Aller > Aller au dossier**, copiez le chemin ``~/.electrum`` et collez-le dans la boîte de dialogue
pt: Abra o Finder, selecione **Ir > Vá para a Pasta**, copie o caminho ``~/.electrum`` e cole-o na caixa de diálogo
zh_cn: 打开文件夹，选择 **访问 > 访问文件夹** ，然后将路径 ``~/.electrum`` 复制粘贴到对话框中

source: **Windows:**
ar: **ويندوز**

source: Open Explorer, copy the path ``%APPDATA%\Electrum-DASH`` and paste it in to the address bar
ar: افتح Explorer ، انسخ المسار ``%APPDATA%\Electrum-DASH`` ولصقه في شريط العنوان
es: Abrir el explorador, copia la ruta ``%APPDATA%\Electrum-DASH`` y pégala en la barra de direcciones
fr: Ouvrez l'Explorateur, copiez le chemin ``%APPDATA%\Electrum-DASH`` et collez-le dans la barre d'adresse
pt: Abra o Explorer, copie o caminho ``%AAPPDATA%\Electrum-DASH`` e cole-o na barra de endereços
zh_cn: 打开Explorer浏览器，然后将路径 ``%APPDATA%\Electrum-DASH`` 复制粘贴到地址栏中

source: Having cleared the data directory, restart Dash Electrum. A dialog will appear asking you to name your new wallet. Enter a name, select **Standard wallet** as the wallet type and then choose **I already have a seed**.
ar: بعد مسح دليل البيانات ، أعد تشغيل داش الكتروم. سيظهر مربع حوار يطلب منك تسمية محفظتك الجديدة. أدخل اسمًا ، حدد **محفظة قياسية** كنوع المحفظة ثم اختر **لدي بالفعل بذور**.
es: Habiendo borrado el directorio de datos, reinicia Dash Electrum. Aparecerá un cuadro de diálogo pidiéndote que nombres tu nueva billetera. Ingresa un nombre, selecciona **Billetera estándar** asi como el tipo de billetera y luego elije **Ya tengo una semilla**.
fr: Une fois le répertoire de données vidé, relancez Dash Electrum. Un dialogue apparaîtra, vous demandant de donner un nom à votre nouveau portefeuille. Saisissez un nom, choisissez **Portefeuille standard** comme type de portefeuille, puis choisissez **Je dispose déjà d'une graine**.
pt: Tendo apagado o diretório de dados, reinicie o Dash Electrum. Uma caixa de diálogo aparecerá pedindo para você nomear sua nova carteira. Digite um nome, selecione **carteira padrão** como o tipo de carteira e, em seguida, escolha **Eu já tenho uma semente**.
zh_cn: 清除数据目录后，用户需要重新启动达世币轻钱包。此时，界面将会出现一个对话框，要求用户为新钱包命名。根据提示，用户可输入名称，选择 **标准钱包** 作为钱包类型，然后再选择 **已有种子** 。

source: Restoring a wallet from an existing seed
ar: استعادة محفظة من الكلمات موجودة
es: Restaurar una billetera desde una semilla existente
fr: Restauration d'un portefeuille à partir d'une graine déjà existante
pt: Restaurando uma carteira de uma semente existente
zh_cn: 借助现有的种子备份钱包

source: Next, copy the twelve word seed into the text field.
ar: بعد ذلك ، قم بنسخ البذور كلمة إتنان عشرة في حقل النص.
es: Luego, copia la semilla de doce palabras en el campo de texto.
fr: Ensuite, copiez la graine de douze mots dans le champ de texte.
pt: Em seguida, copie a semente de doze palavras para o campo de texto.
zh_cn: 接下来，用户需要将十二个字符的种子复制粘贴到文本框中。

source: Entering the recovery seed
ar: ادخل كلمات الإسترداد
es: Ingresar una semilla de recuperación
fr: Saisie de la graine de récupération
pt: Entrando na semente de recuperação
zh_cn: 输入恢复种子

source: If your seed was entered correctly, Dash Electrum gives you the option to add a password for your wallet. After restoring your wallet, Dash Electrum will list any existing transactions from this wallet. This process may take a few minutes, and the transactions may appear as **Not Verified**. This problem disappears after restarting the program.
ar: إذا تم إدخال البذور بشكل صحيح ، يمنحك داش ألكتروم خيار إضافة كلمة مرور لمحفظة. بعد استعادة محفظتك ، سيقوم داش ألكتروم بإدراج أي معاملات موجودة من هذه المحفظة. قد تستغرق هذه العملية بضع دقائق ، وقد تظهر المعاملات كـ **غير مُثبَّت**. تختفي هذه المشكلة بعد إعادة تشغيل البرنامج.
es: Si tu semilla fue ingresada correctamente, Dash Electrum te da la opción de agregar una contraseña para tu billetera. Después de restaurar tu billetera, Dash Electrum listará todas las transacciones existentes de esta billetera. Este proceso puede demorar unos minutos y las transacciones pueden aparecer como **No verificadas**. Este problema desaparece después de reiniciar el programa.
fr: Si votre graine a été saisie correctement, Dash Electrum vous donne l'option d'ajouter un mot de passe à votre portefeuille. Après restauration de votre portefeuille, Dash Electrum répertoriera toutes les transactions existantes depuis ce portefeuille. Ce processus peut prendre quelques minutes, et les transactions peuvent être affichées comme **Non vérifiées**. Ce problème disparaît au redémarrage du programme.
pt: Se a sua semente foi inserida corretamente, a Dash Electrum lhe dá a opção de adicionar uma senha para sua carteira. Depois de restaurar sua carteira, a Dash Electrum listará todas as transações existentes nessa carteira. Esse processo pode demorar alguns minutos e as transações podem aparecer como **Não verificado**. Esse problema desaparece depois de reiniciar o programa.
zh_cn: 如果用户输入了正确的种子，那么达世币轻钱包就会提示用户为钱包添加密码。在钱包恢复后，达世币轻钱包将列出这个钱包中所有的现有交易。这个过程可能需要花费几分钟的时间，而交易可能会显示为 **未经验证** 。在程序重新启动后，这个问题就会自行解决。

source: Unverified transactions after recovery
ar: المعاملات غير المؤكدة بعد الاسترداد
es: Transacciones no verificadas después de la recuperación
fr: Transactions non vérifiées après une restauration
pt: Transações não verificadas após a recuperação
zh_cn: 恢复钱包后显示的未经验证交易
