Repository: 12Gitcat/docs
Catalog: locale/*/LC_MESSAGES/introduction/about.po
Languages: pt

source: Introduction to the Dash cryptocurrency and links to further reading
pt: Introdução a criptomoeda Dash e links para leitura adicional

source: dash, cryptocurrency, videos, documentation, roadmap, governance, funding, payments, whitepaper, roadmap
pt: dash, criptomoeda, videos, documentação, roadmap, governança, financiamento, pagamentos, whitepaper, roteiro

source: What is Dash?
pt: O que é o Dash?

source: Dash aims to be the most user-friendly and scalable payments-focused cryptocurrency in the world. The Dash network features :ref:`instant transaction confirmation <instantsend>`, double spend protection, :ref:`anonymity <privatesend>` equal to that of physical cash, a :ref:`self-governing, self-funding model <decentralized-governance>` driven by :ref:`incentivized full nodes <masternode-network>` and a `clear roadmap <https://github.com/dashpay/dash-roadmap>`_ for on-chain scaling to up to 400MB blocks using custom-developed open source hardware. While Dash is based on Bitcoin and compatible with many key components of the Bitcoin ecosystem, its two-tier network structure offers significant improvements in transaction speed, anonymity and governance. This section of the documentation describes these and many more key features that set Dash apart in the blockchain economy.
pt: O Dash pretende ser a criptomoeda com foco em pagamentos mais fácil de usar e escalável do mundo. A rede do Dash apresenta :ref:`confirmação instantânea de transação <instantsend>`, proteção contra gasto duplo, :ref:`anonimato <privatesend>` igual ao de dinheiro físico, a :ref:`modelo auta-governança e de auto-financiamento <decentralized-governance>` impulsionado por :ref:`nós incentivados <masternode-network>` e um `roteiro claro <https://github.com/dashpay/dash-roadmap>`_ para escalonamento on-chain para blocos de até 400MB usando hardware de código aberto desenvolvido sob medida. Embora o Dash seja baseado no Bitcoin e compatível com muitos componentes-chave do ecossistema Bitcoin, sua estrutura de rede de dois níveis oferece melhorias significativas na velocidade de transação, anonimato e governança. Esta seção da documentação descreve esses e muitos outros recursos importantes que diferenciam o Dash na economia de blockchain.

source: The videos, links and documentation collected here can help you get started, or use the table of contents on the left to find a specific topic of interest. New users may be interested in getting started with an appropriate :ref:`wallet <wallets>`, learning about :ref:`how to buy Dash <how-to-buy>` and :ref:`where to spend Dash <earning-spending>`, learning about :ref:`safety <safety>` or joining one of the many :ref:`Dash community sites <information>`.
pt: Os vídeos, links e documentação coletados aqui podem ajudá-lo a começar ou usar o sumário à esquerda para encontrar um tópico específico de interesse. Novos usuários podem estar interessados em começar com um apropriado :ref:`wallet <wallets>`, aprendendo sobre :ref:`como comprar Dash <how-to-buy>` e :ref:`onde gastar Dash <earning-spending>`, aprendendo sobre :ref:`segurança <safety>` ou entrando rm um dos muitos :ref:`Sites da comunidade Dash <information>`.

source: Dash School
pt: Escola Dash

source: Dash School is a six-part video series produced by Amanda B. Johnson. It explains Dash from a beginner's level up to descriptions of the more advanced features.
pt: Escola Dash é uma série de vídeos em seis partes produzida por Amanda B. Johnson. Ela explica Dash desde o nível de um iniciante até as descrições dos recursos mais avançados.

source: Dash 101 is an eight-part video series produced by Aaron Koenig. It covers unique features and functions only available on the Dash network, and is available in `English <https://www.youtube.com/watch?v=DzH7cMbZQHI&list=PLiFMZOlhgsYIDP2V2XsuTFZu1C1sV5ohr>`__, `French <https://www.youtube.com/watch?v=CMGXChAR9f4&list=PLiFMZOlhgsYJvvpWN9xGSxwIVejOWVXKZ>`__, `German <https://www.youtube.com/watch?v=0YyDGu17IE4&list=PLiFMZOlhgsYKrbanA3ng7oh2aNRh7D98V>`__, `Spanish <https://www.youtube.com/watch?v=AwqrG_K8nzw&list=PLiFMZOlhgsYK8P_NViNEJKCzADzdT8k0R>`__ and `Russian <https://www.youtube.com/watch?v=cAPgPUMVwzo&list=PLiFMZOlhgsYKBYORZIReix5hejKj08nUk>`__.
pt: Dash 101 é uma série de vídeos de oito partes produzido por Aaron Koenig. Ele cobre recursos e funções exclusivas disponíveis apenas na rede do Dash e está disponível em `Ingles<https://www.youtube.com/watch?v=DzH7cMbZQHI&list=PLiFMZOlhgsYIDP2V2XsuTFZu1C1sV5ohr>`__, `Frances <https://www.youtube.com/watch?v=CMGXChAR9f4&list=PLiFMZOlhgsYJvvpWN9xGSxwIVejOWVXKZ>`__, `Alemão <https://www.youtube.com/watch?v=0YyDGu17IE4&list=PLiFMZOlhgsYKrbanA3ng7oh2aNRh7D98V>`__, `Espanhol <https://www.youtube.com/watch?v=AwqrG_K8nzw&list=PLiFMZOlhgsYK8P_NViNEJKCzADzdT8k0R>`__ e `Russo <https://www.youtube.com/watch?v=cAPgPUMVwzo&list=PLiFMZOlhgsYKBYORZIReix5hejKj08nUk>`__.

source: The Dash Whitepaper describes the unique value proposition and key innovations in Dash from an academic and theoretical perspective. It is a living document maintained as a GitHub wiki, receiving ongoing updates and frequent community translations as new features are implemented. Various other whitepapers describing particular features in additional detail and (for historical reasons) the original whitepaper are available for download as PDF files.
pt: O Whitepaper do Dash descreve a proposta de valor exclusiva e as principais inovações no Dash, de uma perspectiva acadêmica e teórica. É um documento vivo mantido como um wiki do GitHub, recebendo atualizações contínuas e traduções frequentes da comunidade, à medida que novos recursos são implementados. Vários outros documentos técnicos descrevendo características particulares com detalhes adicionais e (por razões históricas) o documento técnico original está disponível para download como arquivos PDF.

source: `Latest whitepaper and official translations <https://github.com/dashpay/dash/wiki/Whitepaper>`_
pt: `Último whitepaper e traduções oficiais <https://github.com/dashpay/dash/wiki/Whitepaper>`_

source: Roadmap
pt: Cronograma

source: The Dash Roadmap sets out delivery milestones for future releases of Dash and includes specific technical details describing how the development team plans to realise each challenge. Like the Whitepaper, it is versioned and maintained as a project on GitHub.
pt: O cronograma do Dash define os marcos de entrega para futuras versões do Dash e inclui detalhes técnicos específicos que descrevem como a equipe de desenvolvimento planeja realizar cada desafio. Como o Whitepaper, ele é versionado e mantido como um projeto no GitHub.
