Repository: 12Gitcat/docs
Catalog: locale/*/LC_MESSAGES/introduction/features.po
Languages: ru

source: Dash features several unique value propositions including masternodes, PrivateSend, InstantSend and a decentralized governance system
ru: Dash обладает несколькими уникальными ценнными характеристиками, среди которых мастерноды, функции PrivateSend и InstantSend, а также децентрализованная система управления

source: dash, cryptocurrency, features, masternodes, privatesend, instantsend, sporks, x11, dgw, governance, sentinel, evolution
ru: dash, криптовалюта, свойства, мастерноды, privatesend, instantsend, спорки, sporks, x11, dgw, управление, хранитель, эволюция

source: Features
ru: Особенности

source: Specifications
ru: Спецификации

source: First block mined at 11PM EST, 18th January 2014
ru: Первый блок был добыт в 23:00 EST 18 января 2014 года

source: No premine
ru: Премайна не было

source: X11 hashing algorithm, CPU/GPU/ASIC mining available
ru: Алгоритм хеширования X11, доступен майнинг с помощью ЦПУ/GPU/ASIC-устройств

source: 2.6 minute block time, 2MB blocks, ~56 transactions per second
ru: Время нахождения блока 2,6 минуты, размер блока 2MB, количество транзакций в секунду - ~56

source: Block reward decreases by 7.14% per year
ru: Награда за блок уменьшается на 7,14% в год

source: Dark Gravity Wave difficulty adjustment algorithm
ru: Алгоритм изменения сложности - Dark Gravity Wave

source: Between 17.74M and 18.92M total coin supply
ru: Всего монет - от 17,74 млн. до 18,92 млн.

source: Decentralized second-tier masternode network
ru: Децентрализованный второй уровень сети мастернод

source: Superior transaction anonymity using PrivateSend
ru: Превосходная анонимность транзакций обеспечена функцией PrivateSend

source: Instant transactions using InstantSend
ru: Мгновенные транзакции обеспечены функцией InstantSend

source: Decentralized Governance By Blockchain allows masternode owners to vote on budget proposals and decisions that affect Dash
ru: Децентрализованное управление с помощью блокчейна позволяет владельцам мастернод голосовать за бюджетные предложения и решения, влияющие на развитие Dash.

source: Masternodes
ru: Мастерноды

source: In addition to traditional Proof of Work (PoW) rewards for mining Dash, users are also rewarded for running and maintaining special servers called masternodes. Thanks to this innovative two tier network, Dash can offer innovative features in a trustless and decentralized way. Masternodes are used to power PrivateSend, InstantSend, and the governance and treasury system. Users are rewarded for running masternodes; 45% of the block reward is allocated to pay the masternode network. You can view practical guides on all topics relating to masternodes :ref:`here <masternodes>`.
ru: В дополнение к традиционным наградам за добытый блок по алгоритму Proof-Of-Work (доказательство выполнения работы, PoW), пользователи Dash также получают вознаграждение за поддержание работы специальных серверов, называемых мастернодами. Благодаря своей инновационной двухуровневой структуре, Dash может предложить особые функции, работающие децентрализованно и без необходимости доверия кому- или чему-либо. При помощи мастернод работают функции PrivateSend, InstantSend, а также система управления и Бюджетная система. За запуск мастернод пользователи получают вознаграждения; 45% блочных наград распределяется на оплату сети мастернод. Практические рекомендации по всем вопросам, касающимся мастернод вы можете посмотреть :ref:`здесь <masternodes>`.

source: Masternodes enable the following services:
ru: Мастерноды позволяют работать следующим функциям:

source: **InstantSend** allows for near-instant transactions. Dash InstantSend transactions are fully confirmed within two seconds.
ru: **InstantSend** позволяет производить транзакции практически мгновенно. Транзакции Dash с использованием InstantSend полностью подтверждаются в течение двух секунд.

source: **PrivateSend** gives financial privacy by obscuring the source of funds on the blockchain.
ru: **PrivateSend** обеспечивает финансовую приватность, скрывая источник средств на блокчейне.

source: **Governance and Treasury** allows stakeholders in Dash to determine the direction of the project and devotes 10% of the block reward to development of the project and ecosystem (as of May 2018, our annual budget exceeds $30 million).
ru: **Управление и Бюджетная система** позволяет держателям Dash определять направление развития проекта и распределять 10% от награды за блок на развитие проекта и экосистемы (по состоянию на май 2018 годовой бюджет Dash превышает 30 млн. долларов США).

source: **Dash Evolution** will make using cryptocurrency as easy as using PayPal.
ru: **Эволюция Dash** сделает использование криптовалюты таким же простым, как использование PayPal.

source: Masternode owners must have possession of 1000 DASH, which they prove by signing a message and broadcasting to the network. Those coins can be moved at any time, but moving them will cause the masternode to fall out of queue and stop earning rewards. Masternode users are also given **voting rights** on proposals. Each masternode has one vote and this vote can be used on budget proposals or important decisions that affect Dash.
ru: Владелец мастерноды должен иметь в своём распоряжении 1000 DASH, доказательство владения которыми он осуществляет подписав специальное сообщение и разослав его по сети. Эта сумма может быть потрачена в любой момент, но в таком случае мастернода потеряет свой статус, покинет очередь и перестанет получать вознаграждения от сети. Кроме того, владелец мастерноды имеет **право голосования** за предложения. Каждая мастернода имеет один голос, который можно использовать при распределении бюджета или решении важных вопросов, влияющих на проект.

source: Masternodes cost money and effort to host so they are paid a percentage of the block reward as an incentivize. With current masternode numbers and rewards, masternodes earn approximately a 8% return on 1000 Dash (which means 6.97 Dash or USD1360 in July 2017) for the year of 2017. This `tool <https://stats.masternode.me/>`_ shows a live calculation of masternode earnings. These rewards decrease by 7% each year, but the rising value of Dash may offset these reductions. As a matter of fact, masternodes were receiving 140 Dash per month at the beginning of 2016, but this was actually less money than today: USD600 per month. There is also the possibility for masternodes to earn money from fees in the future.
ru: Мастерноды требуют времени и денег на поддержание своей работы, поэтому для мотивации их услуги оплачиваются из награды за блок. При текущем количестве мастернод и размере награды, одна мастернода в 2017 году зарабатывает в среднем около 8% годовых на 1000 DASH (что в месяц составляет 6,97 DASH или 1360 долларов по состоянию на июль 2017 года). Следующий `инструмент <https://stats.masternode.me/>`_ показывает текущую калькуляцию заработка на мастерноде. Указанная награда ежегодно уменьшается на 7%, но растущая стоимость DASH может компенсировать это снижение. В начале 2016 года мастерноды фактически получали 140 DASH в месяц, но это, на самом деле, составляло меньшую сумму денег, чем сегодняшние 600 долларов США в месяц. Также для мастернод существует возможность в будущем зарабатывать деньги из комиссий.

source: PrivateSend gives you true financial privacy by obscuring the origins of your funds. All the Dash in your wallet is comprised of different "inputs", which you can think of as separate, discrete coins. PrivateSend uses an innovative process to mix your inputs with the inputs of two other people, without having your coins ever leave your wallet. You retain control of your money at all times.
ru: Функия PrivateSend даёт вам полную финансовую анонимность, скрывая источники ваших средств. Все DASH в вашем кошельке состоят из различных "входов", которые можно представить себе в виде отдельных, дискретных монет. PrivateSend запускает инновационный процесс перемешивания ваших входов со входами двух других пользователей таким образом, что ваши деньги не покидают кошелёк. Вы продолжаете сохранять постоянный контроль над своими деньгами.

source: You can view a practical guide to use PrivateSend :ref:`here <dashcore-privatesend-instantsend>`.
ru: Практическое руководство по использованию функции PrivateSend вы можете посмотреть :ref:`здесь <dashcore-privatesend-instantsend>`.

source: The PrivateSend process works like this:
ru: Так работает процесс PrivateSend:

source: PrivateSend begins by breaking your transaction inputs down into standard denominations. These denominations are 0.01 Dash, 0.1 DASH, 1 DASH and 10 DASH -- much like the paper money you use every day.
ru: Работа PrivateSend начинается с разбивки ваших транзакционных входов на стандартные номиналы. Такими номиналами являются: 0,01 DASH, 0,1 DASH, 1 DASH и 10 DASH - это почти похоже на номиналы обычных купюр, которыми вы ежедневно пользуетесь.

source: Your wallet then sends requests to specially configured software nodes on the network, called "masternodes". These masternodes are informed then that you are interested in mixing a certain denomination. No identifiable information is sent to the masternodes, so they never know "who" you are.
ru: Затем ваш кошелёк рассылает запросы на специально сконфигурированные с помощью ПО узлы в сети, называемые "мастернодами". Мастерноды получают запрос о том, что вы заинтересованы в перемешивании определённых номиналов. Никакой идентифицирующей информации мастернодам не отправляется, так что они никогда не смогут определить автора запроса.

source: When two other people send similar messages, indicating that they wish to mix the same denomination, a mixing session begins. The masternode mixes up the inputs and instructs all three users' wallets to pay the now-transformed input back to themselves. Your wallet pays that denomination directly to itself, but in a different address (called a change address).
ru: Когда в сети встречаются два других аналогичных запроса на перемешивание одинаковых номиналов, начинается сессия перемешивания. Мастерноды перемешивают входы и дают инструкции всем трём пользовательским кошелькам выплатить теперь уже трансформированные входы самим себе обратно. Ваш кошелёк выплачивает номинал напрямую себе же, но на другой адрес (называемый адресом сдачи).

source: In order to fully obscure your funds, your wallet must repeat this process a number of times with each denomination. Each time the process is completed, it's called a "round". Each round of PrivateSend makes it exponentially more difficult to determine where your funds originated. The user may choose between 2-8 rounds of mixing.
ru: Чтобы надёжно скрыть ваши средства, кошелёк должен повторить выполнение этого процесса несколько раз с каждым номиналом. Каждый цикл этого процесса называется "раундом". Каждый следующий раунд PrivateSend экпоненциально усложняет возможность отследить происхождение ваших средств. Пользователь может выбрать от двух до восьми раундов перемешивания.

source: This mixing process happens in the background without any intervention on your part. When you wish to make a transaction, your funds will already be anonymized. No additional waiting is required.
ru: Процесс перемешивания происходит автоматически в фоновом режиме и не требует вмешательства с вашей стороны. Когда вы захотите выполнить транзакцию, ваши средства уже будут анонимизированы. Дополнительное ожидание не потребуется.

source: Note that PrivateSend transactions will be rounded up so that all transaction inputs are spent. Any excess Dash will be spent on the transaction fee.
ru: Обратите внимание, что сумма транзакции PrivateSend округляется, чтобы были потрачены все транзакционные входы. Все избыточные DASH будут потрачены на комиссию за транзакцию.

source: **IMPORTANT:** Your wallet only contains 1000 of these "change addresses". Every time a mixing event happens, one of your addresses is used up. Once enough of them are used, your wallet must create more addresses. It can only do this, however, if you have automatic backups enabled. Consequently, users who have backups disabled will also have PrivateSend disabled.
ru: **ВАЖНО:** Ваш кошелёк может содержать только 1000 "адресов сдачи". Каждый раз во время процесса перемешивания будет использоваться один из этих адресов. Когда они все будут израсходованы, ваш кошелёк должен будет создать новые адреса. Но это произойдёт только в том случае, если активировано автоматическое сохранение кошелька. Соответственно, если вы отключили в настройках автоматическое сохранение, то и PrivateSend использовать не сможете.

source: Traditional decentralized cryptocurrencies must wait for certain period of time for enough blocks to pass to ensure that a transaction is both irreversible and not an attempt to double-spend money which has already been spent elsewhere. This process is time-consuming, and may take anywhere from 15 minutes to one hour for the widely accepted number of six blocks to accumulate. Other cryptocurrencies achieve faster transaction confirmation time by centralizing authority on the network to various degrees.
ru: Пользователи традиционных децентрализованных криптовалют должны выждать определённый период времени для получения достаточного количества подтверждений, чтобы убедиться, что транзакция необратима и не является попыткой двойной траты денег, которые когда-то уже были потрачены. Этот процесс требует значительных временных затрат от 15 минут до часа и больше, пока накопится статистически надёжное количество из шести блоков поверх транзакции. Другие криптовалюты достигают большей скорости подтверждения транзакций за счёт использования централизованного органа в сети в той или иной форме.

source: Dash suffers from neither of these limitations thanks to its second-layer network of masternodes. Masternodes can be called upon to form voting quorums to check whether or not a submitted transaction is valid. If it is valid, the masternodes "lock" the inputs for the transaction and broadcast this information to the network, effectively promising that the transaction will be included in subsequently mined blocks and not allowing any other spending of these inputs during the confirmation time period.
ru: Dash свободен от этих ограничений благодаря второму уровню своей сети, состоящему из мастернод. Из них можно составить псевдослучайный кворум для оценки валидности предлагаемой транзакции. Если транзакция валидна, то мастерноды могут заблокировать входы для этой транзакции и распространить информацию об этом по всей сети, гарантировав, что транзакция будет включена в ближайшие блоки и не позволяя повторно использовать её входы, пока она подтверждается в блоках.

source: InstantSend technology will allow for cryptocurrencies such as Dash to compete with nearly instantaneous transaction systems such as credit cards for point-of-sale situations while not relying on a centralized authority. Widespread vendor acceptance of Dash and InstantSend could revolutionize cryptocurrency by shortening the delay in confirmation of transactions from as long as an hour (with Bitcoin) to as little as a few seconds.
ru: Технология InstantSend позволит таким криптовалютам как Dash конкурировать в точках продаж с традиционными платёжными системами, такими как банковские карты, работающими практически мгновенно и не полагаться при этом на централизованную систему. Широкое распространение Dash как средства платежа и его функции InstantSend в торговых точках произведёт криптореволюцию в розничной торговле, сократив сроки ожидания транзакции от часа и более (как в сети Биткойна) до нескольких секунд.

source: You can view a practical guide to use InstantSend :ref:`here <dashcore-privatesend-instantsend>`. InstantSend was introduced in a whitepaper called `Transaction Locking and Masternode Consensus: A Mechanism for Mitigating Double Spending Attacks <https://github.com/dashpay/docs/blob/master/binary/Dash%20Whitepaper%20-%20Transaction%20Locking%20and%20Masternode%20Consensus.pdf>`_.
ru: Практическое руководство по использованию функции InstantSend можно посмотреть :ref:`здесь <dashcore-privatesend-instantsend>`. Функция InstantSend была представлена в Белой книге под названием `Блокировка транзакций и консенсус мастернод: механизм для смягчения атаки двойных трат <https://github.com/dashpay/docs/blob/master/binary/Dash%20Whitepaper%20-%20Transaction%20Locking%20and%20Masternode%20Consensus.pdf>`_.

source: **How Dash 'InstantSend' Protects Merchants from Double Spends**, Dash Detailed by Amanda B. Johnson, 16 September 2016
ru: **Как InstantSend в Dash защищает продавцов от двойных трат**, видео из канала Dash Detailed Аманды Б. Джонсон, 16 сентябоя 2016 года

source: Sporks
ru: Спорки

source: In response to unforeseen issues with the rollout of the major "RC3" update in June 2014, the Dash development team created a mechanism by which updated code is released to the network, but not immediately made active ("enforced"). This innovation allows for far smoother transitions than in the traditional hard fork paradigm, as well as the collection of test data in the live network environment. This process of multi-phased forking was originally to be called "soft forking" but the community affectionately dubbed it "the spork" and the name stuck.
ru: В качестве ответа на непредвиденные сложности, возникшие при выходе главного обновления RC3 в июне 2014 года, команда разработчиков Dash создала механизм, по которому обновлённый код выдаётся в сеть, но активизируется не сразу ("принудительно"). Эта инновация позволяет проводить обновления намного плавнее, чем это происходит в парадигме традиционного хардфорка и одновременно выполнять сбор данных о тестовой работе обновления в основной сети. Этот процесс многофазного перехода был сначала назван "софтфорком", но в сообществе он был более известен как "спорк" и именно такое название и прижилось.

source: New features or versions of Dash undergo extensive testing on testnet before they are released to the main network. When a new feature or version of Dash is released on mainnet, communication is sent out to users informing them of the change and the need for them to update their clients. Those who update their clients run the new code, but it is not activated until a sufficient percentage of network participants (usually 80%) reach consensus on running it. In the event of errors occurring with the new code, the client’s blocks are not rejected by the network and unintended forks are avoided. Data about the error can then be collected and forwarded to the development team. Once the development team is satisfied with the new code’s stability in the mainnet environment – and once acceptable network consensus is attained – enforcement of the updated code can be activated remotely by multiple members of the core development team signing a network message together with their respective private keys. Should problems arise, the code can be deactivated in the same manner, without the need for a network-wide rollback or client update. For technical details on individual sporks, see :ref:`here <understanding-sporks>`.
ru: Новые функции или версии Dash проходят интенсивные проверки в тестовой сети перед запуском их в основной сети. Когда в основной сети запускается новая функция или версия, то по сети для всех пользователей рассылается сообщение, информирующее об изменениях и необходимости обновить программное обеспечение. Пользователи, обновившие свои клиенты, запускают на них новый код, но этот код не активируется, пока достаточный процент участников сети (обычно это 80%) не достигнет консенсуса по его запуску. Если с новым кодом случаются какие-то ошибки, то блоки не отвергаются сетью и незапланированных форков не происходит. Информация об ошибках собирается и направляется команде разработчиков. Когда разработчики удовлетворены стабильностью работы нового кода в основной сети и когда необходимый уровень консенсуса в сети достигнут - новый код дистанционно вводится в действие несколькими членами команды разработчиков, которые вместе подписывают особое сообщение сети своими приватными ключами. Если возникают какие-то проблемы, то новый код деактивируется таким же способом без необходимости для всей сети откатываться к предыдущей версии. С техническими деталями каждого отдельного спорка можно ознакомиться :ref:`здесь <understanding-sporks>`.

source: X11 Hash Algorithm
ru: Хэш-алгоритм X11

source: X11 is a widely used hashing algorithm created by Dash core developer Evan Duffield. X11’s chained hashing algorithm utilizes a sequence of eleven scientific hashing algorithms for the proof-of-work. This is so that the processing distribution is fair and coins will be distributed in much the same way Bitcoin’s were originally. X11 was intended to make ASICs much more difficult to create, thus giving the currency plenty of time to develop before mining centralization became a threat. This approach was largely successful; as of early 2016, ASICs for X11 now exist and comprise a significant portion of the network hashrate, but have not resulted in the level of centralization present in Bitcoin. Information on mining with X11 can be found in the :ref:`Mining <mining>` section of this documentation.
ru: X11 - широко используемый алгоритм хеширования, созданный разработчиком Dash Core Эваном Даффилдом. Алгоритм хеширования X11 в блокчейне использует последовательность из одиннадцати научных алгоритмов хеширования для реализации принципа доказательства выполнения работы. Это необходимо для справедливого распределения обработки транзакций и для того, чтобы распространить монеты таким же образом, как изначально были распространены Биткойны. X11 был предназначен для того, чтобы усложнить задачу создания ASIC-устройств, тем самым давая валюте достаточно времени на разработку, прежде чем нависнет угроза централизации майнинга. Этот подход был в значительной степени успешным; ASIC-устройства для X11 существуют, начиная с 2016 года и составляют значительную часть хешрейта сети, но не привели к такому уровню централизации, который присутствует в Биткойне. Информацию о майнинге на алгоритме X11 можно найти в разделе :ref:`Майнинг <mining>` данной документации.

source: X11 is the name of the chained proof-of-work (**PoW**) algorithm that was introduced in Dash (launched January 2014 as "Xcoin"). It was partially inspired by the chained-hashing approach of Quark, adding further "depth" and complexity by increasing the number of hashes, yet it differs from Quark in that the rounds of hashes are determined *a priori* instead of having some hashes being randomly picked.
ru: X11 - название алгоритма цепного доказательства выполнения работы (**PoW**), который был принят в Dash (был запущен в январе 2014 года как "Xcoin"). Частично на его создание вдохновил подход, используемый в криптовалюте Quark, где используется цепное хеширование с добавлением дополнительной "глубины" и сложности за счёт увеличения числа хешей, но X11 отличается от Quark тем, что раунды хешей определяются *априори*, вместо выбора случайным образом некоторых хешей.

source: The X11 algorithm uses multiple rounds of 11 different hashes (blake, bmw, groestl, jh, keccak, skein, luffa, cubehash, shavite, simd, echo), thus making it one of the safest and more sophisticated cryptographic hashes in use by modern cryptocurrencies. The name X11 is not related to the open source X11 windowing system common on UNIX-like operating systems.
ru: Алгоритм X11 использует несколько циклов из 11 различных хешей (blake, bmw, groestl, jh, keccak, skein, luffa, cubehash, shavite, simd, echo), что делает его одним из самых безопасных и наиболее сложных криптографических хешей, используемых в современных криптовалютах. Имя X11 никак не связано с оконной системой с открытым кодом X11 Window System, распространённой в UNIX-подобных операционных системах.
