Repository: 12Gitcat/docs
Catalog: locale/*/LC_MESSAGES/introduction/features.po
Languages: ru

source: Advantages of X11
ru: Преимущества алгоритма Х11

source: The increased complexity and sophistication of the chained algorithm provides enhanced levels of security and less uncertainty for a digital currency, compared to single-hash PoW solutions that are not protected against security risks like SPOF (Single Point Of Failure). For example, a possible but not probable computing breakthrough that "breaks" the SHA256 hash could jeopardize the entire Bitcoin network until the network shifts through a hard fork to another cryptographic hash.
ru: Повышенная сложность и изощрённость цепного алгоритма обеспечивает повышенный уровень безопасности и меньшую неопределённость для цифровой валюты по сравнению с однохешевыми решениями PoW, которые не защищены от таких небезопасных случаев как SPOF (Single Point Of Failure - единая точка отказа). Например, вероятный, но невозможный вычислительный прорыв, который "взломал" бы хеш SHA256, смог бы поставить под угрозу всю сеть Биткойна, если она не перейдёт через хардфорк на другой криптографический хеш.

source: In the event of a similar computing breakthrough, a digital currency using the X11 PoW would continue to function securely unless all 11 hashes were broken simultaneously. Even if some of the 11 hashes were to prove unreliable, there would be adequate warning for a currency using X11 to take measures and replace the problematic hashes with other more reliable hashing algorithms.
ru: В случае аналогичного вычислительного прорыва цифровая валюта, использующая алгоритм X11 PoW будет продолжать надёжное функционирование до тех пор, пока все 11 хешей не будут взломаны одновременно. Если некоторые из 11 хешей окажутся ненадёжными, это послужит адекватным предупреждением для валюты, использующей X11 принять меры и заменить проблематичные хеши другими, более надёжными алгоритмами.

source: Given the speculative nature of digital currencies and their inherent uncertainties as a new field, the X11 algorithm can provide increased confidence for its users and potential investors that single-hash approaches cannot. Chained hashing solutions, like X11, provide increased safety and longevity for store of wealth purposes, investment diversification and hedging against risks associated with single-hash currencies plagued by SPOF (Single Point Of Failure).
ru: Учитывая спекулятивный характер цифровых валют и присущие им неопределенности как новое поле, алгоритм X11 может обеспечить повышенную уверенность своих пользователей и потенциальных инвесторов в том, что одношаговые подходы не могут. Цепочки хеширования, такие как X11, обеспечивают повышенную безопасность и долговечность для сохранения целей богатства, диверсификации инвестиций и хеджирования рисков, связанных с одномашинными валютами, которые страдают от SPOF (Single Point Of Failure - единая точка отказа).

source: Evan Duffield, the creator of Dash and X11 chained-hash, has written on several occasions that X11 was integrated into Dash not with the intention to prevent ASIC manufacturers from creating ASICs for X11 in the future, but rather to provide a similar migratory path that Bitcoin had (CPUs, GPUs, ASICs).
ru: Эван Даффилд, создатель Dash и цепного хеша X11, неоднократно писал о том, что X11 был интегрирован в Dash без намерения в будущем предотвратить создание ASIC-производителями ASIC-устройств для X11 , а скорее с целью предоставить аналогичный миграционный путь, который был у Биткойна (ЦПУ, GPU, ASIC-устройства).

source: Dark Gravity Wave
ru: Алгоритм Dark Gravity Wave

source: **DGW** or *Dark Gravity Wave* is an open source difficulty-adjusting algorithm for Bitcoin-based cryptocurrencies that was first used in Dash and has since appeared in other digital currencies. DGW was authored by Evan Duffield, the developer and creator of Dash, as a response to a time-warp exploit found in *Kimoto's Gravity Well*. In concept, DGW is similar to the Kimoto Gravity Well, adjusting the difficulty levels every block (instead of every 2016 blocks like Bitcoin) based on statistical data from recently found blocks. This makes it possible to issue blocks with relatively consistent times, even if the hashing power experiences high fluctuations, without suffering from the time-warp exploit.
ru: **DGW** или *Dark Gravity Wave* - это алгоритм регулировки сложности с открытым исходным кодом для криптовалют, основанных на Биткойне, который был впервые использован в Dash и с тех пор начал появляться в других цифровых валютах. DGW разработал Эван Даффилд, который является разработчиком и создателем Dash, в ответ на возможное использование бага ложной временной отметки, обнаруженного в алгоритме *Kimoto Gravity Well*. Концепция алгоритма DGW похожа на Kimoto Gravity Well, уровень сложности в нём также корректируется после каждого блока (а не каждые 2016 блоков, как в Биткойне) на основе статистических данных из недавно найденных блоков. Это позволяет выпускать блоки с относительно последовательными метками временем создания, даже если хеширующая мощность испытывает значительные колебания, не рискуя пострадать из-за бага временного скачка.

source: Version 2.0 of DGW was implemented in Dash from block 45,000 onwards in order to completely alleviate the time-warp exploit.
ru: Версия DGW 2.0 была реализована в Dash, начиная с 45 000 блока и далее для того, чтобы полностью смягчить возможность ложной временной отметки.

source: Version 3.0 was implemented on May 14 of 2014 to further improve difficulty re-targeting with smoother transitions. It also fixes issues with various architectures that had different levels of floating-point accuracy through the use of integers.
ru: Версия 3.0 была реализована 14 мая 2014 года для большего улучшения перенаправление переназначения с более плавными переходами. Он также устраняет проблемы с различными архитектурами, которые имеют разные уровни точности с плавающей точкой за счет использования целых чисел.

source: Emission Rate
ru: Темпы эмиссии

source: Cryptocurrencies such as Dash and Bitcoin are created through a cryptographically difficult process known as mining. Mining involves repeatedly solving :ref:`hash algorithms <x11-hash-algorithm>` until a valid solution for the current :ref:`mining difficulty <dark-gravity-wave>` is discovered. Once discovered, the miner is permitted to create new units of the currency. This is known as the block reward. To ensure that the currency is not subject to endless inflation, the block reward is reduced at regular intervals, as `shown in this calculation <https://docs.google.com/spreadsheets/d/1HqgEkyfZDAA6pIZ3df2PwFE8Z430SVIzQ-mCQ6wGCh4/edit#gid=523620673>`_. Graphing this data results in a curve showing total coins in circulation, known as the coin emission rate.
ru: Криптовалюты, такие как Dash и Биткойн создаются через криптографически сложный процесс, называемый майнингом. Майнинг включает повторяющееся исполнение :ref:`алгоритмов хеширования <x11-hash-algorithm>` до тех пор, пока не будет найдено решение, удовлетворяющее текущей :ref:`сложности майнинга <dark-gravity-wave>`. Находя такое решение, майнеру разрешается создать новую единицу криптовалюты. Эти новые единицы называются наградой за блок. Для того, чтобы валюта не подвергалась бесконечной инфляции, награда за блок регулярно уменьшается, как `показано в этом расчёте https://docs.google.com/spreadsheets/d/1HqgEkyfZDAA6pIZ3df2PwFE8Z430SVIzQ-mCQ6wGCh4/edit#gid=523620673>`_. Представив эти данные в виде кривой, показывающей общее количество монет в обращении, мы получим темп эмиссии.

source: While Dash is based on Bitcoin, it significantly modifies the coin emission rate to offer a smoother reduction in coin emission over time. While Bitcoin reduces the coin emission rate by 50% every 4 years, Dash reduces the emission by one-fourteenth (approx. 7.14%) every 210240 blocks (approx. 383.25 days). It can be seen that reducing the block reward by a smaller amount each year offers a smoother transition to a fee-based economy than Bitcoin.
ru: Хотя Dash основан на коде Биткойна, темп его эмиссии значительно изменён в сторону более плавного и постепенного уменьшения награды за блок. Если в Биткойне темп эмиссии уменьшается каждые четыре года на 50%, то Dash уменьшает эмиссию примерно на одну четырнадцатую (около 7,14%) каждые 210240 блоков (это приблизительно 383,25 дней). Нетрудно заметить, что если уменьшать ежегодный размер блочной награды на небольшую величину, то такой подход обеспечивает более плавный переход к экономике за счёт взимаемых комиссий, чем это произойдёт в Биткойне.

source: Bitcoin vs. Dash coin emission rate
ru: Темпы эмиссии монет у Биткойна и Dash

source: Total coin emission
ru: Общая эмиссия монет

source: `Bitcoin's total coin emission <https://docs.google.com/spreadsheets/d/1 2tR_9WrY0Hj4AQLoJYj9EDBzfA38XIVLQSOOOVePNm0/pubhtml?gid=0&single=true>`_ can be calculated as the sum of a geometric series, with the total emission approaching (but never reaching) 21,000,000 BTC. This will continue until 2140, but the mining reward reduces so quickly that 99% of all bitcoin will be in circulation by 2036, and 99.9% by 2048.
ru: `Общая эмиссия монет Биткойна <https://docs.google.com/spreadsheets/d/1 2tR_9WrY0Hj4AQLoJYj9EDBzfA38XIVLQSOOOVePNm0/pubhtml?gid=0&single=true>`_ может быть рассчитана как сумма геометрического ряда, при этом общая эмиссия приближается (но не достигает) 21 000 000 BTC. Она будет продолжаться до 2140 года, но вознаграждение за майнинг сократится настолько быстро, что 99% всех Биткойнов будут в обращении уже к 2036 году, а 99,9% к 2048 году.

source: `Dash's total coin emission <https://docs.google.com/spreadsheets/d /1JUK4Iy8pjTzQ3Fvc-iV15n2qn19fmiJhnKDDSxebbAA/edit#gid=205877544>`_ is also the sum of a geometric series, but the ultimate total coin emission is uncertain because it cannot be known how much of the 10% block reward reserved for budget proposals will actually be allocated, since this depends on future voting behavior. Dash will continue to emit coins for approximately 192 years before a full year of mining creates less than 1 DASH. After 2209 only 14 more DASH will be created. The last DASH will take 231 years to be generated, starting in 2246 and ending when emission completely stops in 2477. Based on these numbers, a maximum and minimum possible coin supply in the year 2254 can be calculated to be between:
ru: `Общая эмиссия монет DASH <https://docs.google.com/spreadsheets/d /1JUK4Iy8pjTzQ3Fvc-iV15n2qn19fmiJhnKDDSxebbAA/edit#gid=205877544>`_также является суммой геометрического ряда, но конечная общая сумма монет неясна, потому что неизвестно, сколько из 10%-ного вознаграждения за блок, зарезервированного для бюджетных предложений, потребуется выделить фактически, так как это зависит от будущих результатов голосования. Dash будет продолжать выпускать монеты в течение примерно 192 лет, до тех пор, пока добыча за весь год майнинга не составит менее 1 DASH. После 2209 года будет создано ещё 14 DASH. Генерация последней монеты DASH займет 231 год, начиная с 2246 года и заканчивая 2477 годом, в котором эмиссия полностью прекратится. Исходя из этих чисел, максимальный и минимальный возможный объем выпуска монет в 2254 году может быть в пределах между:

source: Assuming zero treasury allocation
ru: Если предположить, что распределяемый бюджет будет нулевым

source: Assuming full treasury allocation
ru: Если предположить, что распределяемый бюджет будет составлять полную сумму

source: Block reward allocation
ru: Распределение вознаграждений за блок

source: Unlike Bitcoin, which allocates 100% of the block reward to miners, Dash holds back 10% of the block reward for use in the decentralized :ref:`budget system <decentralized-governance>`. The remainder of the block, as well as any transaction fees, are split 50/50 between the :ref:`miner <mining>` and a :ref:`masternode <masternodes>`, which is deterministically selected according to the :ref:`payment logic <payment-logic>`. Dash features superblocks, which appear every 16616 blocks (approx. 30.29 days) and can release up to 10% of the cumulative budget held back over that :ref:`budget cycle period <budget-cycles>` to the winning proposals in the budget system. Depending on budget utilization, this results in an approximate coin reward allocation over a budget cycle as follows:
ru: В отличие от Биткойна, который выделяет майнеру 100% вознаграждения за участие в майнинге, Dash удерживает 10% от вознаграждения на использование в децентрализованной :ref:`Бюджетной системе <decentralized-governance>`. Остальная часть блока, а также любые транзакционные сборы разделены пополам между :ref:`майнерами <mining>` и :ref:`мастернодами <masternodes>`, которые детерминированно назначаются согласно :ref:`логике выплат <payment-logic>`. Dash имеет суперблоки, которые появляются каждые 16616 блоков (около 30,29 дней) и могут выпустить до 10% совокупного бюджета, сдерживаемого :ref:`периодом бюджетного цикла <budget-cycles>` для прошедших голосование предложений бюджетной системы. В зависимости от использования бюджета это приводит к приблизительному распределению вознаграждения за бюджетный цикл в следующем порядке:

source: Mining Reward
ru: Вознаграждение за майнинг

source: Masternode Reward for Proof-of-service
ru: Награда мастернодам по алгоритму Proof-of-Service

source: Decentralized Governance Budget
ru: Бюджет децентрализованной системы управления

source: This documentation is based on calculations and posts by moocowmoo. Please see `this reddit post <https://www.reddit.com/r/dashpay/comments/ 7fc2on/dash_over_1000_in_a_few_weeks/dqb4pjn/>`_ for more details, or run your own `emission calculations using this tool <https://repl.it/@moocowmoo/dash-minmax-coin-generation>`_. See `this site <https://stats.masternode.me>`_ for live data on current network statistics.
ru: Данная документация основана на подсчётах и постах moocowmoo. Для более детальной информации посмотрите пожалуйста `это пост на Reddit <https://www.reddit.com/r/dashpay/comments/ 7fc2on/dash_over_1000_in_a_few_weeks/dqb4pjn/>`_ или выполните собственные `вычисления по эмиссии, используя этот инструмент <https://repl.it/@moocowmoo/dash-minmax-coin-generation>`_. Посетите `этот сайт <https://stats.masternode.me>`_ для получения живых данных по текущей статистике сети.

source: Decentralized Governance
ru: Децентрализованное управление

source: Decentralized Governance by Blockchain, or DGBB, is Dash's attempt to solve two important problems in cryptocurrency: governance and funding. Governance in a decentralized project is difficult, because by definition there are no central authorities to make decisions for the project. In Dash, such decisions are made by the network, that is, by the owners of masternodes. The DGBB system allows each masternode to vote once (yes/no/abstain) for each proposal. If a proposal passes, it can then be implemented (or not) by Dash's developers. A key example is early in 2016, when Dash's Core Team submitted a proposal to the network asking whether the blocksize should be increased to 2 MB. Within 24 hours, consensus had been reached to approve this change. Compare this to Bitcoin, where debate on the blocksize has been raging for nearly three years.
ru: Децентрализованное управление с помощью блокчейна, или DGBB, это предложенное Dash решение двух важнейших проблем в криптоиндустрии: управления и финансирования. Управлять децентрализованным проектом сложно, ведь в нём по определению нет центрального органа, принимающего решения за весь проект. В Dash такие решения принимает сеть, представленная владельцами мастернод. Система DGBB позволяет каждой мастерноде отдать один голос ("за", "против" или "воздерживаюсь") за каждое предложение. Если предложение проходит голосование, оно может быть реализовано (или нет) разработчиками Dash. Ключевым примером является 2016 год и предложение команды Dash Core, в котором она спросила у мастернод, следует ли увеличить размер блока до 2 МБ. Консенсус был достигнут за 24 часа и предложение было принято. Сравните это с сетью Биткойн, где дебаты об увеличении размера блока идут почти три года.

source: DGBB also provides a means for Dash to fund its own development. While other projects have to depend on donations or premined endowments, Dash uses 10% of the block reward to fund its own development. Every time a block is mined, 45% of the reward goes to the miner, 45% goes to a masternode, and the remaining 10% is not created until the end of the month. During the month, anybody can make a budget proposal to the network. If that proposal receives net approval of at least 10% of the masternode network, then at the end of the month a series of "superblocks" will be created. At that time, the block rewards that were not paid out (10% of each block) will be used to fund approved proposals. The network thus funds itself by reserving 10% of the block reward for budget projects.
ru: DGBB также обеспечивает финансирование дальнейшего развития Dash. Если другие проекты находятся в зависимости от добровольных пожертвований или средств, полученных в результате премайна, то Dash использует 10% награды за блок для финансирования собственного развития. Каждый раз, во время добычи очередного блока, 45% награды получает майнер, 45% уходит сети мастернод, а оставшиеся 10% не создаются до конца месяца. В течение месяца, каждый может создать бюджетное предложение для сети. Если это предложение будет одобрено с перевесом как минимум в 10% от общего числа мастернод, то в конце месяца будет создана серия "суперблоков". В этот момент все невыплаченные блочные награды (10% за каждый блок) будут использованы для финансирования утверждённых предложений. Таким образом, сеть финансирует сама себя, резервируя 10% от награды за блок на финансирование бюджетных проектов.

source: You can read more about Dash governance in the :ref:`governance` section of this documentation.
ru: Подробнее о системе управления Dash вы можете прочесть в разделе :ref:`управление` этой документации.

source: Sentinel
ru: Хранитель

source: Sentinel is an autonomous agent for persisting, processing and automating Dash 12.1 governance objects and tasks, and for expanded functions in the upcoming Dash V13 release (Evolution). Sentinel is implemented as a Python application that binds to a local version 12.1 dashd instance on each Dash 12.1 masternode.
ru: Хранитель является автономным агентом для сохранения, обработки и автоматизации объектов и задач управления Dash версии 12.1 и для расширенных функций в предстоящей 13й версии Dash (Эволюция). Хранитель реализован в виде Python-приложения, привязанного к экземпляру dashd локальной версии 12.1 на каждой мастерноде Dash 12.1.

source: A Governance Object (or "govObject") is a generic structure introduced in Dash Core 12.1 to allow for the creation of Budget Proposals, Triggers, and Watchdogs. Class inheritance has been utilized to extend this generic object into a "Proposal" object to supplant the current Dash budget system.
ru: Объект управления (или "govObject") представляет собой общую структуру, введённую в Dash Core версии 12.1, которая обеспечивает создание бюджетных предложений, триггеров и сторожевых таймеров. Наследование класса было использовано для расширения этого дженерик-объекта в объект "Предложение" для вытеснения текущей бюджетной системы Dash.

source: Diagram highlighting the relationship between Dash Sentinel and Core
ru: График, демонстрирующий связь между Хранителем Dash и Dash Core

source: *"The differences with Sentinel are really architectural and not easy/ interesting to explain to users as they are a bridge from 12.0 towards Evo features (but not fully implementing them), and Sentinel was only a part of 12.1 improvements anyway. Pre-Sentinel, governance functions were 'hard wired' into core code. Sentinel abstracts this process because in Evolution there are many Object types from Users to Accounts to Contacts etc, and if we didn't make this change first, future changes / improvements in Evolution (e.g. adding a new type of Object) would require changing core code. Now Core is agnostic to types of objects and we can take this forward for user experience and not just governance. In terms of documentation, there is no whitepaper specific to Sentinel, but we have various docs for Evo in an on-going RFC process which are used as the basis for Evo development."*
ru: *"Различия с Хранителем на самом деле являются архитектурными и такими, которые не просто/не интересно объяснять пользователям, поскольку они являются мостом от версии 12.0 к возможностям Evo (но не полностью их реализуют), а Хранитель в любом случае является лишь частью улучшений версии 12.1. В предварительном релизе Хранителя, функции управления были "жёстко привязаны" к основному коду. В основном релизе Хранитель делает этот процесс абстрактным, потому что в Эволюции существует множество типов Объектов от Пользователей до Аккаунтов, Контактов и т. д., и если бы мы не сделали это изменение сразу, то будущие изменения / улучшения Эволюции (например, добавление нового типа Объекта) потребовали бы изменения основного кода. Теперь Core не зависит от типов объектов, и мы можем продвинуться в этом направлении и упростить работу пользователям, вместо того, чтобы совершенствовать только управление. Что касается документации, то по Хранителю нет специализированной Белой книги, но у нас есть различные документы для Evo, сформированные из текущих RFC-проектов, которые используются в качестве основы для разработки Evo."*

source: Andy Freer, Evolution Developer
ru: Энди Фриер, разработчик Эволюции

source: Fees
ru: Комиссии

source: Transactions on the Dash network are recorded in blocks on the blockchain. The size of each transaction is measured in bytes, but there is not necessarily a correlation between high value transactions and the number of bytes required to process the transaction. Instead, transaction size is affected by how many input and output addresses are involved, since more data must be written in the block to store this information. Each new block is generated by a miner, who is paid for completing the work to generate the block with a block reward. In order to prevent the network from being filled with spam transactions, the size of each block is artificially limited. As transaction volume increases, the space in each block becomes a scarce commodity. Because miners are not obliged to include any transaction in the blocks they produce, once blocks are full, a voluntary transaction fee can be included as an incentive to the miner to process the transaction. Most wallets include a small fee by default, although many miners will process transactions even if no fee is included.
ru: Транзакции в сети Dash записываются в блоки блокчейна. Размер каждой транзакции измеряется в байтах, но нет необходимости в корреляции между транзакциями с высокой стоимостью и количеством байтов, необходимых для обработки транзакции. Вместо этого, на размер транзакции влияет количество входных и выходных адресов, так как для хранения этой информации в блоке должно быть записано больше данных. Каждый новый блок генерируется майнером, которому выплачивается за выполнение работы по созданию блока вознаграждение за блок. Чтобы предотвратить заполнение сети спам-транзакциями, размер каждого блока искусственно ограничен. По мере увеличения объёма транзакций пространство в каждом блоке становится дефицитным ресурсом. Поскольку майнеры не обязаны включать все транзакции в производимые ими блоки, то после того, как блоки полностью заполнятся, в качестве стимула для майнера обрабатывать транзакции может быть включена добровольная комиссия за них. Большинство кошельков включают небольшую плату по умолчанию, хотя многие майнеры будут обрабатывать транзакции, даже без оплаты комиссии.
