Repository: 12Gitcat/docs
Catalog: locale/*/LC_MESSAGES/introduction/features.po
Languages: ru

source: The release of Dash 0.12.2.0 and activation of DIP0001 saw a simultaneous reduction of fees by a factor of 10, while the block size was increased from 1MB to 2MB to promote continued growth of low-cost transactions even as the cost of Dash rises. Dash also supports :ref:`instantsend` and :ref:`privatesend` transactions, which operate on a different and mandatory fee schedule. The fee schedule for Dash 12.2.x as of December 2017 is as follows:
ru: Выпуск Dash версии 0.12.2.0 и активация DIP0001 позволили одновременно снизить комиссию в 10 раз и увеличить размер блока с 1 до 2 МБ, что поспособствовало дальнейшему росту недорогих транзакций, даже во время повышения стоимости DASH. Dash также поддерживает :ref:`instantsend` и :ref:`privatesend` транзакции, у которых другой и обязательный перечень комиссий. Этот перечень для Dash версий 12.2.x по состоянию на декабрь 2017 года выглядит следующим образом:

source: Transaction type
ru: Тип транзакции

source: Recommended fee
ru: Рекомендованная комиссия

source: Per unit
ru: За единицу

source: Standard transaction
ru: Стандартная транзакция

source: .00001 DASH
ru: 0,00001 DASH

source: Per kB of transaction data
ru: За килобайт данных транзакции

source: .0001 DASH
ru: 0,0001 DASH

source: Per transaction input
ru: За транзакционный вход

source: .001 DASH
ru: 0,001 DASH

source: Per 10 rounds of mixing (average)
ru: За 10 раундов перемешивания (в среднем)

source: As an example, a standard and relatively simple transaction on the Dash network with one input, one output and a possible change address typically fits in the range of 200 - 400 bytes. Assuming a price of US$800 per DASH, the fee falls in the range of $0.0015 - $0.0030, or well under half a cent. Processing the transaction using InstantSend at the same price would add $0.08 or eight cents to the transaction. These fees apply regardless of the Dash or dollar value of the transaction itself.
ru: Например, стандартная и относительно простая транзакция в сети Dash с одним входом, одним выходом и возможным адресом сдачи обычно имеет размер в диапазоне 200-400 байт. Если предположить, что цена за 1 DASH составляет 800 долларов США, то комиссия будет находиться в диапазоне от $0,0015 до $0,0030 или ниже, чем пол цента. Обработка транзакции с использованием InstantSend по той же стоимости DASH добавит $0,08 или 8 центов к транзакции. Эти комиссии применяются независимо от курса DASH или доллара по отношению к самой транзакции.

source: PrivateSend works by creating denominations of 10, 1, 0.1 and 0.01 DASH and then mixing these denominations with other users. Creation of the denominations is charged at the default fee for a standard transaction. Mixing is free, but to prevent spam attacks, an average of one in ten mixing transactions are charged a fee of 0.001 DASH. Spending inputs mixed using PrivateSend incurs the usual standard or InstantSend fees, but to avoid creating a potentially identifiable change address, the fee is always rounded up to the lowest possible denomination. This is typically .01 DASH, so it is important to deduct the fee from the amount being sent if possible to minimise fees. Combining InstantSend and PrivateSend may be expensive due to this requirement and the fact that a PrivateSend transaction may require several inputs, while InstantSend charges a fee of 0.0001 DASH per input. Always check your fees before sending a transaction.
ru: PrivateSend работает, создавая номиналы 10, 1, 0,1 и 0,01 DASH, а затем смешивая эти номиналы с монетами других пользователей. Создание номиналов оплачивается по стандартной ставке за стандартную транзакцию. Смешивание бесплатное, но для предотвращения спам-атак в среднем по одной из десяти транзакций смешивания взимается комиссия в размере 0,001 DASH. За перемешивание входов с использованием PrivateSend взимаются обычные стандартные комиссии или комиссии InstantSend, но для избежания создания потенциально идентифицируемого адреса сдачи, плата всегда округляется до наименьшего возможного номинала. Обычно это 0,01 DASH, поэтому важно вычесть комиссию за отправленную сумму, если это возможно, чтобы свести к минимуму комиссионные сборы. Сочетание функций InstantSend и PrivateSend может оказаться дорогим из-за этого требования, а также того факта, что для транзакции PrivateSend может потребоваться несколько входов, а InstantSend взимает плату в размере 0,0001 DASH за каждый вход. Всегда проверяйте комиссию перед отправкой транзакции.

source: Evolution
ru: Эволюция

source: `Dash Evolution <https://www.dash.org/evolution/>`_ is the code name for a decentralized currency platform built on Dash blockchain technology. The goal is to provide simple access to the unique features and benefits of Dash to assist in the creation of decentralized technology. Dash introduces a tiered network design, which allows users to do various jobs for the network, along with decentralized API access and a decentralized file system.
ru: `Эволюция Dash <https://www.dash.org/evolution/>`_ это кодовое название децентрализованной валютной платформы, построенной на технологии блокчейна Dash. Её цель состоит в том, чтобы обеспечить простой доступ к уникальным функциям и преимуществам Dash, которые оказали помощь в создании децентрализованной технологии. Dash представляет собой многоуровневый сетевой проект, который позволяет пользователям выполнять различные задания для сети, а также обеспечивает децентрализованный доступ к API и имеет децентрализованную файловую систему.

source: Dash Evolution will be released in stages. Dash Core releases 12.1 through to 12.4 will lay the groundwork for the decentralized features behind the scenes. An alpha version of Evolution is expected in the first half of 2018, including a basic implementation of DashDrive, Primitives, DAPI and a simple T3 wallet. This will be released together with a series of Dash Improvement Proposals (DIPs), followed by a testnet phase with most basic functionality, and a first stable release in summer 2018.
ru: Эволюция Dash будет выпускаться поэтапно. Релизы Dash Core, начиная с версии 12.1 и до версии 12.4 заложат основу негласных децентрализованных функций. Выпуск альфа-версии Эволюции ожидается в первой половине 2018 года, в неё будет входить базовая реализация DashDrive, примитивы, DAPI и простой кошелёк T3. Всё это будет выпущено вместе с серией Предложений по улучшению Dash (Dash Improvement Proposals - DIPs) и будет сопровождаться этапом тестирования большинства основных функций в сети testnet, а затем состоится первый стабильный релиз, который ожидается летом 2018 года.

source: Included below is our current work on Evolution, that adds many components such as:
ru: Ниже приведён текущий ход работы над Эволюцией, в неё добавлено множество компонентов, таких как:

source: **DashDrive:** A decentralized shared file system for user data that lives on the second tier network
ru: **DashDrive:** Децентрализованная общая файловая система для пользовательских данных, которая расположена в сети второго уровня

source: **DAPI:** A decentralized API which allows third tier users to access the network securely
ru: **DAPI:** Децентрализованный API, который обеспечивает безопасный доступ к сети для пользователей третьего уровня

source: **DashPay Decentralized Wallets:** These wallets are light clients connected to the network via DAPI and run on various platforms
ru: **Децентрализованные кошельки DashPay:** Эти кошельки являются лёгкими клиентами, подключёнными к сети через DAPI и могут работать на различных платформах

source: **Second Tier:** The masternode network, which provides compensated infrastructure for the project
ru: **Второй уровень:** Сеть мастернод, которая обеспечивает компенсированную инфраструктуру для проекта

source: **Budgets:** The second tier is given voting power to allocate funds for specific projects on the network via the budget system
ru: **Бюджеты:** Второй уровень предоставляет возможность голосования для выделения средств на реализацию конкретных проектов в сети через бюджетную систему

source: **Governance:** The second tier is given voting power to govern the currency and chart the course the currency takes
ru: **Управление:** Второй уровень предоставляет возможность голосования по управлению валютой и разработке курса развития, который принимает валюта

source: **Quorum Chain:** This feature introduces a permanent stable masternode list, which can be used to calculate past and present quorums
ru: **Цепь кворумов:** Эта функция представляет собой постоянный стабильный список мастернод, который используется для вычисления предыдущих и настоящих кворумов

source: **Social Wallet:** We introduce a social wallet, which allows friends lists, grouping of users and shared multisig accounts.
ru: **Социальный кошелёк:** Представляем социальный кошелёк, в котором доступен список друзей, группировка пользователей и совместные учётные записи с мультиподписью.

source: Evolution Previews
ru: Превью Эволюции

source: The following videos featuring Dash Founder Evan Duffield and Head of UI/UX Development Chuck Williams describe the development process and upcoming features of the Dash Evolution platform.
ru: Следующие видео с участием основателя Dash Эвана Даффилда и главы UI/UX Development Чака Уильямса описывают процесс разработки и предстоящие функции платформы Dash Эволюция.

source: **Evolution Demo #1 - The First Dash DAP**, 16 March 2018
ru: **Демо Эволюции №1 - Первый Dash DAP**, 16 марта 2018 года

source: **Evolution Demo #2 - Mobile Evolution**, 25 April 2018
ru: **Демо Эволюции №2 - Мобильная Эволюция**, 25 апреля 2018 года

source: **Evolution Demo #3 - Dashpay User Experience**, 15 May 2018
ru: **Демо Эволюции №3 - Удобная работа с Dashpay**, 15 мая 2018 года

source: **Chuck Williams on Evolution**, Dash Conference London, 14 September 2017
ru: **Чак Вильямс об Эволюции**, Конференция Dash в Лондоне, 14 сентября 2017 года

source: **Evan Duffield on the Evolution Roadmap**, Dash Force News, 28 June 2017
ru: **Эван Даффилд о дорожной карте Эволюции**, Dash Force News, 28 июня 2017 года
