Repository: 12Gitcat/docs
Catalog: locale/*/LC_MESSAGES/governance/using.po
Languages: ar, es, vi

source: If you started your masternode using the Dash Core Wallet (not recommended), you can vote manually from **Tools > Debug console**, or directly from your masternode via SSH using ``dash-cli``. First click on the proposal you want to vote on at either `DashCentral <https://www.dashcentral.org/budget>`__ or `Dash Ninja <https://www.dashninja.pl/governance.html>`__. You will see a command for manual voting below the proposal description. Copy and paste the command and modify it as necessary. As an example, take this proposal from `Dash Ninja <https://www.dashninja.pl/proposaldetails.html?proposalhash=6ed741 8455e07f4b30b99f0d4a24a2b83282e12b26fe3415673ecbea04ff6c9d>`__ (or `DashCentral <https://www.dashcentral.org/p/ScalingUpPublicityWithAmandaPMBC>`__). The voting code for Dash Core Wallet is as follows::
ar: إذا كنت قد بدأت في ماسترنود باستخدام محفظة داش كور (غير مستحسن) ، يمكنك التصويت يدويًا من **ادوات> Debug console** ، أو مباشرة من ماسترنود عبر SSH باستخدام ``dash-cli``. انقر أولاً على الاقتراح الذي تريد التصويت عليه في أي منهما `داش سنترال <https://www.dashcentral.org/budget>`__ او `داش نينجا <https://www.dashninja.pl/governance.html>`__. سترى أمرًا للتصويت اليدوي أسفل وصف المقترح. انسخ الأمر والصقه وقم بتعديله حسب الضرورة. على سبيل المثال ، خذ هذا الاقتراح من `داش نينجا <https://www.dashninja.pl/proposaldetails.html?proposalhash=6ed741 8455e07f4b30b99f0d4a24a2b83282e12b26fe3415673ecbea04ff6c9d>`__ ( او `داش سنترال <https://www.dashcentral.org/p/ScalingUpPublicityWithAmandaPMBC>`__). رمز التصويت لمحفظة داش كور هو كما يلي:
es: Si iniciaste tu masternode usando la billetera Dash Core (no recomendado), puedes votar manualmente desde **Herramientas > Consola de depuración**, o directamente desde tu masternode a través de SSH usando ``dash-cli``. Primero haz click en la propuesta que deseas votar en `DashCentral <https://www.dashcentral.org/budget>`__ o en `Dash Ninja <https://www.dashninja.pl/governance.html>`__ Verás un comando para votación manual debajo de la descripción de la propuesta. Copia y pega el comando y modifícalo si es necesario. Como ejemplo, toma esta propuesta de `Dash Ninja <https://www.dashninja.pl/proposaldetails.html?proposalhash=6ed741 8455e07f4b30b99f0d4a24a2b83282e12b26fe3415673ecbea04ff6c9d>`__ (or `DashCentral <https://www.dashcentral.org/p/ScalingUpPublicityWithAmandaPMBC>`__). El código de votación para la billetera Dash Core es el siguiente::
vi: Nếu bạn khởi động masternode của mình sử dụng ví Dash Core (không gợi ý bạn làm vậy), bạn có thể bỏ phiếu bằng tay từ menu **Công cụ > Cửa sổ debug**, hoặc trực tiếp từ masternode của bạn thông qua SSH bằng việc sử dụng ``dash-cli``. Đầu tiên click vào đề xuất mà bạn muốn bỏ phiếu hoặc trên `DashCentral <https://www.dashcentral.org/budget>`__ hoặc trên `Dash Ninja <https://www.dashninja.pl/governance.html>`__. Bạn sẽ thấy một câu lệnh cho việc bỏ phiếu bằng tay ở dưới phần mô tả của đề xuất. Copy và dán câu lệnh này và sửa đổi tuỳ theo quyết định đồng ý hay không đồng ý của bạn, nếu cần. Như ví dụ sau, lấy phần này từ đề xuất trên `Dash Ninja <https://www.dashninja.pl/proposaldetails.html?proposalhash=6ed741 8455e07f4b30b99f0d4a24a2b83282e12b26fe3415673ecbea04ff6c9d>`__ (hoặc `DashCentral <https://www.dashcentral.org/p/ScalingUpPublicityWithAmandaPMBC>`__). Mã để bỏ phiếu cho ví Dash Core có dạng như sau::

source: Note that to vote from your masternode directly, you need to prefix the command with ``dash-cli``, which is usually found in the ``.dashcore`` folder. The command should be similar to the following::
ar: لاحظ أنه للتصويت من ماسترنود مباشرة ، تحتاج إلى بادئة الأمر مع ``dash-cli`` ، والذي يوجد عادة في المجلد ``dashcore``. يجب أن يكون الأمر مشابهًا لما يلي:
es: Ten en cuenta que para votar desde tu masternode directamente, debes prefijar el comando con ``dash-cli``, que generalmente se encuentra en la carpeta ``.dashcore``. El comando debería ser similar al siguiente::
vi: Chú ý rằng việc bỏ phiếu trực tiếp từ masternode của bạn, bạn cần có thêm tiền tố vào câu lệnh với ``dash-cli``, chương trình thường được thấy trong thư mục ``.dashcore``. Câu lệnh sẽ có dạng giống như sau::

source: Note this command will trigger a vote from all masternodes configured in ``dash.conf``. If you have multiple masternodes each with its own .conf file, or if you want to vote with only some of your masternodes, you must change the command from ``vote-many`` to ``vote``. If your vote was successful, you should see a confirmation message reading **Voted successfully**.
ar: ملاحظة سيؤدي هذا الأمر إلى إجراء تصويت من جميع الأعداد التي تم تكوينها في ``dash.conf``. إذا كان لديك عدة ماسترنود مع كل ملف .conf الخاص بها ، أو إذا كنت ترغب في التصويت مع بعض من ماسترنود الخاص بك فقط ، يجب تغيير الأمر من ``تصويت-كتير`` إلى ``تصويت``. إذا كان تصويتك ناجحًا ، يجب أن ترى رسالة تأكيد تقرأ **تم التصويت عليها بنجاح**.
es: Ten en cuenta que este comando desencadenará un voto de todos los masternodes configurados en ``dash.conf``. Si tienes múltiples masternodes cada uno con su propio archivo .conf, o si deseas votar solo con algunos de tus masternodes, debes cambiar el comando de ``vote-many`` a ``vote``. Si tu voto fue exitoso, deberías ver un mensaje de confirmación que dice **Votado con éxito**.
vi: Chú ý lệnh này sẽ kích hoạt việc bỏ phiếu từ tất cả các masternode được cấu hình trong file ``dash.conf``. Nếu bạn có nhiều masternode và mỗi masternode một file .conf riêng, hoặc nếu bạn muốn bỏ phiếu chỉ với một vài masternode nào đó, bạn phải thay đổi câu lệnh từ ``vote-many`` thành ``vote``. Nếu việc bỏ phiếu của bạn thành công, bạn sẽ thấy thông báo xác nhận việc đó có dạng như sau **Voted successfully**.

source: Voting from the debug console in Dash Core Wallet
ar: التصويت من وحدة تصحيح الأخطاء في محفظة داش كور
es: Votar desde la consola de depuración en la billetera Dash Core
vi: Bỏ phiếu từ cửa sổ lệnh debug trong ví Dash Core

source: You can also view a list of proposals in JSON format from the console to copy and paste the proposal hash for voting as follows::
ar: يمكنك أيضًا عرض قائمة من المقترحات بتنسيق JSON من وحدة التحكم لنسخ ولصق تجزئة الاقتراح للتصويت كما يلي:
es: También puedes ver una lista de propuestas en formato JSON desde la consola para copiar y pegar el hash de la propuesta para votar de la siguiente manera::
vi: Bạn cũng có thể xem danh sách các đề xuất theo định dạng JSON từ bảng điều khiển để copy và dán mã băm của đề xuất cho việc bỏ phiếu theo cách sau::
