Repository: 12Gitcat/docs
Catalog: locale/*/LC_MESSAGES/governance/using.po
Languages: ar, es, vi

source: Practical guide to using the Dash governance system and treasury
ar: دليل عملي لاستخدام نظام إدارة داش والخزانة
es: Guía practica para usar el sistema de gobernanza y tesorería de Dash
vi: Hướng dẫn thực hành việc sử dụng hệ thống quản trị và ngân quỹ của Dash

source: dash, dgbb, governance, funding, voting, proposals, masternodes
ar: داش ، dgbb ، والحكم ، والتمويل ، والتصويت ، والمقترحات ، ماسترنود
es: dash, dgbb, gobernanza, financiamiento, propuestas, masternodes
vi: dash, dgbb, hệ quản trị, cấp vốn, bỏ phiếu, đề xuất, masternode

source: Using Dash Governance
ar: إستخدام إدارة داش
es: Usar la governanza de Dash
vi: Sử dụng cơ chế Quản trị Dash

source: Dash's Decentralized Governance by Blockchain (DGBB) is a novel voting and funding platform. This documentation introduces and details the theory and practice to use the system.
ar: تعتبر الإدارة اللامركزية في داش من قبل بلوكشين (DGBB) منصة جديدة للتصويت والتمويل. تقدم هذه الوثيقة وتفاصيل النظرية والممارسة لاستخدام النظام.
es: La governanza descentralizada de Dash por cadena de bloques (DGBB) es una novedosa plataforma de votación y financiamiento. Esta documentación presenta y detalla la teoría y la práctica para usar el sistema.
vi: Cơ chế Quản trị Phi tập trung bởi Blockchain (DGBB) là một nền tảng cấp vốn và biểu quyết mới lạ. Tài liệu này sẽ giới thiệu và nói rõ chi tiết về mặt lý thuyết và thực tiễn của việc sử dụng hệ thống này.

source: Understanding the process
ar: فهم العملية
es: Entendiendo el proceso
vi: Tìm hiểu về quy trình

source: Introduction
ar: المقدمة
es: Introducción
vi: Giới thiệu

source: DGBB consists of three components: Proposals, Votes, and Budgets
ar: يتكون DGBB من ثلاثة مكونات: الاقتراحات ، الأصوات ، الميزانيات
es: DGBB consta de tres componentes: Propuestas, Votos y Presupuestos
vi: DGBB bao gồm ba thành phần sau: Đề xuất, Bỏ phiếu, và Ngân sách

source: Anyone can submit a proposal for a small fee
ar: يمكن لأي شخص تقديم اقتراح مقابل رسوم رمزية
es: Cualquiera puede enviar una propuesta por una pequeña comisión
vi: Bất cứ ai cũng có thể đăng một đề xuất với một khoản phí nhỏ

source: Masternode owners can cast for, against or abstain votes on proposals
ar: يمكن لمالكي ماسترنود الإدلاء بأصواتهم أو معارضة التصويت على المقترحات
es: Los propietarios de masternodes pueden votar a favor, rechazar o abstenerse en las propuestas
vi: Các chủ masternode có thể bỏ phiếu để chống lại, hoặc bỏ qua những đề xuất

source: Approved proposals become budgets
ar: تصبح المقترحات المعتمدة ميزانيات
es: Las propuestas aprobadas se convierten en presupuestos
vi: Những đề xuất được chấp thuận sẽ trở thành các ngân sách

source: Budgets are paid directly from the blockchain to the proposal owner
ar: يتم دفع الميزانيات مباشرة من بلوكشين إلى مالك الاقتراح
es: Los presupuestos se pagan directamente desde la cadena de bloques al propietario de la propuesta
vi: Ngân sách được trả trực tiếp từ blockchain cho người lập đề xuất

source: Proposals
ar: الإقتراحات
es: Propuestas
vi: Các đề xuất

source: Proposals are a request to receive funds
ar: المقترحات هي طلب لتلقي الأموال
es: Las propuestas son una solicitud para recibir fondos
vi: Các đề xuất yêu cầu được cấp phát ngân sách

source: Proposals can be submitted by anyone for a fee of 5 Dash. The proposal fee is irreversibly destroyed on submission.
ar: يمكن تقديم الاقتراحات من قبل أي شخص مقابل رسم قدره 5 داش. يتم تدمير رسوم الاقتراح بشكل لا رجعة فيه عند التقديم.
es: Las propuestas pueden ser presentadas por cualquier persona por una comisión de 5 Dash. La comisión de la propuesta se destruye irreversiblemente en la presentación.
vi: Đề xuất có thể được đưa ra bởi bất cứ ai với mức phí 5 Dash cho mỗi lần. Phí đề xuất này được tiêu huỷ mà không đảo ngược lại được khi đăng đề xuất.

source: Proposals cannot be altered once submitted
ar: لا يمكن تغيير الاقتراحات بمجرد تقديمها
es: Las propuestas no pueden ser alteradas una vez enviadas
vi: Đề xuất không thể thay đổi lại được một khi nó được đăng lên.

source: Votes
ar: التصويت
es: Votos
vi: Bỏ phiếu

source: Votes are cast by masternode owners
ar: يتم التصويت بواسطة أصحاب ماسترنود
es: Los votos son emitidos por los propietarios de los masternodes
vi: Việc bỏ phiếu có thể thực hiện bởi các chủ masternode

source: Votes can be changed at any time
ar: يمكن تغيير الأصوات في أي وقت
es: Los votos se pueden cambiar en cualquier momento
vi: Việc bỏ phiếu cũng có thể được thay đổi ở bất cứ thời gian nào

source: Votes are counted every 16616 blocks (approx. 30.29 days)
ar: يتم احتساب الأصوات كل 16616 قطعة (حوالي 30.29 يومًا)
es: Los votos se cuentan cada 16616 bloques (aproximadamente cada 30.29 días)
vi: Các phiếu bầu được tính cứ mỗi 16616 khối (xấp xỉ 30.29 ngày)

source: Budgets
ar: الميزانية
es: Presupuestos
vi: Ngân sách

source: Budgets are proposals which receive a net total of yes votes equal to or greater than 10% of the total possible votes (for example over 448 out of 4480)
ar: الميزانيات هي المقترحات التي تحصل على مجموع الأصوات الصافية نعم يعادل أو أكبر من 10 ٪ من مجموع الأصوات الممكنة (على سبيل المثال أكثر من 448 من أصل 4480)
es: Los presupuestos son propuestas que reciben un total neto de votos afirmativos igual o superior al 10% del total de votos posibles (por ejemplo, más de 448 de 4480)
vi: Ngân sách là các đề xuất mà nhận được tổng số vote YES ít nhất bằng 10% tổng số khả năng bỏ phiếu (ví dụ đạt 448 trên tổng số 4480)

source: Budgets can be nullified at any time if vote totals (cast or re-cast) fall below the approval threshold
ar: يمكن إبطال الميزانيات في أي وقت إذا كانت مجاميع الأصوات (المدلى بها أو التي أعدت) أقل من الحد الأدنى للموافقة
es: Los presupuestos pueden anularse en cualquier momento si el total de votos (emitidos o reemitidos) cae por debajo del umbral de aprobación.
vi: Ngân sách có thể bị huỷ bỏ tại bất kỳ thời điểm nào nếu tổng số phiếu (bỏ phiếu hoặc bỏ phiếu lại) dưới ngưỡng được chấp nhận.

source: Budgets are processed (paid) in order of yes minus no votes. More popular budgets get payment priority.
ar: تتم معالجة الميزانيات (مدفوعة) من أجل نعم بدون طرح أي أصوات. تحصل الميزانيات الأكثر شعبية على أولوية الدفع.
es: Los presupuestos se procesan (pagan) en orden votos de sí menos no. Los presupuestos más populares obtienen prioridad de pago.
vi: Ngân sách được xử lý (chi trả) theo cách lấy số phiếu đồng ý - YES trừ đi số phiêu không đồng ý - NO. Ưu tiên thanh toán cho những đề xuất có nhiều bỏ phiếu ủng hộ hơn.

source: Approximately 6176 dash (in 2018) are available for each budget cycle, decreasing by 7.14% every 210240 blocks (approx. 383.25 days).
ar: تتوفر تقريبا 6176 داش (في 2018) لكل دورة الميزانية ، وتناقص بنسبة 7.14 ٪ كل 210240 كتل (حوالي 383.25 يوما).
es: Aproximadamente 6176 dash (en 2018) están disponibles para cada ciclo presupuestario, disminuyendo en un 7.14% cada 210240 bloques (aproximadamente cada 383.25 días).
vi: Có xấp xỉ 6176 dash (trong năm 2018) dành cho mỗi chu kỳ ngân sách, khoảng một tháng, ngân sách này giảm dần 7.14% cứ mỗi 210240 block (xấp xỉ 383.25 ngày)

source: Object structure
ar: هيكل الكائن
es: Estructura de objeto
vi: Cấu trúc đối tượng

source: The following information is required to create a proposal:
ar: المعلومات التالية مطلوبة لإنشاء اقتراح:
es: Se requiere la siguiente información para crear una propuesta:
vi: Thông tin sau đây là cần thiết để tạo một Đề xuất:

source: proposal-name: a unique label, 20 characters or less
ar: اسم الاقتراح: تصنيف فريد ، 20 حرفًا أو أقل
es: nombre-de-la-propuesta: una etiqueta única, de 20 caracteres o menos
vi: proposal-name: là một tiêu đề không trùng nhau, dài không quá 20 ký tự

source: url: a proposer-created webpage or forum post containing detailed proposal information
ar: عنوان: عبارة عن صفحة ويب أو موقع منتدى تم إنشاؤه من قِبل مقدم الاقتراح يحتوي على معلومات مفصلة حول الاقتراح
es: url: una página web creada por la persona que hace la propuesta o una publicación en el foro que contiene información detallada de la propuesta
vi: url: là trang web do người lập đề xuất tạo hoặc một chủ đề trên diễn đàn có chứa thông tin cụ thể về đề xuất

source: payment-count: how many cycles the proposal is requesting payment
ar: حساب الدفع: عدد الدورات التي يطلبها الدفع
es: Recuento-de-pagos: cuántos ciclos de pago solicita la propuesta
vi: payment-count: số chu kỳ thanh toán mà đề xuất này muốn được chi trả

source: block-start: the requested start of proposal payments
ar: block-start: البداية المطلوبة لمدفوعات الاقتراح
es: inicio-de-bloque: el inicio solicitado de los pagos de la propuesta
vi: block-start: đề xuất yêu cầu bắt đầu thanh toán từ block thứ bao nhiêu

source: dash-address: the address to receive proposal payments
ar: عنوان - داش: عنوان لتلقي دفعات الاقتراح
es: dirección-de-dash: la dirección para recibir los pagos de la propuesta
vi: dash-address: là địa chỉ để nhận tiền cho đề xuất

source: monthly-payment-dash: the requested payment amount
ar: دفع الدفعة الشهرية: مبلغ الدفعة المطلوبة
es: pago-mensual-de-dash: el monto de pago solicitado
vi: monthly-payment-dash: số tiền của mỗi lần thanh toán cho từng tháng

source: Persistence
ar: إصرار
es: Persistencia
vi: Sự nhất quán

source: Proposals become active one day after submission
ar: تصبح المقترحات نشطة بعد يوم من تقديمها
es: Las propuestas se activan un día después de la presentación
vi: Đề xuất sẽ được kích hoạt một ngày sau khi đăng lên

source: Proposals will remain visible on the network until they are either disapproved or the proposal's last payment-cycle is reached
ar: ستظل المقترحات مرئية على الشبكة إلى أن يتم رفضها أو الوصول إلى دورة الدفع الأخيرة للمقترح
es: Las propuestas permanecerán visibles en la red hasta que se desaprueben o hasta que se alcance el último ciclo de pago de la propuesta.
vi: Các đề xuất vẫn sẽ hiển thị trên mạng lưới đến tận khi hoặc là nó không còn được chấp nhận hoặc kết thúc chu kỳ thanh toán cuối cùng.

source: Approval occurs when yes votes minus no votes equals 10% or more of the total available votes.
ar: وتحدث الموافقة عندما تكون الأصوات الصحيحة ناقصًا أي أصوات تساوي 10٪ أو أكثر من إجمالي الأصوات المتاحة.
es: La aprobación se produce cuando la suma de los votos afirmativos menos los votos negativos equivale al 10% o más del total de votos disponibles.
vi: Chấp thuận xảy ra khi những phiếu YES trừ đi những phiếu NO đạt ít nhất 10% trên tổng số lượng phiếu bầu.

source: Disapproval occurs when no votes minus yes votes equals 10% or more of the total available votes.
ar: يحدث الرفض عند عدم وجود أصوات ناقص نعم أصوات تساوي 10٪ أو أكثر من إجمالي الأصوات المتاحة.
es: La desaprobación se produce cuando la suma de los votos negativos menos los votos positivos equivale al 10% o más del total de votos disponibles.
vi: Không chấp thuận xảy ra khi số phiếu bầu NO trừ đi số phiếu bầu YES ít nhất bằng 10% tổng số lượng phiếu bầu.

source: The total available votes is the count of online and responding masternodes and can be seen by running the command ``masternode count`` in the Dash Core wallet debug window. A graph of the total masternode count can be found `here <http://178.254.23.111/~pub/masternode_count.png>`__
ar: إجمالي الأصوات المتوفرة هو عدد الأصوات عبر الإنترنت والاستجابة ويمكن رؤيته من خلال تشغيل الأمر "عدد ماسترنود" في نافذة debug للمحفظة debug. يمكن العثور على رسم بياني من إجمالي عدد ماسترنود `هنا <http://178.254.23.111/~pub/masternode_count.png>`__
es: El total de votos disponibles es el recuento de todos los masternodes en línea que responden y que pueden verse ejecutando el comando ``masternode count`` en la ventana de depuración de la billetera Dash Core. Se puede encontrar un gráfico del recuento total de los masternodes `aquí <http://178.254.23.111/~pub/masternode_count.png>`__
vi: Tổng số phiếu bầu có thể là số masternode đang online và đáp ứng đủ điều kiện, nó có thể xem bằng cách chạy lệnh ``masternode count`` trong cửa sổ Debug của ví Dash Core. Một biểu đồ về tổng số masternode có thể tìm thấy `ở đây <http://178.254.23.111/~pub/masternode_count.png>`__

source: Templates
ar: قوالب
es: Plantillas
vi: Các mẫu

source: The following two Microsoft Word templates are available from Dash Core Group to help facilitate standardized proposal submission and updates. Usage is recommended, but not required.
ar: يتوفر نموذجا Microsoft Word التاليان من مجموعة داش كور للمساعدة في تسهيل تقديم المقترحات والتحديثات الموحدة. يوصى بالاستخدام ، ولكن غير مطلوب.
es: Las siguientes dos plantillas de Microsoft Word están disponibles desde Dash Core Group para ayudar a facilitar el envío y la presentación de propuestas estandarizadas. Se recomienda el uso, pero no es obligatorio.
vi: Những định dạng mẫu cho Microsoft Word sau đây từ Dash Core Group sẽ giúp chúng ta chuẩn hoá những mẫu đề xuất và được thường xuyên cập nhật. Bạn nên sử dụng những mẫu này, nhưng nó không phải là bắt buộc.

source: `Project Proposal Template <https://github.com/dashpay/docs/raw/master/binary/Dash%20Project%20Proposal%20Template%20v1.0.docx>`_
ar: `نموذج اقتراح المشروع <https://github.com/dashpay/docs/raw/master/binary/Dash%20Project%20Proposal%20Template%20v1.0.docx>`_
es: `Plantilla de proyecto de propuesta <https://github.com/dashpay/docs/raw/master/binary/Dash%20Project%20Proposal%20Template%20v1.0.docx>`_
vi: `Mẫu đề xuất dự án <https://github.com/dashpay/docs/raw/master/binary/Dash%20Project%20Proposal%20Template%20v1.0.docx>`_

source: `Project Status Update Template <https://github.com/dashpay/docs/raw/master/binary/Dash%20Project%20Status%20Update%20Template%20v1.0.docx>`_
ar: `نموذج تحديث حالة المشروع <https://github.com/dashpay/docs/raw/master/binary/Dash%20Project%20Status%20Update%20Template%20v1.0.docx>`_
es: `Plantilla de actualización del estado del proyecto <https://github.com/dashpay/docs/raw/master/binary/Dash%20Project%20Status%20Update%20Template%20v1.0.docx>`_
vi: `Mẫu Cập Nhật Tình Hình Dự Án <https://github.com/dashpay/docs/raw/master/binary/Dash%20Project%20Status%20Update%20Template%20v1.0.docx>`_

source: Budget cycles
ar: مزانية الدورات
es: Ciclos presupuestarios
vi: Các chu kỳ ngân sách

source: When preparing a proposal, be aware of when the next cycle will occur and plan accordingly. It is recommended to choose your proposal payment start block at least one cycle in the future to allow time for discussion and gathering support and votes. Note that votes will no longer be tallied 1662 blocks (approximately 3 days) prior to the superblock.
ar: عند إعداد اقتراح ، يجب أن تكون على دراية بموعد حدوث الدورة التالية والتخطيط وفقًا لذلك. يوصى باختيار منع بدء دفعة الاقتراح الخاص بك على الأقل دورة واحدة في المستقبل لإتاحة الوقت للمناقشة وجمع الدعم والأصوات. لاحظ أنه لن يتم تحويل الأصوات إلى 1662 قالبًا (حوالي 3 أيام) قبل superblock.
es: Al preparar una propuesta, ten en cuenta cuándo se producirá el próximo ciclo y planifica en consecuencia. Se recomienda elegir el bloque de inicio de pago de la propuesta al menos un ciclo en el futuro para dar tiempo a la discusión y obtener soporte y votos. Ten en cuenta que los votos ya no serán contados en 1662 bloques (aproximadamente 3 días) antes del superbloque.
vi: Khi chuẩn bị một đề xuất, hãy chú ý khi nào thì chu kỳ tới sẽ đến và lập kế hoạch cho phù hợp. Bạn nên chọn kỳ thanh toán cho đề xuất ít nhất trước một chu kỳ thanh toán để có thời gian cho thảo luận và thu hút đủ sự hỗ trợ và bỏ phiếu ủng hộ. Hãy chú ý rằng các phiếu sẽ không được kiểm trong vòng 1662 khối (khoảng 3 ngày) trước khi siêu khối được ra.

source: Block height
ar: ارتفاع كتلة
es: Altura del bloque
vi: Độ cao khối

source: Approximate date
ar: التاريخ التقريبي
es: Fecha aproximada
vi: Ngày dự kiến

source: Tue Oct 3 20:17:56 UTC 2017
ar: الثلاثاء 3 تشرين الأول 20:17:56 بالتوقيت العالمي 2017
es: Martes 3 de Octubre 20:17:56 UTC 2017
vi: Thứ 3, ngày 3 tháng 10 20:17:56 UTC 2017

source: Fri Nov 3 03:22:58 UTC 2017
ar: الجمعة نوفمبر 3 03:22:58 بالتوقيت العالمي 2017
es: Viernes 3 de Noviembre 03:22:58 UTC 2017
vi: Thứ 6 ngày 3 tháng 11 03:22:58 UTC 2017

source: Sun Dec 3 10:28:00 UTC 2017
ar: السبت 3 سبتمبر 10:28:00 بالتوقيت العالمي 2017
es: Domingo 3 de Diciembre 10:28:00 UTC 2017
vi: Chủ nhật ngày 3 tháng 12 10:28:00 UTC 2017

source: Tue Jan 2 17:33:02 UTC 2018
ar: الثلاثاء يناير 2 17:33:02 التوقيت العالمي 2018
es: Martes 2 de Enero 17:33:02 UTC 2018
vi: Thứ 3 ngày 2 tháng 1 17:33:02 UTC 2018

source: Fri Feb 2 00:38:04 UTC 2018
ar: الجمعة 2 فبراير 00:38:04 بالتوقيت العالمي 2018
es: Viernes 2 de Febrero 00:38:04 UTC 2018
vi: Thứ 6 ngày 2 tháng 2 00:38:04 UTC 2018

source: Sun Mar 4 07:43:06 UTC 2018
ar: الأحد 4 مارس 07:43:06 بالتوقيت العالمة 2018
es: Domingo 4 de Marzo 07:43:06 UTC 2018
vi: Chủ nhật ngày 4 tháng 3 07:43:06 UTC 2018

source: Tue Apr 3 14:48:08 UTC 2018
ar: التلاتاء 3 ابريل 14:48:08 بالتوقيت العالمي 2018
es: Martes 3 de Abril 14:48:08 UTC 2018
vi: Thứ 3 ngày 3 tháng 4 14:48:08 UTC 2018

source: Thu May 3 21:53:10 UTC 2018
ar: الخميس 3 مايو 21:53:10 بالتوقيت العالمي 2018
es: Jueves 3 de Mayo 21:53:10 UTC 2018
vi: Thứ 5 ngày 3 tháng 5 21:53:10 UTC 2018

source: Sun Jun 3 04:58:12 UTC 2018
ar: الأحد 3 يونيو 04:58:12 بالتوقيت العالمي 2018
es: Domingo 3 de Junio 04:58:12 UTC 2018
vi: Chủ nhật ngày 3 tháng 6 04:58:12 UTC 2018

source: Tue Jul 3 12:03:14 UTC 2018
ar: التلاتاء 3 يوليو 12:03:14 بالتوقيت العالمي 2018
es: Martes 3 de Julio 12:03:14 UTC 2018
vi: Thứ 3 ngày 3 tháng 7 12:03:14 UTC 2018

source: Thu Aug 2 19:08:16 UTC 2018
ar: الخميس 2 اغسطس 19:08:16 بالتوقيت العالمي 2018
es: Jueves 2 de Agosto 19:08:16 UTC 2018
vi: Thứ 5 ngày 2 tháng 8 19:08:16 UTC 2018

source: Sun Sep 2 02:13:18 UTC 2018
ar: الأحد 2 سبتمبر 02:13:18 بالتوقيت العالمي 2018
es: Domingo 2 de Septiembre 02:13:18 UTC 2018
vi: Chủ nhật ngày 2 tháng 9 02:13:18 UTC 2018

source: Tue Oct 2 09:18:20 UTC 2018
ar: التلاتاء 2 اكتوير 09:18:20 بالتوقيت العالمي 2018
es: Martes 2 de Octubre 09:18:20 UTC 2018
vi: Thứ 3 ngày 2 tháng 10 09:18:20 UTC 2018

source: Thu Nov 1 16:23:22 UTC 2018
ar: الخميس 1 نونبر 16:23:22 بالتوقيت العابمي 2018
es: Jueves 1 de Noviembre 16:23:22 UTC 2018
vi: Thứ 5 ngày 1 tháng 11 16:23:22 UTC 2018

source: Sat Dec 1 23:28:24 UTC 2018
ar: السبت 1 دسمبر 23:28:24 بالتوقيت العالمي 2018
es: Sábado 1 de Diciembre 23:28:24 UTC 2018
vi: Thứ 7 ngày 1 tháng 12 23:28:24 UTC 2018

source: Tue Jan 1 06:33:26 UTC 2019
ar: الثلاثاء يناير 1 06:33:26 التوقيت العالمي 2019
es: Martes 1 de Enero 06:33:26 UTC 2019
vi: Thứ 3 ngày 1 tháng 1 06:33:26 UTC 2019

source: You can view the source code for this calculation at this `GitHub gist <https://gist.github.com/strophy/9eb743f7bc717c17a2e776e461f24c49>`_
ar: يمكنك عرض التعليمات البرمجية المصدر لهذا الحساب `هنا <https://gist.github.com/strophy/9eb743f7bc717c17a2e776e461f24c49>`_
es: Puedes ver el código fuente para este cálculo en `GitHub gist <https://gist.github.com/strophy/9eb743f7bc717c17a2e776e461f24c49>`_
vi: Bạn có thể xem mã nguồn của tính toán này tại đây `GitHub gist <https://gist.github.com/strophy/9eb743f7bc717c17a2e776e461f24c49>`_

source: Creating proposals
ar: خلق مقترحات
es: Crear propuestas
vi: Tạo các đề xuất

source: Once you have prepared the text of your proposal and set up a website or forum post, it is time to submit your proposal to the blockchain for voting. While all tasks involved with creating a budget proposal can be executed from the Dash Core wallet console, several tools providing a user interface have been developed to simplify this procedure.
ar: بمجرد الانتهاء من إعداد نص اقتراحك وإعداد موقع ويب أو مشاركة في منتدى ، فقد حان الوقت لتقديم اقتراحك إلى بلوكشين للتصويت. على الرغم من إمكانية تنفيذ جميع المهام المتعلقة بإنشاء اقتراح ميزانية من وحدة تحكم لوحة مفاتيح داش كور ، فقد تم تطوير العديد من الأدوات التي توفر واجهة مستخدم لتبسيط هذا الإجراء.
es: Una vez que hayas preparado el texto de tu propuesta y configurado un sitio web o una publicación en el foro, es hora de enviar tu propuesta a la cadena de bloques para votar. Si bien todas las tareas relacionadas con la creación de una propuesta de presupuesto se pueden ejecutar desde la consola de la billetera Dash Core, se han desarrollado varias herramientas que proporcionan una interfaz de usuario para simplificar este procedimiento.
vi: Một khi bạn đã chuẩn bị những nội dung cho đề xuất của bạn và thiết lập một website hoặc bài viết trên diễn đàn, thì đây là thời điểm để bạn đăng đề xuất của mình lên blockchain để cho mọi người bỏ phiếu. Trong khi tất cả các công việc liên quan đến việc tạo đề xuất xin ngân sách đều có thể thực hiện từ cửa sổ lệnh trên ví Dash Core, thì có vài công cụ cung cấp một giao diện trực quan hơn được phát triển để làm đơn giản tiến trình xin cấp vốn này.

source: Dash Budget Proposal Generator
ar: داش الميزانية اقتراح مولد
es: Generador de Propuestas de Presupuesto de Dash
vi: Công cụ sinh Đề xuất Ngân sách của Dash
