Repository: 12Gitcat/docs
Catalog: locale/*/LC_MESSAGES/governance/using.po
Languages: ar, es, vi

source: The `Dash Budget Proposal Generator <https://proposal.dash.org>`__ supports creating budget proposals on both mainnet and testnet. In the first step, you must enter a short, clear and unique name for the proposal as it will appear on the blockchain. Proposal names are limited to 40 characters. You can then provide a link to the forum or DashCentral where your proposal is described in more detail (use a `URL shortening service <https://goo.gl>`_ if necessary), as well as select the amount of payment you are requesting, how often the payment should occur, and the superblock date on which you are requesting payment. This allows you to control in which budget period your proposal will appear, and gives you enough time to build support for your proposal by familiarising voters with your project. Note that the payment amount is fixed and cannot be modified after it has been submitted to the blockchain.
ar: `ميزانية مقترح داش <https://proposal.dash.org>`__ يدعم إنشاء مقترحات الميزانية على كل من mainnet و testnet. في الخطوة الأولى ، يجب عليك إدخال اسم قصير وواضح وفريد للمقترح كما سيظهر على بلوكشين. تقتصر أسماء العروض على 40 حرفًا. يمكنك بعد ذلك توفير رابط للمنتدى أو داش سنترال حيث يتم وصف اقتراحك بمزيد من التفصيل (استخدم `هذا الرابط <https://goo.gl>`_ اذا دعت الضرورة) بالإضافة إلى تحديد مقدار المبلغ الذي تطلبه ، وعدد المرات التي يجب أن يتم فيها الدفع ، وتاريخ الاستلام الفائق الذي تطلب فيه الدفع. يسمح لك هذا بالتحكم في فترة الميزانية التي سيظهر بها اقتراحك ، ويمنحك الوقت الكافي لبناء الدعم لمقترحك عن طريق تعريف الناخبين بمشروعك. لاحظ أن مبلغ الدفع ثابت ولا يمكن تعديله بعد تقديمه إلى بلوكشين
es: El `Generador de propuestas de presupuesto de Dash <https://proposal.dash.org>`__ admite la creación de propuestas de presupuesto tanto en la red principal como en la red de prueba. En el primer paso, debes ingresar un nombre corto, claro y único para la propuesta, como aparecerá en la cadena de bloques. Los nombres de las propuestas están limitados a 40 caracteres. A continuación, puedes proporcionar un enlace al foro o a DashCentral donde se describe tu propuesta con más detalle (utiliza un `servicio de acortamiento de URL <https://goo.gl>`_ si es necesario), así como también selecciona la cantidad de pago que estas solicitando, con qué frecuencia debe realizarse el pago, y la fecha del superbloque en la que solicita el pago. Esto te permite controlar en qué período presupuestario aparecerá tu propuesta y te da tiempo suficiente para generar apoyo para tu propuesta al familiarizar a los votantes con tu proyecto. Ten en cuenta que el monto del pago es fijo y no se puede modificar después de que se haya enviado a la cadena de bloques.
vi: Bộ `Công cụ tạo sinh đề xuất <https://proposal.dash.org>`__ hỗ trợ việc tạo các đề xuất cả trên mạng chính - mainnet và mạng thử nghiệm - testnet. Ở bước đầu tiên, bạn cần nhập tên ngắn gọn, rõ ràng, và duy nhất cho đề xuất và nó sẽ xuất hiện ở trên blockchain. Tên cảu đề xuất dài tối đa 40 ký tự. Bạn có thể cung cấp đường link đến diễn đàn hoặc DashCentral là nơi bạn có mô tả về đề xuất một cách cụ thể hơn (sử dụng `dịch vụ thu gọn đường link như <https://goo.gl>`_ nếu cần), và sau đó là chọn một số lượng cho khoản thanh toán mà bạn yêu cầu, và số lần thanh toán, và ngày của siêu khối mà bạn yêu cầu thanh toán. Điều này cho phép bạn kiểm soát chu kỳ thanh toán nào bạn muốn đề xuất của bạn xuất hiện, và nó cho bạn đủ thời gian để tìm kiếm sự ủng hộ cho đề xuất của mình bằng việc làm cho những người bỏ phiếu cảm thấy quen thuộc với dự án của bạn. Chú ý rằng số tiền thanh toán là một khoản cố định và không thể thay đổi được sau khi đề xuất được đăng lên blockchain.

source: Steps 1 & 2: Creating your proposal and preparing the command
ar: الخطوتين 1 & 2: إنشاء الاقتراح الخاص بك وإعداد الأمر
es: Pasos 1 y 2: Crea tu propuesta y prepara el comando
vi: Bước 1 & 2: Tạo đề xuất và chuẩn bị câu lệnh

source: Next, the proposal generator will provide you with a command to run from the console of your Dash Core wallet to prepare your budget proposal governance object. Running this command will cost you 5 DASH, which will be "burnt" or permanently removed from circulation. This one-time fee protects the governance system from becoming overwhelmed by spam, poorly thought out proposals or users not acting in good faith. A small transaction fee is charged as well, so make sure slightly more than 5 DASH is available in your wallet. Many budget proposals request reimbursement of the 5 DASH fee.
ar: بعد ذلك ، سيوفر لك مولد الاقتراح أمرًا لتشغيله من وحدة التحكم في محفظة داش كور الخاصة بك لإعداد كائن إدارة اقتراح الميزانية الخاص بك. سيكلف تشغيل هذا الأمر 5 داش ، والتي سيتم "حرقها" أو إزالتها نهائياً من التداول. وتحمي هذه الرسوم التي تُدفع لمرة واحدة نظام الحوكمة من أن تربكها الرسائل الاقتحامية أو المقترحات أو المستخدمين الذين لا يتصرفون بحسن نية. يتم أيضًا فرض رسوم معاملة صغيرة ، لذا تأكد من توفر أكثر من 5 داش قليلاً في محفظتك. تطلب العديد من مقترحات الميزانية سداد رسوم 5 داش.
es: A continuación, el generador de propuestas te proporcionará un comando para ejecutar desde la consola de tu billetera Dash Core para preparar tu objeto de governanza de propuesta de presupuesto. Ejecutar este comando te costará 5 DASH, los que serán "quemados" o eliminados permanentemente de la circulación. Esta comisión única protege al sistema de gobierno de ser abrumado por el spam, de las propuestas mal pensadas o de los usuarios que no actúan de buena fe. También se cobra una pequeña comisión de transacción, así que asegúrate de que haya disponible un poco más de 5 DASH en tu billetera. Muchas propuestas presupuestarias solicitan el reembolso de la comisión de 5 DASH.
vi: Tiếp Theo, bộ sinh đề xuất sẽ cung cấp bạn một câu lệnh để bạn có thể chạy từ cửa sổ debug trên ví Dash Core để chuẩn bị đối tượng quản trị cho đề xuất của bạn. Chạy câu lệnh này sẽ làm bạn tốn mất 5 DASH, nó sẽ bị "đốt" đi mất một cách vĩnh viễn khỏi việc lưu thông. Đây là khoản phí một lần để bảo vệ hệ quản trị khỏi quá tải bởi spam, hoặc những đề xuất không được cân nhắc một cách thấu đáo hoặc người dùng hành động mà không có đức tin tốt. Ngoài ra còn có một khoản phí nhỏ sẽ được áp dụng, do đó hãy chắc chắn rằng trong ví của bạn phải có hơn 5 DASH một chút. Có rất nhiều để xuất thường tính luôn và yêu cầu hệ thống trả lại khoản phí 5 DASH nếu đề xuất của họ chiến thắng.

source: First unlock your wallet by clicking **Settings > Unlock wallet**, then open the console by clicking **Tools > Debug console** and paste the generated command. The transaction ID will appear. Copy and paste this into the proposal generator response window. As soon as you do this, the system will show a progress bar as it waits for 6 confirmations as follows:
ar: قم أولاً بإلغاء قفل محفظتك بالنقر فوق **إعدادات> إلغاء قفل المحفظة** ، ثم افتح وحدة التحكم بالنقر فوق **أدوات> وحدة التحكم في التصحيح** ولصق الأمر الذي تم إنشاؤه. سوف يظهر معرف المعاملة. نسخ ولصق هذا في إطار استجابة مولد الاقتراح. بمجرد قيامك بذلك ، سيعرض النظام شريط تقدم بينما ينتظر 6 تأكيدات كما يلي:
es: Primero desbloquea tu billetera haciendo click en **Configuración > Desbloquear billetera**, luego abre la consola haciendo click en **Herramientas > Consola de depuración** y pega el comando generado. La identificación de la transacción aparecerá. Copia y pega esto en la ventana de respuesta del generador de propuestas. Tan pronto como hagas esto, el sistema mostrará una barra de progreso mientras espera 6 confirmaciones de la siguiente manera:
vi: Đầu tiên là mở khoá ví của bạn bằng cách click vào **Thiết lập > Mở khoá ví**, sau đó mở cửa sổ lệnh bằng cách click vào **Dụng cụ > Cửa sổ gỡ rối** và dán câu lệnh đã được sinh. Mã giao dịch sẽ xuất hiện. Copy và dán nó vào cửa sổ tạo đề xuất. Ngay khi bạn làm việc đó, hệ thống sẽ hiển thị thanh tiến trình cho biết bạn phải đợi để có đủ 6 xác thực như dưới đây:

source: Step 3: Creating the proposal transaction and waiting for 6 confirmations of the transaction ID
ar: الخطوة 3: إنشاء معاملة الاقتراح وانتظار 6 تأكيدات من معرف المعاملة
es: Paso 3: crear la transacción de propuesta y esperar 6 confirmaciones de la identificación de transacción
vi: Bước 3: Tạo giao dịch đề xuất và đợi cho giao dịch có 6 xác thực và lấy mã giao dịch

source: Once 6 block confirmations exist, another command will appear to submit the prepared governance object to the network for voting. Copy and paste this command, and your governance object ID will appear as follows:
ar: وبمجرد وجود 6 تأكيدات للحجب ، سيظهر أمر آخر لإرسال كائن الإدارة الذي تم إعداده إلى الشبكة للتصويت. انسخ هذا الأمر والصقه ، وسيظهر معرف كائن الإدارة كما يلي:
es: Una vez que existen 6 confirmaciones de bloque, aparecerá otro comando para enviar el objeto preparado de gobvernanza a la red para votar. Copia y pega este comando, y tu identificación de objeto de governanza aparecerá de la siguiente manera:
vi: Sau khi đã có đủ 6 xác thực, thì lệnh khác sẽ sẵn sàng để gửi đối tượng quản trị đã chuẩn bị đến mạng cho việc biểu quyết. Hãy copy và dán lệnh này, và mã ID của đối tượng quản trị của bạn sẽ xuất hiện giống như sau:

source: Step 4: Submitting the governance object to the network
ar: الخطوة 4: إرسال كائن الإدارة إلى الشبكة
es: Paso 4: enviar el objeto de governanza a la red
vi: Bước 4: Gửi đối tượng quản trị lên mạng lưới Dash

source: You can use this ID to track voting on the proposal until the budget closes and you receive your payout. You can also submit the ID to DashCentral to claim your proposal and enable simplified voting for masternodes using DashCentral voting services.
ar: يمكنك استخدام هذا المعرّف لتعقب التصويت على الاقتراح حتى تغلق الميزانية وتتلقى عائدك. يمكنك أيضًا إرسال المعرّف إلى داش سنترال للمطالبة باقتراحك وتمكين التصويت المبسّط على داش سنترال باستخدام خدمات التصويت داش سنترال.
es: Puedes usar esta identificación para seguir la votación de la propuesta hasta que cierre el presupuesto y recibas tu pago. También puedes enviar la identificación a DashCentral para reclamar tu propuesta y permitir una votación simplificada para los masternodes utilizando los servicios de votación de DashCentral.
vi: Bạn có thể dùng mã ID này để theo dõi việc bỏ phiếu của đề xuất đến khi ngân sách được khép lại và bạn nhận được khoản thanh toán. Bạn cũng có thể đăng mã lên DashCentral để đề xuất của mình có thể được bỏ phiếu bởi các chủ masternode là thành viên trên DashCentral bằng cơ chế bỏ phiếu đơn giản với dịch vụ bỏ phiếu của DashCentral.

source: DashCentral Proposal Generator
ar: مقترحات داش سنترال
es: Generador de Propuestas de DashCentral
vi: Công cụ sinh Đề xuất của DashCentral

source: DashCentral also includes a tool to create budget proposals, or claim existing proposals so you can add a description on DashCentral and begin discussion with the community. The steps to be taken are almost identical to the procedure described above, and documentation is available `here <https://www.dashcentral.org/about/contact>`_.
ar: يتضمن داش سنترال أيضًا أداة لإنشاء مقترحات الميزانية ، أو المطالبة بمقترحات حالية حتى تتمكن من إضافة وصف على داش سنترال وبدء المناقشة مع المجتمع. تتطابق الخطوات التي يجب اتخاذها تقريبًا مع الإجراء الموضح أعلاه ، وتتوفر الوثائق `هنا <https://www.dashcentral.org/about/contact>`_.
es: DashCentral también incluye una herramienta para crear propuestas de presupuesto, o reclamar propuestas existentes para que puedas agregar una descripción en DashCentral y comenzar la discusión con la comunidad. Los pasos a seguir son casi idénticos al procedimiento descrito anteriormente, y la documentación está disponible `aquí <https://www.dashcentral.org/about/contact>`_.
vi: DashCentral cũng có các công cụ để tạo đề xuất ngân sách, hoặc trình bày những đề xuất đã được tạo và bạn có thể bổ sung thêm các phần mô tả trên DashCentral và để cộng đồng có thể bắt đầu thảo luận về nó. Các bước tiến hành cũng gần giống với thủ tục được mô tả ở trên đây và tài liệu của nó thì bạn có thể tìm thấy `ở đây <https://www.dashcentral.org/about/contact>`_.

source: Voting on proposals
ar: التصويت على الإقتراحات
es: Votar por las propuestas
vi: Bỏ phiếu cho các đề xuất

source: **You must vote at least three days before the superblock is created or your vote will not be counted. The exact deadline is 1662 blocks before the superblock.**
ar: **يجب عليك التصويت قبل ثلاثة أيام على الأقل من إنشاء Superblock أو لن يتم احتساب صوتك. الموعد النهائي هو 1662 قطعة قبل superblock**
es: **Debes votar al menos tres días antes de que se cree el superbloque o tu voto no se contará. La fecha límite exacta es 1662 bloques antes del superbloque.**
vi: *Bạn phải bỏ phiếu ít nhất ba ngày trước khi siêu khối được tạo nếu không thì phiếu của bạn sẽ không được tính. Chính xác thì hạn chót là 1662 khối trước siêu khối.**

source: Note that if you do not operate a masternode, you may still be able to vote on DashBoost proposals. See https://www.dashboost.org for more information.
ar: لاحظ أنه إذا لم تقم بتشغيل ماسترنود ، قد تتمكن من التصويت على اقتراحات DashBoost. انظر https://www.dashboost.org لمزيد من المعلومات.
es: Ten en cuenta que si no manejas un masternode, aún podrás votar en propuestas de DashBoost. Visita https://www.dashboost.org para más información.
vi: Chú ý rằng nếu bạn không vận hành một masternode, bạn vẫn có thể bỏ phiếu cho các đề xuất trên DashBoost. Hãy xem https://www.dashboost.org để biết thêm thông tin.

source: Voting on DGBB proposals is an important part of operating a masternode. Since masternodes are heavily invested in Dash, they are expected to critically appraise proposals each month and vote in a manner they perceive to be consistent with the best interests of the network. Each masternode may vote once on each proposal, and the vote can be changed at any time before the voting deadline. The following sites and tools are available to view and manage proposals and voting:
ar: التصويت على مقترحات DGBB هو جزء مهم من تشغيل ماسترنود. بما أن ماسترنود تستثمر بكثافة في داش ، فمن المتوقع أن يقوموا بتقييم المقترحات بشكل نقدي كل شهر والتصويت بطريقة يتصورون أنها تتفق مع أفضل مصالح الشبكة. يجوز لكل صوتي التصويت مرة واحدة على كل اقتراح ، ويمكن تغيير التصويت في أي وقت قبل الموعد النهائي للتصويت. المواقع والأدوات التالية متاحة لعرض وإدارة الاقتراحات والتصويت:
es: La votación de las propuestas de DGBB es una parte importante de la operación de un masternode. Como los propietarios de masternodes han invertido de manera importante en Dash, se espera que evalúen críticamente las propuestas cada mes y voten de una manera que perciban que es coherente con los mejores intereses de la red. Cada masternode puede votar una vez en cada propuesta, y el voto puede cambiarse en cualquier momento antes de la fecha límite de votación. Los siguientes sitios y herramientas están disponibles para ver y gestionar propuestas y votar:
vi: Bỏ phiếu cho đề xuất DGBB là một phần việc quan trọng đối với việc vận hành một masternode. Do chủ masternode đầu tư rất nhiều vào Dash, do vậy vì lợi ích của mình mà các chủ masternode cần đánh giá và bỏ phiếu mỗi tháng sao cho họ cảm nhận là phù hợp với các lợi ích tốt nhất của mạng lưới. Mỗi một masternode có thể được bỏ phiếu một lần cho mỗi đề xuất, và việc bỏ phiếu đó có thể được thay đổi bất kỳ lúc nào miễn chưa đến hết hạn bỏ phiếu. Những website và công cụ sau đây cho phép chúng ta theo dõi và quản lý các đề xuất và bỏ phiếu:

source: `DashCentral <https://www.dashcentral.org/budget>`__
ar: `داش سنترال <https://www.dashcentral.org/budget>`__

source: `Dash Nexus <https://dashnexus.org>`__
ar: `داش نيكسيس <https://dashnexus.org>`__

source: `Dash Ninja - Governance <https://www.dashninja.pl/governance.html>`__
ar: `داش نينجا <https://www.dashninja.pl/governance.html>`__
es: `Dash Ninja - Governanza <https://www.dashninja.pl/governance.html>`__

source: `Dash Masternode Tool - Proposals <https://github.com/Bertrand256/dash-masternode-tool/releases>`__
ar: `ادوات ماسترنود <https://github.com/Bertrand256/dash-masternode-tool/releases>`__
es: `Herramienta Dash Masternode - Propuestas <https://github.com/Bertrand256/dash-masternode-tool/releases>`__

source: For information on how to create a proposal, see :ref:`here <creating-proposals>`.
ar: للحصول على معلومات حول كيفية إنشاء اقتراح ، راجع :ref:`هنا <creating-proposals>`.
es: Para obtener información sobre cómo crear una propuesta, consulta :ref:`aquí <creating-proposals>`.
vi: Thông tin về làm thế nào để tạo một đề xuất, xem :ref:`tại đây <creating-proposals>`.

source: DashCentral
ar: داش سنترال

source: Many masternode operators store their password-protected masternode private key on `DashCentral <https://www.dashcentral.org>`__ to enable simple voting with a user-friendly interface. The popularity of this site has made it a common place for discussion of the proposals after they are submitted to the governance system. To vote from the DashCentral web interface, first add your masternode private key to your account according to the instructions here. Note that the masternode private key is not the same as the private key controlling the 1000 DASH collateral, so there is no risk of losing your collateral. A separate password is required to unlock the masternode private key for voting, so the risk of the site operator voting in your name is minimal.
ar: يقوم العديد من مشغلي ماسترنود بتخزين المفتاح الخاص ماسترنود محمية بكلمة مرور على `داش سنترال <https://www.dashcentral.org>`__ لتمكين التصويت البسيط باستخدام واجهة سهلة الاستخدام. جعلت شعبية هذا الموقع مكانًا مشتركًا لمناقشة المقترحات بعد تقديمها إلى نظام الحوكمة. للتصويت من واجهة الويب داش سنترال ، أضف أولاً المفتاح الخاص ماسترنود إلى حسابك وفقًا للتعليمات الواردة هنا. لاحظ أن المفتاح الخاص ماسترنود الخاص ليس هو نفسه المفتاح الخاص الذي يتحكم في ضمانات داش 1000 ، لذلك لا يوجد خطر فقدان ضماناتك. مطلوب كلمة مرور منفصلة لفتح المفتاح الخاص ماسترنود للتصويت ، وبالتالي فإن خطر مشغل الموقع التصويت باسمك هو الحد الأدنى
es: Muchos operadores de masternodes almacenan sus llaves privadas protegidas por contraseña en `DashCentral <https://www.dashcentral.org>`__ para permitir una votación simple con una interfaz fácil de usar. La popularidad de este sitio lo ha convertido en un lugar común para el debate de las propuestas una vez que se han enviado al sistema de governanza. Para votar desde la interfaz web de DashCentral, primero agrega tu llave privada del masternode a tu cuenta de acuerdo con las instrucciones aquí descritas. Ten en cuenta que la llave privada del masternode no es lo mismo que la llave privada que controla la garantía de 1000 DASH, por lo que no hay riesgo de perder tu garantía. Se requiere una contraseña diferente para desbloquear la llave privada del masternode para votar, por lo que el riesgo de que el operador del sitio vote a tu nombre es mínimo.
vi: Rất nhiều người vận hành masternode lưu khoá riêng của họ với tài khoản được bảo vệ bởi mật khẩu trên `DashCentral <https://www.dashcentral.org>`__ để có thể bỏ phiếu nhanh và đơn giản với giao diện trực quan. Sự phổ biến của website này làm cho nó trở thành một nơi nhiều người thảo luận về các đề xuất sau khi nó được đăng lên hệ thống quản trị. Để bỏ phiếu trên giao diện web của DashCentral, đầu tiên bạn cần nhập khoá riêng của masternode của bạn trong tài khoản theo hướng dẫn ở đây. Chú ý rằng khoá riêng của masternode không phải là khoá riêng để kiểm soát 1000 DASH, như vậy nếu có rủi ro đánh mất khoá riêng cũng không làm bạn bị mất 1000 DASH đặt cọc cho masternode. Đặt mật khẩu riêng cho khoá riêng của masternode để cho bỏ phiếu, và như vậy cũng giảm rủi ro cho việc người vận hành website này sử dụng khoá riêng của bạn xuống mức tối thiểu.

source: When you are ready to vote, go to the `budget proposals page <https://www.dashcentral.org/budget>`_. Simply click to view the proposals, then click either **Vote YES**, **Vote ABSTAIN** or **Vote NO**.
ar: عندما تكون مستعدًا للتصويت ، انتقل إلى `مزانية الإقتراح <https://www.dashcentral.org/budget>`_. ما عليك سوى النقر لعرض المقترحات ، ثم النقر إما على **تصويت نعم** ، **تصويت محايد** أو **تصويت لا**.
es: Cuando estés listo para votar, vaya a la página `propuestas de presupuesto <https://www.dashcentral.org/budget>`_. Haz click para ver las propestas, luego haz click para **Votar SI**, **Votar Abstenerse** o **Votar NO**.
vi: Khi bạn đã sẵn sàng bỏ phiếu, hãy vào `trang ngân sách đề xuất <https://www.dashcentral.org/budget>`_. Chỉ cần click vào để xem các đề xuất rồi click vào một trong các tuỳ chọn **Vote YES**, **Vote ABSTAIN** or **Vote NO**.

source: Voting interface on DashCentral
ar: واجهة التصويت على داش سنترال
es: Interfaz de votación en DasCentral
vi: Giao diện bỏ phiếu trên DashCentral

source: Dash Masternode Tool (DMT)
ar: ادوات ماسترنود داش (DMT)
es: Herramienta de Dash Masternode (DMT)

source: If you started your masternode from a hardware wallet using `DMT <https://github.com/Bertrand256/dash-masternode-tool/releases>`_, you can also use the tool to cast votes. Click **Tools > Proposals** and wait for the list of proposals to load. You can easily see the voting status of each proposal, and selecting a proposal shows details on the **Details** tab in the lower half of the window. Switch to the **Vote** tab to **Vote Yes**, **Vote No** or **Vote Abstain** directly from DMT.
ar: إذا كنت بدأت ماسترنود الخاص بك من استخدام أجهزة محفظة `DMT <https://github.com/Bertrand256/dash-masternode-tool/releases>`_, يمكنك أيضًا استخدام الأداة للإدلاء بالأصوات. انقر فوق **أدوات> الاقتراحات** وانتظر حتى يتم تحميل قائمة المقترحات. يمكنك بسهولة مشاهدة حالة التصويت لكل اقتراح ، ويعرض اختيار اقتراح تفاصيل حول علامة **التفاصيل** في النصف السفلي من النافذة. قم بالتبديل إلى علامة ** تصويت ** إلى **تصويت نعم** ، **تصويت لا** أو **تصويت محايد** مباشرة من DMT.
es: Si iniciaste tu masternode desde una billetera de hardware usando `DMT <https://github.com/Bertrand256/dash-masternode-tool/releases>`_, también puedes usar la herramienta para emitir votos. Haz click en **Herramientas > Propuestas** y espera a que se cargue la lista de propuestas. Puedes ver fácilmente el estado de votación de cada propuesta y seleccionar una propuesta para mostrar los detalles en la pestaña **Detalles** en la mitad inferior de la ventana. Pasa a la pestaña **Votar** para **Votar SI**, **Votar No** o **Votar Abstenerse** directamente de DMT.
vi: Nếu bạn khởi động masternode của bạn từ ví cứng sử dụng `DMT <https://github.com/Bertrand256/dash-masternode-tool/releases>`_, bạn cũng có thể sử dụng công cụ đó để bỏ phiếu. Bấm vào **Tools > Proposals** và đợi cho danh sách các đề xuất được tải. Bạn có thể dễ dàng nhìn thấy tình trạng bỏ phiếu của mỗi một đề xuất và chọn một đề xuất để xem thông tin chi tiết trong trang **Details** ở phần bên dưới của cửa sổ. Chuyển sang trang **Vote** để **Vote Yes**, **Vote No** or **Vote Abstain** một cách trực tiếp từ DMT.

source: Voting interface in DMT
ar: واجهة التصويت في DMT
es: Interfaz de votación en DMT
vi: Giao diện bỏ phiếu trên DMT

source: Dash Core wallet or masternode
ar: محفظة داش كور او ماسترنود
es: Billetera Dash Core o masternode
vi: Ví Dash Core hoặc masternode
