Repository: 12Gitcat/docs
Catalog: locale/*/LC_MESSAGES/wallets/ios/getting-started.po
Languages: es, vi

source: Getting started with sending and receiving Dash on your iOS device
es: Empezando a enviar y recibir Dash en su dispositivo iOS

source: dash, mobile, wallet, ios, send, receive, addresses, getting started
es: dash, móvil, billetera, ios, send, receive, direcciones, empezando

source: Getting started
es: Empezando
vi: Bắt đầu

source: Creating a new wallet
es: Creando nueva cartera
vi: Tạo ví mới

source: When you first start your Dash Wallet, you will be prompted to choose between creating a new wallet or recovering an existing wallet. Choose **New Wallet** to create a new wallet unless you have existing funds stored in another wallet using a recovery phrase. Your new wallet will be generated, and a recovery phrase will appear so you can recover the funds later if you lose or damage your phone or need to transfer the account to another device. Write the phrase down and store it in a safe place - if you lose this, you will also lose access to your funds forever.
es: Cuando inicia por primera vez su Billetera Dash, se le pedirá que elija entre crear una billetera nueva o recuperar una billetera existente. Seleccione **Nueva Billetera** para crear una billetera nueva a menos que tenga fondos almacenados en otra billetera usando una frase de recuperación. Su nueva billetera se generará, y una frase de recuperación aparecerá así podrá recuperar los fondos si pierde o daña su teléfono o necesita transferir la cuenta a otro dispositivo. Escriba la frase y almacene en un lugar seguro - Si la pierde, también perderá acceso a sus fondos por siempre.
vi: Khi bạn khởi động ví Dash lần đầu tiên, bạn sẽ được nhắc để lựa chọn giữa việc tạo một ví mới hoặc phục hồi từ một ví đã có sẵn. Chọn **Tạo ví mới** để tạo một ví mới, ngược lại nếu bạn đã có sẵn một ví mà đã có tiền trong đó thì bạn sử dụng một câu phục hồi. Khi ví mới của bạn được tạo, và một câu phục hồi sẽ xuất hiện để giúp bạn có thể phục hồi để lấy lại tiền trong ví trong tương lai nếu bạn bị mất hoặc hỏng điện thoại hay bạn muốn chuyển tài khoản sang thiết bị khác. Hãy viết dòng chữ đó xuống và cất giữ nó ở nơi an toàn - nếu bạn để mất nó, bạn sẽ có thể mất quyền truy cập đến khoản tiền của mình mãi mãi.

source: *Creating a new wallet and generating the recovery phrase in iOS Dash Wallet*
es: *Crear una nueva billetera y generar la frase de recuperación en la billetera de Dash iOS*
vi: *Tạo một ví mới và sinh một câu khôi phục trong ví Dash Wallet trên iOS*

source: You may also be asked to specify a PIN or link the app with your TouchID. You can tap the Dash logo at the top of the app to view your balance. You will need to unlock your wallet for this, as well as to view your transaction history or send Dash.
es: También se te puede pedir que especifiques un PIN o que enlaces la aplicación con su TouchID. Puedes tocar el logotipo de Dash en la parte superior de la aplicación para ver tu saldo. Tendrás que desbloquear tu billetera para esto, así como para ver tu historial de transacciones o enviar Dash.
vi: Bạn có thể được hỏi để xác định một số PIN hoặc liên kết app với TouchID của bạn. Bạn có thể bấm vào logo Dash ở phía trên của app để xem số dư của mình. Bạn sẽ cần phải mở khoá ví để làm việc đó, cũng như bạn muốn nhìn lịch sử giao dịch hoặc gửi Dash.

source: Receiving
es: Recibiendo
vi: Nhận

source: Once you have set up your wallet, you will have two screens available to send and receive Dash. You can swipe left and right between the screens. To receive Dash, the app will generate an address which appears at the bottom of the screen. You can tap this to copy and share, or scan the QR code directly. Once the transfer is complete, you can view your balance, transaction history and the status of any pending transactions by clicking the menu button at the top left.
es: Una vez que haya configurado tu billetera, tendrá dos pantallas disponibles para enviar y recibir Dash. Puedes deslizar el dedo hacia la izquierda y hacia la derecha entre las pantallas. Para recibir Dash, la aplicación generará una dirección que aparecerá en la parte inferior de la pantalla. Puedes tocar esto para copiar y compartir, o escanear el código QR directamente. Una vez que se complete la transferencia, puedes ver tu saldo, el historial de transacciones y el estado de las transacciones pendientes haciendo clic en el botón de menú en la parte superior izquierda.
vi: Khi bạn đã thiết lập xong ví, bạn sẽ có hai loại màn hình khác nhau để cho việc gửi và nhận Dash. Bạn có thể quệt tay sang trái và sang phải giữ các màn hình này. Để nhận Dash, ứng dụng sẽ sinh cho bạn một địa chỉ xuất hiện ở dưới cuối màn hình. Bạn có thể bấm vào đó để copy hoặc chia sẻ, hoặc quét mã QR đó một cách trực tiếp. Khi việc chuyển tiền thành công, bạn có thể xem lại số dư, lịch sử giao dịch và trạng thái của các giao dịch đang chờ bằng việc bấm vào nút menu ở góc trên bên trái màn hình.

source: *Receiving Dash and viewing your balance in iOS Dash Wallet*
es: *Recibir Dash y ver tu saldo en la billetera de Dash para iOS*
vi: *Nhận Dash và xem số dư trên ví Dash Wallet cho iOS*

source: Sending
es: Enviando
vi: Gửi

source: The Send DASH screen gives you two options to enter the payment address: **Scan QR Code** or **Pay Address From Clipboard**. You can choose to use **InstandSend** for instant confirmation, or disable this to send a normal transaction which will require more time for confirmation. Depending on the code you are scanning, the amount of Dash requested may be included, or you can enter it yourself. A confirmation screen will appear to explain the fee structure and request your unlock code (PIN or TouchID). The transaction will then be sent.
es: La pantalla Enviar DASH te ofrece dos opciones para ingresar la dirección de pago: **Escanear código QR** o **Dirección de pago desde el portapapeles**. Puedes optar por utilizar **InstandSend** para la confirmación instantánea, o deshabilitar esto para enviar una transacción normal que requerirá más tiempo para la confirmación. Dependiendo del código que estás escaneando, se puede incluir la cantidad de Dash solicitada, o puedes ingresarlo tu mismo. Aparecerá una pantalla de confirmación para explicar la estructura de comisiones y solicitar tu código de desbloqueo (PIN o TouchID). Después, la transacción será enviada.
vi: Màn hình gửi DASH cho bạn hai chọn lựa để nhập địa chỉ cần thanh toán: **Quét mã QR** hoặc **Lấy địa chỉ từ vùng bộ nhớ đệm clipboard**. Bạn có thể chọn để sử dụng **InstandSend** để có xác thực tức thời, hoặc tắt tính năng này để gửi theo cách bình thường mà nó sẽ cần nhiều thời gian hơn để chờ xác thực. Tuy thuộc vào mã mà bạn quét, số lượng Dash yêu cầu có thể được bao gồm hoặc bạn có thể tự nhập vào. Một màn hình xác nhận sẽ xuất hiện để giải thích về mức phí và cần bạn nhập mã mở khoá ví (mã PIN hoặc TouchID). Sau đó giao dịch sẽ được gửi.

source: *Sending Dash from iOS Dash Wallet*
es: *Enviar Dash desde la billetera de Dash iOS*
vi: *Gửi Dash từ ví Dash trên iOS*

source: Sending to a Bitcoin address
es: Enviar a una dirección de Bitcoin
vi: Gửi đến một địa chỉ Bitcoin

source: You can also send from your Dash Wallet directly to a Bitcoin address using services provided by ShapeShift that are integrated directly in the wallet. If you scan or enter a Bitcoin address, you will be asked to enter the amount to be send in Bitcoin instead of Dash. Once you have entered the amount, click the **Shapeshift!** button shown an additional confirmation screen to confirm the ShapeShift fees before the transaction is processed. Make sure your destination Bitcoin address on this screen is correct. (If you see an error message about the value being too low, tap the greyed out Dash amount at the top to specify the amount to be transferred in Dash instead of Bitcoin.) Once your transaction is accepted, the Dash Wallet for iOS will display **Shapeshift in progress** until the transaction is complete.
es: También puedes enviar desde tu billetera de Dash directamente a una dirección de Bitcoin utilizando servicios proporcionados por ShapeShift que están integrados directamente en la billetera. Si escaneas o ingresas una dirección de Bitcoin, se te pedirá que ingreses la cantidad que se enviará en Bitcoin en lugar de Dash. Una vez que hayas ingresado el monto, haz clic en el botón **¡Shapeshift!** que se muestra en una pantalla de confirmación adicional para confirmar las comisiones de ShapeShift antes de procesar la transacción. Asegúrate de que la dirección de destino de Bitcoin en esta pantalla sea la correcta. (Si ves un mensaje de error que indica que el valor es demasiado bajo, toca la cantidad de Dash en gris en la parte superior para especificar el monto que se transferirá en Dash en lugar de Bitcoin). Una vez que se acepte tu transacción, la billetera de Dash para iOS mostrará **Shapeshift en progreso** hasta que se complete la transacción.
vi: Bạn cũng có thể gửi từ ví Dash của bạn trực tiếp đến một địa chỉ Bitcoin sử dụng dịch vụ được cung cấp bởi ShapeShift đã được tích hợp trực tiếp trong phần mềm ví. Nếu bạn quét hoặc nhập địa chỉ Bitcoin, bạn sẽ được hỏi nhập vào số lượng sẽ được gửi theo đơn vị là Bitcoin thay vì tính bằng Dash. Khi bạn đã nhập số lượng, click vào nút **Shapeshift!** thì sẽ hiện một màn hình xác nhận bổ sung để xác nhận mức phí của ShapeShift trước khi giao dịch được tiến hành. Hãy chắc chắn rằng địa chỉ nhận Bitcoin là chính xác. (Nếu bạn thấy một thông báo lỗi về giá trị là quá thấp, bấm vào nút Dash màu xám ở trên đỉnh để nhập số lượng cần chuyển tính theo đơn vị là Dash thay vì theo Bitcoin.) Khi giao dịch được chấp nhận, ví Dash Wallet cho iOS sẽ hiển thị **Shapeshift đang xử lý** đến khi giao dịch được hoàn tất.

source: *Sending Dash to a Bitcoin address via ShapeShift from iOS Dash Wallet*
es: *Envío de Dash a una dirección de Bitcoin a través de ShapeShift desde la billetera de Dash iOS*
vi: *Gửi Dash đến một địa chỉ Bitcoin qua ShapeShift từ ví Dash Wallet trên iOS*
