Repository: 12Gitcat/docs
Catalog: locale/*/LC_MESSAGES/merchants/technical.po
Languages: ar, de, ru

source: Technical guides for merchants using Dash. API and SDK resources.
ar: الأدلة الفنية للتجار باستخدام داش. موارد API و SDK.
ru: Техническое руководство для продавцов и сервисов, использующих Dash. Ресурсы API и SDK.

source: dash, merchants, payment processor, API, SDK, insight, blockcypher, gocoin, instantsend, vending machines
ar: داش ، تجار ، معالج دفع ، API ، SDK ، رؤية ، blockcypher ، gocoin ، الإرسال الفوري ، آلات بيع
ru: dash, продавцы, сервисы, обработчик платежей, API, SDK, insight, blockcypher, gocoin, instantsend, торговые автоматы

source: Technical Guides
ar: الأدلة الفنية
de: Technischer Guide
ru: Техническое руководство

source: Dash Wallet Integration
ru: Интеграция Dash Wallet

source: This documentation is also available as a `PDF <https://github.com/dashpay/docs/raw/master/binary/merchants /Integration-Resources-Wallet-Integration.pdf>`__.
ru: Этот документ также доступен в формате `PDF <https://github.com/dashpay/docs/raw/master/binary/merchants /Integration-Resources-Wallet-Integration.pdf>`__.

source: `Dash Core <https://github.com/dashpay/dash/releases>`__ is a fork of Bitcoin and the majority of functionality included in the Dash Core Daemon can be integrated in a similar manner. Key differences relate to customizations to existing JSON-RPC commands to support unique functionalities such as InstantSend. These differences, as well as more general information, are summarized below.
ru: `Dash Core <https://github.com/dashpay/dash/releases>`__ -это форк Биткойна, следовательно, большую часть функционала Dash Core Daemon можно внедрить похожим образом. Ключевые отличия лишь в изменении существующих JSON-RPC команд, чтобы можно было поддерживать такие уникальные функции, как InstantSend. Эти отличия, а также общая информация, приведены ниже.

source: **General Information:** Dash is a “Proof of Work” blockchain with attributes similar to that of Bitcoin.
ru: **Общая информация:** Dash - блокчейн, работающий на основе “Доказательства Работы” и имеющий похожие на Биткойн характеристики.

source: Block Time: ~2.6 Minutes per Block
ru: Время блока: ~2,6 минуты на блок

source: Blockchain Confirmations: 6 Confirmations (or 1 in the case of InstantSend)
ru: Подтверждения блокчейна: 6 подтверждений (или 1, в случае InstantSend)

source: Github Source: https://github.com/dashpay/dash
ru: Github: https://github.com/dashpay/dash

source: Release Link: https://github.com/dashpay/dash/releases
ru: Ссылка на релиз: https://github.com/dashpay/dash/releases

source: **JSON-RPC Interface:** The majority of Bitcoin JSON-RPC commands are unchanged making integration into existing systems relatively straightforward. For a complete listing of RPC commands see the `Developer Guide <https://dash-docs.github.io/en/developer-guide>`__.
ru: **Интерфейс JSON-RPC:** Большинство свойственных Биткойну JSON-RPC команд не поменялись, благодаря чему интеграция в существующие системы остаётся относительно простой. Полный список RPC команд можно посмотреть в `Инструкции Разработчика <https://dash-docs.github.io/en/developer-guide>`__.

source: It’s worth noting that several key Transaction-related JSON-RPC commands have been modified to support InstantSend through the addition of an “InstantLock” field and are listed below:
ru: Стоит упомянуть, что несколько важных JSON-RPC команд, работающих с Транзакциями, были изменены, чтобы они могли поддерживать InstantSend - было добавлено поле “InstantLock”. Ниже приведены эти команды:

source: **Block Hashing Algorithm:** Dash uses the “X11” algorithm in place of SHA256 used in Bitcoin. It’s important to note, however, that this only affects the hashing of the Block itself. All other internals utilize SHA256 hashes (transactions, merkle root, etc) which allows for most existing libraries to work in the Dash ecosystem.
ru: **Алгоритм хеширования блока:** Dash использует алгоритм X11, вместо SHA256, который используется в Биткойне. Однако стоит отметить, что это относится только к хешированию Блока. Все прочие внутренние функции работают с хешами SHA256 (транзакции, корни merkle, и т.д.), благодаря чему большинство существующих библиотек совместимы с экосистемой Dash.

source: **Supporting Libraries:** Due to the aforementioned differences in Hashing Algorithm only minor adjustments are required before using Bitcoin libraries on the Dash network. The most popular libraries have already been ported to Dash which has enabled support for most major programming languages. These resources are outlined in the :ref:`SDK Resources <sdk-resources>` section of this document.
ru: **Поддержка библиотек:** Из-за вышеупомянутых различий в алгоритмах хеширования, потребуется сделать несколько небольших настроек, чтобы библиотеки Биткойна работали в сети Dash. Самые популярные библиотеки уже были перенесены в Dash, и поэтому стала возможна поддержка большинства основных языков программирования. Эти ресурсы отмечены в этом документе в разделе :ref:`SDK Ресурсы <sdk-resources>`.

source: v0.13.0 Integration Notes
ru: Примечания по интеграции с v0.13.0

source: This documentation is also available as a `PDF <https://github.com/dashpay/docs/raw/master/binary/merchants/Integration-Resources-Dash-v0.13.0-Transaction-Types.pdf>`__.
ru: Этот документ также доступен в формате `PDF <https://github.com/dashpay/docs/raw/master/binary/merchants/Integration-Resources-Dash-v0.13.0-Transaction-Types.pdf>`__.

source: Dash 0.13.0 implements `DIP002 Special Transactions <https://github.com/dashpay/dips/blob/master/dip-0002.md>`__, which form a basis for new transaction types that will provide on-chain metadata to assist various consensus mechanisms. The following special transaction types exist:
ru: Dash 0.13.0 внедряет `DIP002 Специальные транзакции <https://github.com/dashpay/dips/blob/master/dip-0002.md>`__, который формирует основу для новых типов транзакций, с помощью которых можно будет обмениваться метаданными и поддерживать различные консенсусные механизмы. Существуют следующие типы специальных транзакций:

source: Release
ru: Релиз

source: Version
ru: Версия

source: Type
ru: Тип

source: Payload Size
ru: Размер нагрузки

source: Payload
ru: Нагрузка

source: Payload JSON
ru: Нагрузка JSON

source: Transaction Purpose
ru: Назначение транзакции

source: Standard Transaction
ru: Стандартная транзакция

source: `Masternode Registration <https://dash-docs.github.io/en/developer-reference#proregtx>`__
ru: `Регистрация мастерноды <https://dash-docs.github.io/en/developer-reference#proregtx>`__

source: `Update Masternode Service <https://dash-docs.github.io/en/developer-reference#proupservtx>`__
ru: `Обновление услуг мастерноды <https://dash-docs.github.io/en/developer-reference#proupservtx>`__

source: `Update Masternode Operator <https://dash-docs.github.io/en/developer-reference#proupregtx>`__
ru: `Обновление оператора мастерноды <https://dash-docs.github.io/en/developer-reference#proupregtx>`__

source: `Masternode Revocation <https://dash-docs.github.io/en/developer-reference#prouprevtx>`__
ru: `Аннулирование мастерноды <https://dash-docs.github.io/en/developer-reference#prouprevtx>`__

source: `Masternode List Merkle Proof <https://dash-docs.github.io/en/developer-reference#cbtx>`__
ru: `Мёркл-подтверждение списка мастернод <https://dash-docs.github.io/en/developer-reference#cbtx>`__

source: `Quorum Commitment <https://dash-docs.github.io/en/developer-reference#qctx>`__
ru: `Формирование кворума <https://dash-docs.github.io/en/developer-reference#qctx>`__

source: Integration notes:
ru: Примечания по интеграции:

source: `DIP002 Special Transactions <https://github.com/dashpay/dips/blob/master/dip-0002.md>`__ are a foundational component of Dash Core v0.13.0 and introduce a new Transaction Version and related “Payload” to the network.
ru: `DIP002 Специальные тразакции <https://github.com/dashpay/dips/blob/master/dip-0002.md>`__ - основной компонент Dash Core v0.13.0, он вводит новые версии транзакций и соответствующую им "Нагрузку" сети

source: Integrated Systems must be able to `serialize and deserialize <https://github.com/dashpay/dips/blob/master/dip-0002.md#serialization-hashing-and-signing>`__ these new Transaction Types in order to accurately encode and decode Raw Transaction data.
ru: Интегрированные системы должны быть способны к `сериализации и десериализации <https://github.com/dashpay/dips/blob/master/dip-0002.md#serialization-hashing-and-signing>`__ этих новых Типов Транзакций, чтобы шифрование и дешифровка данных Исходных Транзакций происходила успешно.

source: From a `backwards compatibility <https://github.com/dashpay/dips/blob/master/dip-0002.md#compatibility>`__ perspective, the 4 byte (32-bit) ``version`` field included in Legacy Transactions has been split into two fields: ``version`` and ``type`` (each consisting of 2 bytes).
ru: С точки зрения `обратной совместимости <https://github.com/dashpay/dips/blob/master/dip-0002.md#compatibility>`__, 4-байтная (32-bit) поле ``версии``, включённое в Старые Транзакции, было разделено на два поля: ``версия`` и ``тип`` (каждое состоит из 2 байтов).

source: `InstantSend <https://docs.dash.org/en/latest/merchants/technical.html#instantsend>`__ status and Payload JSON (e.g. ``proRegTx``) is included in the JSON-RPC response, please note that this data is not part of the calculated hash and is provided for convenience.
ru: Статус `InstantSend <https://docs.dash.org/en/latest/merchants/technical.html#instantsend>`__ и Нагрузки JSON (например, ``proRegTx``) включён в ответ JSON-RPC. Пожалуйста, обратите внимание, что эти данные не являются частью рассчитываемого хеша и предоставлены для удобства.

source: Legacy transaction structure::
ru: Старая структура транзакций::

source: Updated transaction structure::
ru: Обновлённая структура транзакций::

source: See the `Special Transactions developer documentation <https://dash-docs.github.io/en/developer-reference#special-transactions>`__ for additional detail on these data types, e.g. ``<variable int>``. See the `v0.13.0 transaction types integration documentation (PDF) <https://github.com/dashpay/docs/raw/master/binary/merchants/Integration-Resources-Dash-v0.13.0-Transaction-Types.pdf>`__ for worked examples of each transaction type.
ru: Чтобы узнать подробности об этих типах данных, сморите `Документацию разработчиков по Специальным Транзакциям <https://dash-docs.github.io/en/developer-reference#special-transactions>`__ , например ``<variable int>``. Смотрите документацию по `интеграции различных типов транзакций в v0.13.0 (PDF) <https://github.com/dashpay/docs/raw/master/binary/merchants/Integration-Resources-Dash-v0.13.0-Transaction-Types.pdf>`__, где есть рабочие примеры каждого типа транзакций.

source: API Services
ar: خدمات API
de: API-Dienste
ru: Сервисы API

source: This documentation is also available as a `PDF <https://github.com/dashpay/docs/raw/master/binary/merchants /Integration-Resources-API.pdf>`__.
ar: هذه الوتيقة متاحة `هنا <https://github.com/dashpay/docs/raw/master/binary/merchants /Integration-Resources-API.pdf>`__.
de: Diese Dokumentation ist auch als englischsprachiges `PDF <https://github.com/dashpay/docs/raw/master/binary/merchants /Integration-Resources-API.pdf>`__ verfügbar.
ru: Эта документация также доступна в формате `PDF <https://github.com/dashpay/docs/raw/master/binary/merchants /Integration-Resources-API.pdf>`__.

source: Several API services exist to facilitate quick and easy integration with the Dash network for services including:
ar: توجد عدة خدمات API لتسهيل التكامل السريع والسهل مع شبكة داش للخدمات بما في ذلك:
de: Mehrere API-Dienste können dazu verwendet werden, eine der folgenden Funktionen des Dash-Netzwerks mit einer Plattform zu verbinden:
ru: Существует несколько сервисов API, которые облегчают быструю и простую интеграцию с сетью Dash для таких сервисов как:

source: Transaction broadcasting
ar: بث المعاملات
de: Transaktionsübermittlung
ru: Трансляция транзакций

source: Exchange rates
ar: معدل التحويل
de: Kurse
ru: Валютные курсы

source: Currency conversion
ar: تحويل العملة
de: Währungsumtausch
ru: Конвертация валюты

source: Invoice generation
ar: جيل الفاتورة
de: Anfrageerstellung
ru: Генерация счетов

source: API Services are typically leveraged to eliminate that requirement of running your own infrastructure to support blockchain interactions. This includes mechanisms such as:
ar: يتم استخدام خدمات API بشكل نموذجي للتخلص من متطلبات تشغيل البنية الأساسية الخاصة بك لدعم تفاعلات بلوكشين. يتضمن ذلك آليات مثل:
de: API-Dienste werden im Normalfall verwendet, damit auf eine eigene Infrastruktur zum Zugriff auf die Blockchain verzichtet werden kann. Dazu gehören Mechanismen wie:
ru: API-сервисы обычно используются для устранения этого требования при запуске вашей собственной инфраструктуры для поддержки взаимодействия с блокчейном. Сюда входят такие механизмы, как:

source: Forming and Broadcasting a Transaction to the network.
ar: تشكيل ونقل المعاملات إلى الشبكة.
de: Transaktion erstellen und an das Netzwerk übermitteln
ru: Формирование и трансляция транзакций в сеть.

source: Address generation using HD Wallets.
ar: توليد العناوين باستخدام HD محافظ.
de: Adresserstellung über HD-Wallets
ru: Генерация адресов с использованием HD кошельков.

source: Payment Processing using WebHooks.
ar: معالجة الدفع باستخدام WebHooks.
de: Zahlungsverarbeitung über WebHooks
ru: Обработка платежей с использованием WebHooks.

source: There are a variety of options for supporting these methods, with the key differentiator being the pricing model included and supported features. The following list of API Providers attempts to outline these key features/differentiators and also includes a link to related documentation.
ar: هناك مجموعة متنوعة من الخيارات لدعم هذه الطرق ، مع الاختلاف الرئيسي في كون نموذج التسعير مضمنًا وميزات مدعومة. تحاول القائمة التالية لمقدمي واجهة برمجة التطبيقات تحديد هذه الميزات / الاختلافات الرئيسية كما تتضمن أيضًا رابطًا للوثائق ذات الصلة.
de: Es gibt mehrere Arten, auf derartige Funktionen zuzugreifen, wobei diese sich hauptsächlich in der Preisgestaltung und in der Reichweite der Möglichkeiten unterscheiden. Die folgende Liste an API-Diensten versucht die Unterschiede herauszustellen und verweist auf weiterführende Dokumentationen zu den einzelnen Diensten.
ru: Существует множество вариантов поддержки этих методов, ключевым отличием которых является включённая модель ценообразования и поддерживаемые функции. В следующем списке провайдеров API выполнена попытка описать эти ключевые функции/дифференциаторы, также в него включена ссылка на соответствующую документацию.

source: The open-source Insight REST API provides you with a convenient, powerful and simple way to read data from the Dash network and build your own services with it. A practical guide to getting started with the Insight API and Insight UI block explorer is available :ref:`here <insight-api>`.
ru: Dash Insight REST API c открытым кодом - это удобный, мощный и простой способ считывать данные из сети Dash и разрабатывать с его помощью свои собственные сервисы. Практическое руководство по Insight API и Insight UI обозревателю блоков для начинающих доступен :ref:`тут <insight-api>`.

source: Features: Transaction Broadcast, WebSocket Notifications.
ar: الميزات: بث المعاملات ، إخطارات WebSocket.
de: Funktionen: Transaktionsübermittlung, WebSocket-Benachrichtigungen
ru: Функции: трансляция транзакций, уведомления WebSocket.

source: Pricing Model: Free / Open Source
ar: نموذج التسعير: مجاني / مفتوح المصدر
de: Preisgestaltung: Kostenlos / Open-Source
ru: Модель ценообразования: бесплатный / открытый источник

source: Documentation: https://github.com/dashevo/insight-api
ar: الوتيقة:https://github.com/dashevo/insight-api
de: Dokumentation: https://github.com/dashevo/insight-api
ru: Документация: https://github.com/dashevo/insight-api

source: BlockCypher is a simple, mostly RESTful JSON API for interacting with blockchains, accessed over HTTP or HTTPS from the api.blockcypher.com domain.
ar: BlockCypher هو واجهة برمجة تطبيقات بسيطة ومعظمها RESTful JSON للتفاعل مع بلوكشين ، يمكن الوصول إليها عبر HTTP أو HTTPS من نطاق api.blockcypher.com.
de: BlockCypher bietet eine RESTful JSON API, um mit der Blockchain zu interagieren. Der Zugriff ist über HTTP oder HTTPS durch die Adresse api.blockcypher.com möglich.
ru: BlockCypher представляет собой простой, в основном RESTful JSON API для взаимодействия с блокчейнами, доступ к которому осуществляется через HTTP или HTTPS из домена api.blockcypher.com.

source: Features: Transaction Broadcast, HD Wallet / Address Generation, WebSocket and WebHook Callbacks as well as Payment Forwarding. BlockCypher does not handle Private Keys.
ar: الميزات: بث المعاملات ، HD محفظة / توليد عناوين ، WebSocket و WebHook Callbacks بالإضافة إلى إعادة توجيه الدفع. BlockCypher لا يتعامل مع مفاتيح خاصة.
de: Funktionen: Transaktionsübermittlung, HD Wallet- / Adresserstellung, WebSocket und WebHook Rückmeldung und Payment Forwarding. BlockCypher greift nicht auf die Private Keys zu
ru: Функции: трансляция транзакций, кошелёк HD / генерация адресов, обратные вызовы WebSocket и WebHook, а также экспедирование платежей. BlockCypher не обрабатывает приватные ключи.

source: Pricing Model: Per API Call, 5000 Requests -> $85.00 per month (https://accounts.blockcypher.com/plans)
ar: نموذج التسعير: لكل استدعاء API ، طلبات 5000 -> 85.00 دولار في الشهر (https://accounts.blockcypher.com/plans)
de: Preisgestaltung: Pro API-Anfrage, 5000 Anfragen -> $85 im Monat (https://accounts.blockcypher.com/plans )
ru: Модель ценообразования: за API звонок, 5000 запросов -> $85.00 в месяц (https://accounts.blockcypher.com/plans)

source: Documentation: https://www.blockcypher.com/dev/dash/
ar: الوتيقة:https://www.blockcypher.com/dev/dash/
de: Dokumentation: https://www.blockcypher.com/dev/dash/
ru: Документация: https://www.blockcypher.com/dev/dash/

source: ChainRider is a cloud service providing a set of REST APIs for digital currency management and exploration.
ar: ChainRider هي خدمة سحابة توفر مجموعة من واجهات برمجة التطبيقات REST لإدارة واستكشاف العملة الرقمية.
ru: ChainRider - облачный сервис, обеспечивающий набор из нескольких REST API для цифрового управления валютой и исследований.

source: Features: Blockchain queries, Event Notifications, Transaction Broadcast, Payment Processing, etc.
ar: الميزات: استعلامات بلوكشين ، إخطارات الأحداث ، بث المعاملات ، معالجة الدفع ، إلخ.
ru: Функции: блокчейн-запросы, уведомления о событиях, трансляция транзакций, обработка платежей и т.п.

source: Pricing Model: Free trial, pay per API call
ar: نموذج التسعير: إصدار تجريبي مجاني والدفع لكل مكالمة API
ru: Модель ценообразования: бесплатно в течение пробного периода, оплата за API-звонок

source: Documentation: https://www.chainrider.io/docs/dash
ar: الوتيقة:https://www.chainrider.io/docs/dash
ru: Документация: https://www.chainrider.io/docs/dash

source: The GoCoin platform makes taking Dash as easy as installing a plugin. Payment processing is already implemented for every major shopping platform. GoCoin is focused on helping merchants in privacy-related niches and specific industries, and handles all transaction risk for all payments from your customers.
ar: تجعل منصة GoCoin من اتخاذ داش أمرًا سهلاً مثل تثبيت مكون إضافي. يتم تنفيذ معالجة الدفع بالفعل لكل منصة تسوق رئيسية. تركز GoCoin على مساعدة التجار في منافذ الخصوصية وصناعات محددة ، وتتعامل مع جميع مخاطر المعاملات لجميع المدفوعات من عملائك.
de: Durch die GoCoin-Plattform kann Dash mithilfe eines simplen Plugins akzeptiert werden. Dieses kann in die meisten der großen Shop-Plattformen integriert werden. GoCoin bietet seine Dienste auch Unternehmen an, die an einem hohen Maß an Privatsphäre interessiert sind. Alle Transaktionsrisiken werden von GoCoin getragen.
ru: С помощью платформы GoCoin управлять Dash так же просто, как и с помощью установленного плагина. Для каждой крупной торговой платформы уже реализован обработчик платежей. GoCoin ориентирована на то, чтобы помочь продавцам в нишах, связанных с частной деятельностью и в специфических индустриях, а также для урегилирования рисков по транзакциям для всех клиентских платежей.

source: Features: Invoicing, Exchange Rates, WebHook Callbacks. GoCoin holds Private Keys on their server allowing the merchant to withdraw funds in Cryptocurrency or convert to Fiat.
ar: الميزات: الفواتير ، أسعار الصرف ، WebHook Callbacks. تحتفظ GoCoin بالمفاتيح الخاصة على خادمها مما يسمح للتاجر بسحب الأموال في العملات الرقمية أو تحويلها إلى Fiat.
de: Funktionen: Abrechnung, Währungsrechner, WebHook Rückmeldung. GoCoin sichert die Private Keys der Händler. Kryptowährungen können entweder ausgezahlt oder in Fiat umgewandelt werden.
ru: Функции: выставление счетов, курсы валют, обратные вызовы WebHook. GoCoin хранит приватные ключи на своём сервере, что позволяет продавцу извлекать средства в криптовалюте или конвертировать их в фиатную валюту.

source: Integrations: WooCommerce, Magento, Prestashop, VirtueMart, ZenCart, OpenCart, OSCommerce, UberCart, nopCommerce, WHMCS, NATS4, Shopify.
ar: التكامل: WooCommerce ، Magento ، Prestashop ، VirtueMart ، ZenCart ، OpenCart ، OSCommerce ، UberCart ، nopCommerce ، WHMCS ، NATS4 ، Shopify.
de: Integrationen: WooCommerce, Magento, Prestashop, VirtueMart, ZenCart, OpenCart, OSCommerce, UberCart, nopCommerce, WHMCS, NATS4, Shopify
ru: Интеграция с: WooCommerce, Magento, Prestashop, VirtueMart, ZenCart, OpenCart, OSCommerce, UberCart, nopCommerce, WHMCS, NATS4, Shopify.

source: Pricing Model: 1% Processing Fee (https://gocoin.com/fees)
ar: نموذج التسعير: رسوم المعالجة بنسبة 1٪ (https://gocoin.com/fees)
de: Preisgestaltung: 1% der Transaktion (https://gocoin.com/fees)
ru: Модель ценообразования: разовая комиссия в размере 1% (https://gocoin.com/fees)

source: Documentation: https://gocoin.com/docs
ar: الوتيقة:https://gocoin.com/docs
de: Dokumentation: https://gocoin.com/docs
ru: Документация: https://gocoin.com/docs

source: CoinPayments is an integrated payment gateway for cryptocurrencies such as Dash. Shopping cart plugins are available for all popular webcarts used today. CoinPayments can help you set up a new checkout, or integrate with your pre-existing checkout.
ar: CoinPayments هو عبارة عن بوابة دفع متكاملة لعمليات العملات الرقمية مثل داش. تتوفر المكونات الإضافية لسلة التسوق لجميع كاميرات الويب الشائعة المستخدمة اليوم. يمكن أن تساعدك CoinPayments في إعداد عملية دفع جديدة ، أو تتكامل مع عملية الدفع السابقة.
de: CoinPayments ist ein Zahlungs-Gateway, der neben Dash mit verschiedenen Kryptowährungen kompatibel ist. PlugIns sind für viele verschiedene Software-Anbieter verfügbar. CoinPayments kann selbst einen Checkout gestalten, aber auch in einen bestehenden Checkout integriert werden.
ru: CoinPayments - это интегрированный платёжный шлюз для криптовалют, таких как Dash. Плагины покупочных карт доступны для всех популярных, используемых сегодня веб-карт. CoinPayments может помочь вам оформить новый или интегрироваться с уже существующим заказом.

source: Features: Invoicing, Exchange Rates, WebHook Callbacks. CoinPayments holds Private Keys on their server allowing merchant to withdraw funds in Cryptocurrency or convert to Fiat.
ar: الميزات: الفواتير ، أسعار الصرف ، WebHook Callbacks. تحتفظ CoinPayments بمفاتيح خاصة على خادمها تسمح للتاجر بسحب الأموال في العملات الرقمية أو تحويلها إلى Fiat.
de: Funktionen: Abrechnung, Währungsrechner, WebHook Rückmeldung. GoCoin sichert die Private Keys der Händler. Kryptowährungen können entweder ausgezahlt oder in Fiat umgewandelt werden.
ru: Функции: выставление счетов, курсы валют, обратные вызовы WebHook. CoinPayments хранит приватные ключи на своём сервере, что позволяет продавцу извлекать средства в криптовалюте или конвертировать их в фиатную валюту.
