Repository: 12Gitcat/docs
Catalog: locale/*/LC_MESSAGES/merchants/technical.po
Languages: ar, de, ru

source: Integrations: aMember Pro, Arastta, Blesta, BoxBilling, Drupal, Ecwid, Hikashop, Magento, OpenCart, OSCommerce, PrestaShop, Tomato Cart, WooCommerce, Ubercart, XCart, ZenCart
ar: التكاملات: aMember Pro، Arastta، Blesta، BoxBilling، Drupal، Ecwid، Hikashop، Magento، OpenCart، OSCommerce، PrestaShop، Tomato Cart، WooCommerce، Ubercart، XCart، ZenCart
de: Integrationen: aMember Pro, Arastta, Blesta, BoxBilling, Drupal, Ecwid, Hikashop, Magento, OpenCart, OSCommerce, PrestaShop, Tomato Cart, WooCommerce, Ubercart, XCart, ZenCart
ru: Интеграция с: aMember Pro, Arastta, Blesta, BoxBilling, Drupal, Ecwid, Hikashop, Magento, OpenCart, OSCommerce, PrestaShop, Tomato Cart, WooCommerce, Ubercart, XCart, ZenCart

source: Pricing Model: 0.5% Processing Fee (https://www.coinpayments.net/help-fees)
ar: نموذج التسعير: 0.5٪ رسوم المعالجة (https://www.coinpayments.net/help-fees)
de: Preisgestaltung: 0,5% der Transaktion (https://www.coinpayments.net/help-fees)
ru: Модель ценообразования: разовая комиссия в размере 0,5% (https://www.coinpayments.net/help-fees)

source: Documentation: https://www.coinpayments.net/apidoc
ar: الوتيقة:https://www.coinpayments.net/apidoc
de: Dokumentation: https://www.coinpayments.net/apidoc
ru: Документация: https://www.coinpayments.net/apidoc

source: SDK Resources
ar: موارد SDK
de: SDK-Ressourcen
ru: Ресурсы SDK

source: This documentation is also available as a `PDF <https://github.com/dashpay/docs/raw/master/binary/merchants /Integration-Resources-SDK.pdf>`__.
ar: هذه الوتيقة متاحة `هنا <https://github.com/dashpay/docs/raw/master/binary/merchants /Integration-Resources-SDK.pdf>`__.
de: Diese Dokumentation ist ebenfalls als englischsprachiges `PDF <https://github.com/dashpay/docs/raw/master/binary/merchants /Integration-Resources-SDK.pdf>`__ verfügbar.
ru: Эта документация также доступна в формате `PDF <https://github.com/dashpay/docs/raw/master/binary/merchants /Integration-Resources-SDK.pdf>`__.

source: SDKs (Software Development Kits) are used to accelerate the design and development of a product for the Dash Network. These resources can either be used to interface with an API provider or for the creation of standalone applications by forming transactions and/or performing various wallet services.
ru: Средства SDK (набор средств для разработки) используются для ускорения проектирования и разработки продуктов в сети Dash. Эти ресурсы могут использоваться для взаимодействия с провайдером API или для создания автономных приложений. С их помощью можно формировать транзакции и/или предоставлять различные связанные с кошельками услуги.

source: Dash Developer Guide
ar: دليل مطورين داش
ru: Руководство для разработчиков Dash

source: The Dash Developer Guide aims to provide the information you need to understand Dash and start building Dash-based applications. To make the best use of this documentation, you may want to install the current version of Dash Core, either from source or from a pre-compiled executable.
ar: يهدف دليل مطور داش إلى توفير المعلومات التي تحتاجها لفهم داش والبدء في إنشاء تطبيقات تستند إلى داش. لتحقيق الاستفادة المثلى من هذا المستند ، قد تحتاج إلى تثبيت الإصدار الحالي من داش كور ، إما من المصدر أو من ملف قابل للتنفيذ تم ترجمته مسبقًا.
de: Der Dash Developer Guide soll alle Informationen bereitstellen, die notwendig sind, um Dash zu verstehen und darauf basierende Applikationen zu schaffen. Um diese Dokumentation am besten zu verwenden ist es empfehlenswert die aktuelle Version der Dash Core Wallet installiert zu haben.
ru: Руководство разработчика Dash предназначено для предоставления информации, необходимой для понимания Dash и создания приложений на основе Dash. Чтобы наилучшим образом использовать эту документацию, вы можете установить текущую версию Dash Core либо из исходного, либо из предварительно скомпилированного исполняемого файла.

source: Documentation: https://dash-docs.github.io/en/developer-guide
ar: الوتيقة: https://dash-docs.github.io/en/developer-guide
de: Dokumentation: https://dash-docs.github.io/en/developer-guide
ru: Документация: https://dash-docs.github.io/en/developer-guide

source: Dashcore is a fork of Bitcore and operates as a full Dash node — your apps run directly on the peer-to-peer network. For wallet application development, additional indexes have been added into Dash for querying address balances, transaction history, and unspent outputs.
ru: Dashcore является форком Bitcore и работает как полный нода Dash - ваши приложения запускаются непосредственно в децентрализованной сети. Для разработки приложений кошелька в Dash были добавлены дополнительные индексы для запроса балансов адресов, истории транзакций и неизрасходованных выходов.

source: Platform: NodeJS / Javascript
ar: النظام الأساسي: NodeJS / Javascript
de: Plattformen: NodeJS / Javascript
ru: Платформа: NodeJS / Javascript

source: Documentation: https://bitcore.io/api/lib
ar: الوتيقة:https://bitcore.io/api/lib
de: Dokumentation: https://bitcore.io/api/lib
ru: Документация: https://bitcore.io/api/lib

source: Repository lib: https://github.com/dashevo/dashcore-lib
ar: مستودع: https://github.com/dashevo/dashcore-lib
ru: Репозиторий с библиотекой: https://github.com/dashevo/dashcore-lib

source: Repository node: https://github.com/dashevo/dashcore-node
ar: مستودع نود؛ https://github.com/dashevo/dashcore-node
ru: Репозиторий модулей: https://github.com/dashevo/dashcore-node

source: Bitcoin-PHP is an implementation of Bitcoin with support for Dash using mostly pure PHP.
ru: Bitcoin-PHP - это реализация Биткойна с поддержкой Dash, которая в основном использует только PHP.

source: Platform: PHP
ru: Платформа: PHP

source: Documentation: https://github.com/Bit-Wasp/bitcoin-php/blob/master/doc/Introduction.md
ru: Документация: https://github.com/Bit-Wasp/bitcoin-php/blob/master/doc/Introduction.md

source: Repository: https://github.com/Bit-Wasp/bitcoin-php
ru: Репозиторий: https://github.com/Bit-Wasp/bitcoin-php

source: PyCoin is an implementation of a bunch of utility routines that may be useful when dealing with Bitcoin and Dash. It has been tested with Python 2.7, 3.6 and 3.7.
ru: PyCoin это реализация ряда вспомогательных утилит, которые могут быть полезны при работе с Биткойном и Dash. Он тестировался с Python 2.7, 3.6 и 3.7.

source: Platform: Python
ru: Платформа: Python

source: Documentation: https://pycoin.readthedocs.io/en/latest/
ru: Документация: https://pycoin.readthedocs.io/en/latest/

source: Repository: https://github.com/richardkiss/pycoin
ru: Репозиторий: https://github.com/richardkiss/pycoin

source: DashJ is a library for working with the Dash protocol. It can maintain a wallet, send/receive transactions (including InstantSend) without needing a local copy of Dash Core, and has many other advanced features. It's implemented in Java but can be used from any JVM compatible language: examples in Python and JavaScript are included.
ar: داش ج هي مكتبة للعمل مع بروتوكول داش. يمكنه الاحتفاظ بمحفظة ، إرسال / استقبال المعاملات (بما في ذلك الإرسال الفوري) دون الحاجة إلى نسخة محلية من داش كور ، ولديه العديد من الميزات المتقدمة الأخرى. يتم تنفيذه في Java ولكن يمكن استخدامه من أي لغة متوافقة مع JVM: يتم تضمين أمثلة في Python و JavaScript.
ru: DashJ - это библиотека для работы с протоколом Dash. В ней реализована поддержка кошелька, с её помощью можно отправлять/получать транзакции (включая InstantSend), не нуждаясь в локальной копии Dash Core, также она имеет много других дополнительных функций. Реализована на Java, но может использоваться с любым совместимым с JVM языком: присутствуют примеры в Python и JavaScript.

source: Platform: Java
ar: النظام الأساسي: Java
de: Plattformen: Java
ru: Платформа: Java

source: Documentation: https://bitcoinj.github.io/getting-started
ar: الوتيقة:https://bitcoinj.github.io/getting-started
de: Dokumentation: https://bitcoinj.github.io/getting-started
ru: Документация: https://bitcoinj.github.io/getting-started

source: Example application: https://github.com/tomasz-ludek/pocket-of-dash
ar: متال التطبيق: https://github.com/tomasz-ludek/pocket-of-dash
ru: Образец приложения: https://github.com/tomasz-ludek/pocket-of-dash

source: Dash-Sync is an Objective-C Dash blockchain framework for iOS. It implements all most relevant Bitcoin Improvement Proposals (BIPs) and Dash Improvement Proposals (DIPs).
ru: Dash-Sync это блокчейн-фреймворк Dash для iOS на Objective-C. Он реализует большинство релевантных Предложений по улучшению Биткойна (BIPs) и Предложений по улучшению Dash (DIPs).

source: Platform: iOS
ru: Платформа: iOS

source: Repository: https://github.com/dashevo/dashsync-iOS
ru: Репозиторий: https://github.com/dashevo/dashsync-iOS

source: NBitcoin is the most complete Bitcoin library for the .NET platform, and has been patched to include support for Dash. It implements all most relevant Bitcoin Improvement Proposals (BIPs) and Dash Improvement Proposals (DIPs). It also provides low level access to Dash primitives so you can easily build your application on top of it.
ar: NBitcoin هي مكتبة بيتكوين الأكثر اكتمالا لمنصة .NET ، وقد تم تصحيحها لتتضمن دعم داش. وتنفذ جميع مقترحات تحسين بيتكوين الأكثر ملاءمة (BIPs) و داش تحسين الإقتراحات (DIPs). كما يوفر وصولاً منخفض المستوى إلى البدايات الأولية بحيث يمكنك بسهولة إنشاء التطبيق الخاص بك فوقه.
de: NBitcoin ist die umfassendste Bitcoin Library für die .NET-Plattform und wurde dahingehend geupdated, dass Dash unterstützt werden kann. Alle wichtigen Bitcoin Improvement Proposals (BIPs) und Dash Improvement Proposals (DIPs) sind integriert. Zudem kann auf alle Dash-Grundlagen zugegriffen werden, wodurch einfache Applikationen darauf aufbauen können.
ru: NBitcoin - самая полная Биткойн-библиотека для платформы .NET, в которую были внесены изменения с целью добавления поддержки Dash. В ней реализованы все наиболее подходящие предложения по улучшению сети Биткойн (BIPs) и предложения по улучшению сети Dash (DIPs). Она также обеспечивает доступ на нижний уровень к примитивам Dash, поэтому вы можете легко создавать приложения поверх них.

source: Platform: .NET
ar: النظام الأساسي:. NET
de: Plattform: .NET
ru: Платформа: .NET

source: Documentation: https://programmingblockchain.gitbooks.io/programmingblockchain/content/
ar: الوتيقة: https://programmingblockchain.gitbooks.io/programmingblockchain/content/
de: Dokumentation: https://programmingblockchain.gitbooks.io/programmingblockchain/content/
ru: Документация: https://programmingblockchain.gitbooks.io/programmingblockchain/content/

source: Repository: https://github.com/MetacoSA/NBitcoin
ar: مستودع: https://github.com/MetacoSA/NBitcoin
de: Repositorien: https://github.com/MetacoSA/NBitcoin
ru: Репозиторий: https://github.com/MetacoSA/NBitcoin

source: BlockCypher also offers client SDKs.
ar: يوفر BlockCypher أيضًا SDKs للعميل.
de: Auch BlockCypher bietet SDKs an.
ru: BlockCypher также предлагает клиентские SDK.

source: Platform: Ruby, Python, Java, PHP, Go, NodeJS
ar: النظام الأساسي: روبي ، Python ، Java ، PHP ، Go ، NodeJS
de: Plattformen: Ruby, Python, Java, PHP, Go, NodeJS
ru: Платформы: Ruby, Python, Java, PHP, Go, NodeJS

source: Repositories: https://www.blockcypher.com/dev/dash/#blockcypher-supported-language-sdks
ar: المستودعات: https://www.blockcypher.com/dev/dash/#blockcypher-supported-language-sdks
de: Repositorien: https://www.blockcypher.com/dev/dash/#blockcypher-supported-language-sdks
ru: Репозитории: https://www.blockcypher.com/dev/dash/#blockcypher-supported-language-sdks

source: Platform: JavaScript, PHP, Java, Ruby, .NET, Python
ar: النظام الأساسي: JavaScript ، PHP ، Java ، Ruby ، .NET ، Python
de: Plattformen: JavaScript, PHP, Java, Ruby, .NET, Python
ru: Платформы: JavaScript, PHP, Java, Ruby, .NET, Python

source: Repositories: https://gocoin.com/docs
ar: المستودعات: https://gocoin.com/docs
de: Repositorien: https://gocoin.com/docs
ru: Репозитории: https://gocoin.com/docs

source: This documentation is also available as a `PDF <https://github.com/dashpay/docs/raw/master/binary/merchants /Integration-Resources-InstantSend.pdf>`__.
ar: هذه الوتيقة متاحة `هنا <https://github.com/dashpay/docs/raw/master/binary/merchants /Integration-Resources-InstantSend.pdf>`__.
de: Diese Dokumentation ist ebenfalls als englischsprachiges `PDF <https://github.com/dashpay/docs/raw/master/binary/merchants /Integration-Resources-InstantSend.pdf>`__ verfügbar.
ru: Эта документация также доступна в формате `PDF <https://github.com/dashpay/docs/raw/master/binary/merchants /Integration-Resources-InstantSend.pdf>`__.

source: InstantSend is a feature provided by the Dash network that allows for 0-confirmation transactions to be safely accepted by Merchants and other service providers. Secured by the Masternode Network, this mechanism eliminates the risk of a “Double Spend” by locking transaction inputs for a given transaction at a protocol level.
ar: الإرسال الفوري هي ميزة تقدمها شبكة داش التي تسمح للمعاملات 0-تأكيد أن يكون مقبولا بأمان من قبل التجار ومقدمي الخدمات الآخرين. تؤمن هذه الآلية ، المضمونة بشبكة ماسترنود ، خطر حدوث "إنفاق مزدوج" من خلال تأمين مدخلات المعاملة لمعاملة معينة على مستوى البروتوكول.
de: InstantSend ist ein Feature des Dash-Netzwerks, welches Transaktionen mit 0 Bestätigungen erlaubt, die von Händlern und Dienstleistungsanbietern gefahrlos akzeptiert werden können. Diese Transaktionen werden durch das Masternode-Netzwerk gesichert, wobei der Mechanismus das Risiko von „Double Spend“ eliminiert, da bereits transferierte Guthaben auf Protokollebene gesperrt werden.
ru: InstantSend - это функция, предоставляемая сетью Dash, которая позволяет продавцам и другим поставщиками услуг безопасно принимать транзакции с 0-подтверждением. Этот механизм, защищённый сетью мастернод, устраняет риск "двойных трат", блокируя транзакционные входы для данной транзакции на уровне протокола.

source: InstantSend Transactions vs. Standard Transactions
ar: الإرسال الفوري المعاملات مقابل المعاملات القياسية
de: InstantSend-Transaktionen vs. normale Transaktionen
ru: Транзакции InstantSend и стандартные транзакции

source: From an integration perspective there are only minor differences between an InstantSend Transaction and a Standard Transaction. Both transaction types are formed in the same way and are signed using the same process; the key difference is the fee structure and input requirements for InstantSend.
ar: من منظور التكامل هناك اختلافات طفيفة فقط بين معاملات الإرسال الفوري ومعاملات قياسية. يتم تكوين نوعي المعاملة بنفس الطريقة ويتم توقيعهما باستخدام نفس العملية ؛ الاختلاف الرئيسي هو هيكل الرسوم ومتطلبات الإدخال لـ الإرسال الفوري.
de: Aus Integrationsperspektive gibt es nur wenige Unterschiede zwischen Transaktionen mit InstantSend und solchen ohne. Beide Typen werden gleich geformt und signiert. Der wichtigste Unterschied findet sich in der Gebührenstruktur und den Anforderungen einer InstantSend-Eingabe.
ru: С точки зрения интеграции существуют только незначительные различия между транзакцией InstantSend и стандартной транзакцией. Оба типа транзакций формируются одинаково и подписываются с использованием одного и того же процесса; ключевым отличием является структура комиссий и требования по вводу для InstantSend.

source: Fee Structure: InstantSend utilizes a “per-input” fee of 0.0001 DASH per Input.
ar: هيكل الرسوم: يستخدم الإرسال الفوري رسم "لكل إدخال" بقيمة 0.0001 داش لكل إدخال.
de: 1. Gebührenstruktur: InstantSend verlangt pro Input eine Gebühr von 0,0001 Dash.
ru: Структура комиссий: InstantSend использует комиссию “за ввод” в размере 0.0001 DASH за каждый ввод.

source: Input Requirements: All inputs for an InstantSend transaction must have at least 6 confirmations.
ar: متطلبات الإدخال: يجب أن تحتوي جميع المدخلات الخاصة بمعاملات الإرسال الفوري على 6 تأكيدات على الأقل.
de: Inputanforderungen: Alle Inputs einer InstantSend-Transaktion müssen mindestens 6 mal bestätigt worden sein.
ru: Требования для ввода: все вводы средств по транзакциям InstantSend должны иметь как минимум 6 подтверждений.

source: In the event that a given transaction does not meet both criteria it will revert to a standard transaction.
ar: في حالة عدم استيفاء المعاملة المعينة لكلا المعيارين ، فستعود إلى معاملة قياسية.
de: Sollte eine Transaktion diesen Anforderungen nicht entsprechen, wird sie als normale Transaktion durchgeführt.
ru: В случае, если данная транзакция не соответствует обоим критериям, произойдёт возврат к стандартной транзакции.

source: Receiving InstantSend Transactions
ar: تلقي معاملات الإرسال الفوري
de: InstantSend-Transaktionen empfangen
ru: Получение транзакций InstantSend

source: InstantSend transactions are handled in the same way as a Standard Transaction, typically through JSON-RPC, Insight API, or an internal notification script / service that is configured at a server level.
ar: تتم معالجة معاملات الإرسال الفوري بنفس طريقة التعامل مع المعاملات القياسية ، عادةً من خلال JSON-RPC ، أو واجهة برمجة تطبيقات Insight ، أو برنامج نصي / خدمة إشعار داخلي تم تكوينه على مستوى الخادم.
de: InstantSend-Transaktionen werden auf die gleiche Art und Weise gehandhabt wie normale Transaktionen. Sie werden also typischerweise durch JSON-RPC, Insight API oder ein internes Benachrichtigungsskript bzw. einen Benachrichtigungsdienst auf Serverebene konfiguriert.
ru: Операции InstantSend обрабатываются так же, как и стандартная транзакция, как правило, через JSON-RPC, Insight API или внутренний скрипт/службу уведомлений, которые настроены на уровне сервера.

source: JSON-RPC: The following RPC commands will include InstantSend-related information. Within the response you’ll find an “InstantLock” field the status of a given Transaction. This true/false (boolean) value will indicate whether an InstantSend has been observed.
ar: JSON-RPC: ستتضمن أوامر RPC التالية المعلومات المتعلقة بـ الإرسال الفوري. ضمن الرد ستجد حقل "InstantLock" حالة معاملة معينة. ستشير هذه القيمة صحيح / خطأ (boolean) إلى ما إذا تم ملاحظة الإرسال الفوري.
de: JSON-RPC: Die folgenden RPC-Befehle beinhalten Informationen, die sich auf InstantSend beziehen. In der Antwort findet sich ein „InstantLock“-Feld, welches den Status einer Transaktion wiedergibt. Dieser true/false (boolesche) Wert zeigt an, ob InstantSend stattgefunden hat oder nicht.
ru: JSON-RPC: Следующие команды RPC будут включать информацию, связанную с InstantSend. В ответном окне вы найдете поле "InstantLock", в котором будет указан статус данной транзакции. True/false значение (булевого типа) в нём будет указывать на то, выполняется ли InstantSend.

source: GetTransaction: https://dash-docs.github.io/en/developer-reference#gettransaction
ar: الحصول على المعاملة: https://dash-docs.github.io/en/developer-reference#gettransaction
ru: Протокол GetTransaction: https://dash-docs.github.io/en/developer-reference#gettransaction

source: ListTransactions: https://dash-docs.github.io/en/developer-reference#listtransactions
ar: قائمة المعاملات: https://dash-docs.github.io/en/developer-reference#listtransactions
ru: Протокол ListTransactions: https://dash-docs.github.io/en/developer-reference#listtransactions

source: ListSinceBlock: https://dash-docs.github.io/en/developer-reference#listsinceblock
ar: قائمة منذ الحظر: https://dash-docs.github.io/en/developer-reference#listsinceblock
ru: Протокол ListSinceBlock: https://dash-docs.github.io/en/developer-reference#listsinceblock

source: Insight API: Insight API can be used to detect InstantSend transactions and to push notifications to clients using WebSockets. The API can also be manually polled to retrieve Transaction information including InstantSend status.
ar: واجهة برمجة التطبيقات Insight: يمكن استخدام واجهة برمجة التطبيقات Insight للكشف عن معاملات الإرسال الفوري ولإرسال الإشعارات إلى العملاء الذين يستخدمون WebSockets. يمكن أيضًا استقصاء API يدوياً لاسترداد معلومات المعاملة بما في ذلك حالة الإرسال الفوري.
de: Insight API: Durch die Insight API können InstantSend-Transaktionen erkannt werden und per WebSocket an den Client weitergeleitet werden. Die API kann zudem manuell dazu verwendet werden Transaktionsinformationen wie den InstantSend-Status abzufragen.
ru: Insight API: Insight API может использоваться для обнаружения транзакций InstantSend и для отправки уведомлений клиентам с использованием WebSocket'ов. Также можно вручную опросить API, чтобы получить информацию о транзакции, включая статус InstantSend.

source: Transaction API: https://github.com/dashevo/insight-api#instantsend-transactions
ru: API Транзакций: https://github.com/dashevo/insight-api#instantsend-transactions

source: Script Notify: The Dash Core Daemon can be configured to execute an external script whenever an InstantSend transaction relating to that wallet is observed. This is configured by adding the following line to the dash.conf file:
ar: إخطارات البرنامج النصي: يمكن تهيئة داش كوى لتنفيذ برنامج نصي خارجي كلما تمت ملاحظة معاملة الإرسال الفوري ذات الصلة بتلك المحفظة. يتم تكوين هذا عن طريق إضافة السطر التالي إلى ملف dash.conf:
de: Mitteilungsskript: Der Dash Core Daemon kann so konfiguriert werden, dass ein externes Skript mitteilt, wenn eine InstantSend-Transaktion beobachtet werden konnte. Dies wird dadurch konfiguriert, dass die folgende Zeile zu der Datei dash.conf hinzugefügt wird:
ru: Уведомление скрипта: Dash Core Daemon можно настроить для выполнения внешнего скрипта всякий раз, когда выполняется транзакция InstantSend, связанная с конкретным кошельком. Настройка производится путём добавления следующей строки в файл dash.conf:

source: *Note that only addresses imported to the wallet will be monitored for InstantSend Transactions.*
ar: *لاحظ أنه سيتم مراقبة العناوين التي تم استيرادها إلى المحفظة فقط من أجل معاملات الإرسال الفوري*
de: *Nur Adressen, die in eine Wallet importiert wurden, werden hierdurch auf InstantSend-Transaktionen hin überprüft.*
ru: *Обратите внимание, что только импортированные в кошелёк адреса могут быть промониторены для транзакций InstantSend*

source: Broadcasting InstantSend Transactions
ar: البث المعاملات للإرسال الفوري
de: InstantSend-Transaktionen übermitteln
ru: Трансляция транзакций InstantSend

source: InstantSend Transactions can be constructed and broadcast using an approach similar to Standard Transactions. Provided the InstantSend Fee Structure and Input Requirements are met, an InstantSend can be broadcast using JSON-RPC or Insight API as a Raw Transaction.
ar: يمكن بناء المعاملات الفورية والبث باستخدام نهج مماثل للمعاملات القياسية. بشرط استيفاء هيكل رسوم الإرسال الفوري ومتطلبات الإدخال ، يمكن بث الإرسال الفوري باستخدام JSON-RPC أو Insight API كمعاملة أولية
de: InstantSend-Transaktionen werden fast genauso wie normale Transaktionen verfasst und übermittelt. Wenn die Transaktion den InstantSend-Gebühren entspricht und die Eingabevoraussetzungen erfüllt sind, kann sie mit JSON-RPC oder Insight API übermittelt werden.
ru: Транзакции InstantSend можно создавать и транслировать с использованием подхода, аналогичного стандартным транзакциям. При условии соблюдения структуры формирования комиссий InstantSend и требований для ввода, InstantSend может транслироваться с использованием JSON-RPC или Insight API как необработанная транзакция.
