Repository: 12Gitcat/docs
Catalog: locale/*/LC_MESSAGES/merchants/technical.po
Languages: ar, de, ru

source: JSON-RPC: The “SendRawTransaction” RPC command can be utilized to broadcast a raw transaction using InstantSend. When utilizing this command be sure to set both optional parameters as “true”
ar: JSON-RPC: يمكن استخدام أمر RPC "SendRawTransaction" لبث معاملة أولية باستخدام الإرسال الفوري. عند استخدام هذا الأمر ، تأكد من تعيين المعلمات الاختيارية على أنها "true"
de: JSON-RPC: Durch den RPC-Befehle „SendRawTransactions“ kann eine Transaktion mit InstantSend übermittelt werden. Für diesen Befehl ist es wichtig, dass die beiden optionalen Parameter „true“ ausgeben.
ru: JSON-RPC: команда RPC "SendRawTransaction" может использоваться для трансляции исходной транзакции с использованием InstantSend. При использовании этой команды обязательно задайте обоим дополнительным параметрам значение "true"

source: More Information: https://dash-docs.github.io/en/developer-reference#sendrawtransaction
ar: مزيد من المعلومات: https://dash-docs.github.io/en/developer-reference#sendrawtransaction
de: Weitere Informationen: https://dash-docs.github.io/en/developer-reference#sendrawtransaction
ru: Детальная информация: https://dash-docs.github.io/en/developer-reference#sendrawtransaction

source: Insight API: Raw Transactions can also be broadcast as an InstantSend using Insight API. In this case all that is required is to POST the raw transaction using the ``/tx/sendix`` route.
ar: واجهة برمجة تطبيقات الإحصاءات: يمكن أيضًا بث المعاملات الأولية باعتبارها الإرسال الفوري باستخدام واجهة برمجة التطبيقات Insight. في هذه الحالة ، كل ما هو مطلوب هو إدخال المعاملة الأولية باستخدام مسار ``/tx/sendix``.
de: Insight API: InstantSend-Transaktionen können mit der Hilfe von Insight API übermittelt werden. Dafür ist es lediglich notwendig die Transaktion mit diesem Befehl zu versenden:
ru: Insight API: Необработанные транзакции также можно транслировать как InstantSend с помощью API Insight. В этом случае всё, что требуется, - это выполнить запрос POST необработанной транзакции с использованием маршрута ``/tx/sendix``.

source: More Information: https://github.com/dashevo/insight-api#instantsend-transaction
ar: مزيد من المعلومات: https://github.com/dashevo/insight-api#instantsend-transaction
de: Weitere Informationen: https://github.com/dashevo/insight-api#instantsend-transaction
ru: Детальная информация: https://github.com/dashevo/insight-api#instantsend-transaction

source: Additional Resources
ar: موارد إضافية
de: Zusätzliche Ressourcen
ru: Дополнительные ресурсы

source: The following resources provide additional information about InstantSend and are intended to help provide a more complete understanding of the underlying technologies.
ar: توفر الموارد التالية معلومات إضافية حول الإرسال الفوري وتهدف إلى المساعدة على توفير فهم أكثر اكتمالاً للتكنولوجيات الأساسية.
de: Die folgenden Ressourcen bieten weitergehende Informationen über InstantSend und sind dafür gedacht ein besseres Verstehen der zugrundeliegenden Technologie zu ermöglichen.
ru: Следующие ресурсы предоставляют дополнительную информацию о функции InstantSend и предназначены для обеспечения более полного понимания базовых технологий.

source: `InstantSend Whitepaper <https://dashpay.atlassian.net/wiki/download/attachments/75530298/Dash%20Whitepaper%20-%20InstantTX.pdf>`_
ar: `خريطة الإرسال الفوري <https://dashpay.atlassian.net/wiki/download/attachments/75530298/Dash%20Whitepaper%20-%20InstantTX.pdf>`_
ru: `Белая книга по InstantSend <https://dashpay.atlassian.net/wiki/download/attachments/75530298/Dash%20Whitepaper%20-%20InstantTX.pdf>`_

source: `How Dash InstantSend Protect Merchants from Double Spends <https://www.youtube.com/watch?v=HJx82On8jig>`_
ar: `كيفية حماية الإرسال الفوري في داش للتجار من الإنفاق <https://www.youtube.com/watch?v=HJx82On8jig>`_
de: `Wie Dashs InstantSend Händler vor „Double Spending“ schützt <https://www.youtube.com/watch?v=HJx82On8jig>`_
ru: `Как функция Dash InstantSend защищает продавцов от двойных трат <https://www.youtube.com/watch?v=HJx82On8jig>`_

source: `InstantSend Presentation from the Dash Conference London 2017 <https://www.youtube.com/watch?v=n4PELomRiFY>`_
ar: `عرض الإرسال الفوري من مؤتمر داش لندن 2017 <https://www.youtube.com/watch?v=n4PELomRiFY>`_
de: `InstantSend-Präsentation von der Dash Konferenz in London 2017 <https://www.youtube.com/watch?v=n4PELomRiFY>`_
ru: `Презентация InstantSend на Конференции Dash в Лондоне в 2017 году <https://www.youtube.com/watch?v=n4PELomRiFY>`_

source: Vending Machines
ar: آلات البيع
ru: Торговые автоматы

source: Community member moocowmoo has released code to help merchants build their own vending machine and set it up to receive Dash InstantSend payments. The Dashvend software can also be used to create any sort of payment system, including point-of-sale systems, that can accept InstantSend payments.
ar: أصدر عضو المنتدى moocowmoo تعليمات برمجية لمساعدة التجار في إنشاء آلة البيع الخاصة بهم وإعدادها لتلقي دفعات الإرسال الفوري في داش. يمكن أيضًا استخدام برنامج Dashvend لإنشاء أي نوع من أنظمة الدفع ، بما في ذلك أنظمة نقاط البيع ، التي يمكنها قبول دفعات الإرسال الفوري.
ru: Участник сообщества moocowmoo написал код, который призван помочь продавцам разрабатывать свои собственные торговые автоматы и настраивать их для получения платежей Dash InstantSend. Программное обеспечение Dashvend также может использоваться для создания любой платёжной системы, включая системы продаж, которые могут принимать платежи InstantSend.

source: `Open Source Code <https://github.com/moocowmoo/dashvend>`_
ar: `افتح هذا المصدر <https://github.com/moocowmoo/dashvend>`_
ru: `Открытый исходный код <https://github.com/moocowmoo/dashvend>`_

source: `Demonstration website <http://code.dashndrink.com>`_
ar: `موقع العرض التوضيحي <http://code.dashndrink.com>`_
ru: `Демонстрационный веб-сайт <http://code.dashndrink.com>`_

source: `Demonstration video <https://www.youtube.com/watch?v=SX-3kwbam0o>`_
ar: `فيديو توضيحي <https://www.youtube.com/watch?v=SX-3kwbam0o>`_
ru: `Демонстрационное видео <https://www.youtube.com/watch?v=SX-3kwbam0o>`_

source: Price Tickers
ar: مؤشرات السعر
de: Preisticker
ru: Ценовые тикеры

source: You can add a simple price ticket widget to your website using the simple `code snippet generator from CoinGecko <https://www.coingecko.com/en/widgets/ticker/dash/usd>`_.
ar: يمكنك إضافة أداة أسعار تذاكر بسيطة إلى موقعك باستخدام `مُنتِج كود الشفرة من CoinGecko <https://www.coingecko.com/en/widgets/ticker/dash/usd>`_.
de: Ein einfaches Preisticker-Widget kann mit der Hilfe von `CoinGecko <https://www.coingecko.com/en/widgets/ticker/dash/usd>`_ in jede Seite implementiert werden.
ru: Вы можете добавить простой виджет с ценовым тикером на ваш сайт, используя простой `фрагмент из генератора кода CoinGecko <https://www.coingecko.com/en/widgets/ticker/dash/usd>`_.

source: Similar widgets with different designs are available from `CoinLib <https://coinlib.io/widgets>`_, `WorldCoinIndex <https://www.worldcoinindex.com/Widget>`_ and `Cryptonator <https://www.cryptonator.com/widget>`_, while an API providing similar information is available from `DashCentral <https://www.dashcentral.org/about/api>`_.
ar: تتوفر أدوات مماثلة مع تصاميم مختلفة من `CoinLib <https://coinlib.io/widgets>`_, `WorldCoinIndex <https://www.worldcoinindex.com/Widget>`_ و `Cryptonator <https://www.cryptonator.com/widget>`_, بينما تتوفر واجهة برمجة التطبيقات التي توفر معلومات مماثلة من `داش سنترال <https://www.dashcentral.org/about/api>`_.
ru: Аналогичные виджеты с различным дизайном доступны на `CoinLib <https://coinlib.io/widgets>`_, `WorldCoinIndex <https://www.worldcoinindex.com/Widget>`_ и `Cryptonator <https://www.cryptonator.com/widget>`_, в то время как API, предоставляющий аналогичную информацию, доступен из `DashCentral <https://www.dashcentral.org/about/api>`_.

source: QR Codes
ar: الماسح الضوئي
ru: QR-коды

source: Many wallets are capable of generating QR codes which can be scanned to simplify entry of the Dash address. Printing these codes or posting the on your website makes it easy to receive payment and tips in Dash, both online and offline.
ar: العديد من المحافظ قادرة على توليد رموز QR التي يمكن مسحها ضوئيا لتبسيط دخول عنوان داش. يؤدي طباعة هذه الرموز أو نشرها على موقع الويب إلى تسهيل تلقي الدفعات والنصائح في داش ، سواء عبر الإنترنت أو في وضع عدم الاتصال.
ru: Многие кошельки способны генерировать QR-коды, которые затем можно сканировать для упрощения ввода адреса Dash. Печать этих кодов или размещение на вашем сайте позволяет легко получать платежи и чаевые в DASH, находясь как онлайн, так и оффлайн.

source: In Dash Core, go to the **Receive** tab, generate an address if necessary, and double-click it to display a QR code. Right click on the QR code and select **Save Image** to save a PNG file.
ar: في داش كور ، انتقل إلى علامة **استقبال** ، ثم أنشئ عنوانًا إذا لزم الأمر ، وانقر عليه نقرًا مزدوجًا لعرض رمز الاستجابة السريعة. انقر بزر الماوس الأيمن على رمز الاستجابة السريعة وحدد **حفظ الصورة** لحفظ ملف PNG.
ru: В кошельке Dash Core откройте вкладку **Получить**, при необходимости сгенерируйте адрес и дважды кликните на нём, чтобы отобразить QR-код. Кликните правой кнопкой на QR-коде и выберите **Сохранить изображение**, чтобы сохранить его в файл PNG.

source: In Dash for Android, tap **Request Coins** and then tap the QR code to display a larger image. You can screenshot this to save an image.
ar: في داش في الأندرويد ، انقر على **طلب عملات** ثم انقر على رمز QR لعرض صورة أكبر. يمكنك قطة الشاشة هذه لحفظ الصورة.
ru: В кошельке Dash для Android нажмите **Запросить средства**, а затем нажмите на QR-код, чтобы отобразить его увеличенное изображение. Для сохранения этого изображения вы можете сделать его скриншот.

source: In Dash for iOS, swipe to the left to display the **Receive Dash** screen. A QR code and address will appear. You can screenshot this to save an image.
ar: في داش في الأبفون ، مرّر سريعًا إلى اليسار لعرض شاشة **استقبال داش**. سيظهر رمز الاستجابة السريعة والعنوان. يمكنك قطة الشاشة هذه لحفظ الصورة.
ru: В кошельке Dash для iOS протяните влево, чтобы отобразить экран **Запросить средства**. Появятся QR-код и адрес. Для сохранения этого изображения вы можете сделать его скриншот.

source: To generate a QR code from any Dash address, visit `CWA QR Code Generator <https://cwaqrgen.com/dash>`_ and simply paste your Dash address to generate an image.
ar: لإنشاء رمز الاستجابة السريعة من أي عنوان داش ، تفضل بزيارة `هنا <https://cwaqrgen.com/dash>`_ وببساطة قم بلصق عنوان الشرطة خاصتك لإنشاء صورة.
ru: Чтобы сгенерировать QR-код из любого адреса Dash, посетите `CWA QR Code Generator <https://cwaqrgen.com/dash>`_ и просто вставьте свой адрес Dash для генерации изображения.

source: Insight
ar: نظرة

source: The open-source Insight REST API provides you with a convenient, powerful and simple way to read data from the Dash network and build your own services with it.
ar: توفر لك أداة Insight REST المفتوحة المصدر المفتوحة طريقة ملائمة وقوية وبسيطة لقراءة البيانات من شبكة داش وبناء خدماتك الخاصة بها.
de: Die open-source Insight REST API bietet einen benutzerfreundlichen, leistungsstarken und einfachen Weg, um Daten aus dem Dash-Netzwerk in die eigene Plattform zu integrieren.

source: SDKs (Software Development Kits) are used to accelerate the design and development of a product for the Dash Network. These resources can either be used to interface with an API provider or for the creation of standalone applications.
ar: تستخدم حزم SDK (مجموعات تطوير البرامج) لتسريع تصميم وتطوير منتج لشبكة داش. يمكن استخدام هذه الموارد إما للتواصل مع مزود API أو لإنشاء تطبيقات مستقلة.
de: SDKs (Software Development Kits) werden verwendet um die Entwicklung und Gestaltung eines Produktes für das Dash-Netzwerk zu vereinfachen. Diese Ressourcen können entweder verwendet werden, um mit einer API zu interagieren, oder, um eine selbständige Applikation zu schaffen.

source: Dashcore
ar: داش كور

source: Dashcore is a fork of Bitcore and operates as a full Dash node — your apps run directly on the peer-to-peer network. For wallet application development, additional indexes have been added into Dash for querying address balances, transaction history, and unspent outputs.
ar: داش كور هو شوكة Bitcore ويعمل كعقدة داش كاملة - يتم تشغيل تطبيقاتك مباشرة على شبكة نظير إلى نظير. بالنسبة لتطوير تطبيق المحفظة ، تمت إضافة فهارس إضافية في داش للاستعلام عن أرصدة العناوين ، وسجل المعاملات ، والمخرجات غير المنفقة.

source: DashJ
ar: داش ج

source: InstantSend
ar: إرسال فوري

source: Web Socket: https://github.com/dashpay/insight-api-dash#web-socket-api
ar: مقبس الويب: https://github.com/dashpay/insight-api-dash#web-socket-api

source: Transaction API: https://github.com/dashpay/insight-api-dash#instantsend-transactions
ar: واجهة برمجة تطبيقات المعاملات: https://github.com/dashpay/insight-api-dash#instantsend-transactions
de: Transaktions-API: https://github.com/dashpay/insight-api-dash#instantsend-transactions
